[{"title": "Fall Centralized Data Science and Analytics Intern\n- job post", "reqs": ["Developing an understanding of internal clients' business needs by learning about NFA's procedures, risk areas and regulatory framework.", "Identifying possible technical improvements.", "Creating or updating application tools in Python and/or R using advanced modeling techniques.", "Developing Tableau dashboards to present data and application output in a meaningful, visually appealing way.", "Completing code reviews to ensure programs and applications meet organizational standards and end-user requirements.", "Generating ad-hoc SQL queries.", "Participating in and potentially leading CDSA training sessions.", "Pursuing an undergraduate or graduate degree in a quantitative major (e.g. mathematical finance, mathematics, statistics, computer science)", "Experience in data visualization techniques (preferably Tableau)", "Experience in programming (preferably Python, SQL, R and/or Matlab)", "Familiarity with object-oriented programming design and large datasets", "Knowledge of and/or interest in finance or economics", "Excellent oral and written communication skills", "Strong analytical, decision-making and problem-solving skills", "Ability to quickly learn new concepts and adjust to changing priorities/requirements", "Ability to work in NFA's Chicago office at least 20% of the time", "Experience in source control (Git preferred) and testing-driven development a plus", "Experience in Agile/Scrum, Azure Cloud and/or DevOps a plus", "Experience with machine learning/AI a plus"]}, {"title": "Intern - Data Science\n- job post", "reqs": ["Be enrolled in an Bachelors program in Data Science, Statistics, Mathematics, or related field.", "Articulate a willingness to learn program/organizational processes and procedures.", "Demonstrate creative thinking and strong problem solving skills.", "Possess strong leadership, communications, and organizational skills.", "Offer the ability to delve into technical details and translate those into findings and recommendations.", "Must have an active Department of Defense (DoD) Secret security clearance to start and maintain it during the period of employment."]}, {"title": "BCG X Data Scientist Internship\n- job post", "reqs": ["Comfortable in a client-facing role with the ambition to lead teams", "Likes to distill complex results or processes into simple, clear visualizations", "Explain sophisticated data science concepts in an understandable manner", "Love building things and are comfortable working with modern development tools and writing code collaboratively (bonus points if you have a software development or DevOps experience)", "Significant experience applying advanced analytics to a variety of business situations and a proven ability to synthesize complex data", "Deep understanding of modern machine learning techniques and their mathematical underpinnings, and can translate this into business implications for our clients", "Have strong project management skills"]}, {"title": "Multimodal Science/AI Intern\n- job post", "reqs": ["First-hand exposure to Dolby technology.", "A diverse, open, and welcoming culture.", "Practical experience: get to be a part of real-world projects.", "Impact: your work will be used by millions of people every day.", "The potential to publish and/or patent your innovations.", "Multimodal Machine Learning and Deep Learning.", "Audiovisual content analysis and enhancement.", "AI multimodal representation.", "AI for generative media.", "Real-time human sensing for interactive applications (human computer interfaces, affective computing, etc.)", "Immersive experiences and personalization.", "Deep learning-based computer vision and audio processing.", "Working towards a Master’s or Ph.D. degree in Artificial Intelligence, Electrical Engineering, Computer Science, Bioengineering, Neuroscience, or related field.", "Experience working with deep learning architecture for audio or/and video processing.", "Experience developing and training multimodal deep learning architectures.", "Programming experience in Python, and experience working with frameworks like PyTorch or TensorFlow.", "Experience solving analytical problems using quantitative approaches.", "Ability to prototype quickly, with adept critical thinking skills.", "Excellent communication skills and a team-oriented work ethic.", "Proven track record of writing technical reports and/or publications is a plus.", "First-author publications at peer-reviewed AI conferences is a plus.", "Monday, September 25, 2023"]}, {"title": "Intern Data Analysts\n- job post", "reqs": []}, {"title": "Data Science Intern\n- job post", "reqs": ["Assemble large, complex data sets that meet functional / non-functional business requirements", "Develop predictive models that help achieve business targets using R, Python", "Develop visualizations and reports that can drive the story of the data analysis.", "Develop and implement new multivariate methodologies to solve practical business problems.", "Find patterns and insights in unstructured data", "Employ advanced data modeling and forecasting techniques to explore strategic business opportunities and to prescribe actionable recommendations to leverage those opportunities.", "Must be actively enrolled in one of the following degree programs below:", "Business Analytics", "Statistics", "Mathematics", "Actuarial Science", "Data Science", "Economics", "Available work hours will fall between 8 am to 5 pm (Central Time) Monday-Friday. Candidate must be able to work 20 hours per week during the school year, flexing up to 30-40 hours per week during the summer months", "Proficiency in Python, Pandas, NuMPI, and Psychic Learn", "Proven ability to sift through data, identify critical information, develop hypotheses, perform rigorous analyses, and make recommendations to broader audiences.", "Understanding of statistical and predictive modeling concepts, machine-learning approaches, clustering and classification techniques, and recommendation and optimization algorithms", "Able to visualize and report insights creatively in variety of formats to various stakeholders", "Ability to follow industry best practices", "Ability to work with both business and IT partners", "Desire to research and learn new technologies and frameworks", "Demonstrated ability to use data to influence strategic decision making", "Business Analytics", "Statistics", "Mathematics", "Actuarial Science", "Data Science", "Economics", "Our company motto is “Fulfilling Life” and we take that job seriously, with a heavy commitment to volunteering and community support, employee well-being, and providing quality products and services that help our customers create a brighter future.", "Being a mutual-based organization, the return on our investment goesback into the company, to benefit our members/customers.", "We're committed to professional development, opportunity, inclusion, and diversity. Team building and collaboration are also priorities."]}, {"title": "Data Analytics and Cloud Application Intern (Fully Remote)\n- job post", "reqs": ["Utilize data analytics tools and techniques to gather, analyze, and interpret complex data sets; Generate meaningful insights, trends, and recommendations to support data-driven decision-making processes", "Design, develop, and deploy cloud-based web applications using Microsoft Azure and related technologies; Implement scalable and secure cloud architectures that meet business requirements and industry best practices", "Leverage Power Automate, formerly Microsoft Flow, to automate workflows and streamline business processes", "Develop custom flows and integrations to enhance efficiency and productivity", "Utilize Python programming language and relevant frameworks to manipulate, transform, and analyze data; Develop scripts and automation tools to streamline data processes and enable efficient data analysis", "Ensure the successful implementation and maintenance of SSL certificates for web applications; Collaborate with IT and security teams to address any SSL-related issues and ensure a secure environment", "Monitor and manage cloud infrastructure, including virtual machines, storage, and networking components; Optimize performance, troubleshoot issues, and implement necessary configurations.", "Work closely with cross-functional teams, including data scientists, developers, and business stakeholders, to understand requirements, provide technical expertise, and deliver high-quality solutions", "Create detailed documentation, including technical specifications, system diagrams, and user guides; Prepare regular reports and updates on project progress, key metrics, and performance evaluations", "Currently pursuing a bachelor's degree in Computer Science, Data Science, or a related field", "Experience in data analytics, cloud application development, and SSL support", "Strong proficiency in Microsoft Azure cloud technologies, including web app services, virtual machines, and Azure storage", "Experience with Power Automate or similar workflow automation tools", "Proficiency in Python programming and relevant libraries for data manipulation and analysis", "Knowledge of SSL certificate management and security best practices", "Familiarity with cloud infrastructure management and monitoring tools", "Strong problem-solving and analytical skills", "Excellent communication and collaboration skills", "Detail-oriented with a focus on delivering high-quality results", "Ability to adapt to changing technologies and prioritize tasks effectively"]}, {"title": "Temporary Internship - Artificial Intelligence and Machine Learning\n- job post", "reqs": ["Work closely with the university’s IT team to understand the specific needs of the university community.", "Explore the potential benefits of chatbot development for the university.", "Develop and test prototypes of chatbots.", "Evaluate and compare different chatbot technologies.", "Provide recommendations for the implementation of chatbots at the university.", "Participate in meetings and presentations to update stakeholders on the progress of the project.", "Currently pursuing a Bachelor’s or Master’s degree in Computer Science, Information Technology, or related field.", "Familiarity with natural language processing, machine learning, and other AI techniques.", "Experience with programming languages such as Python, Java, or C++.", "Front-end/mobile app development skills, such as HTML, CSS, and JavaScript.", "Strong problem-solving skills and attention to detail.", "Excellent communication and collaboration skills.", "Ability to work independently as well as part of a team.", "Minimum GPA of 3.5.", "Ability to adhere to University COVID-19 Policy", "Ability to adhere to University COVID-19 Policy", "Familiarity with chatbot development.", "Familiarity with language models, such as GPT-2, GPT-3, BERT, and others.", "Familiarity with cloud services such as AWS, Azure, or Google Cloud."]}, {"title": "Data Engineering Internship, Applications Engineering (Fall 2023)\n- job post", "reqs": ["Data Engineering: The Data Engineering team is building a state-of-the- art analytics platform for business and operation intelligence. At Tesla, we have enormous amounts of data and we want to give meaning to it and help business users to make data driven decisions. Our platform will allow users to answer \"what\", \"when\" and \"how\" questions as well as allow them to ask \"what if?” Interns will help design, develop, maintain and support our Enterprise Data Warehouse & BI platform within Tesla. This position offers a unique opportunity to impact to the entire organization by developing data tools and creating a data driven culture.", "Data Platforms: Data is deeply embedded in the product and engineering culture at Tesla. We rely on data – lots of it – to improve autopilot, to optimize hardware designs, to proactively detect faults, and to optimize load on the electrical grid. This a small but fast-growing team which is building and operating the big data platform for the company. We collect massive amounts of IoT data, provide storage, access, and high-volume processing. Your work will affect many hundreds of Tesla engineers daily, as well as improve the functionality of our cars, chargers, and batteries worldwide.", "Energy Analytics: The Energy Analytics team uses data analytics to bridge the engineering, service, and deployment of Tesla’s charging infrastructure and to enhance the charging experience worldwide. With over 18,000 Superchargers and several thousand destination charging sites around the world, Tesla’s charging infrastructure aims to accelerate the world’s transition to sustainable transportation by enabling electric mobility without compromises.", "Fleet Analytics: The Fleet Analytics team supports and enhances products through the use of data science and data analytics tools. This team brings together data scientists and software engineers from across the company to foster collaboration, efficiency and to advance the best engineering and data analytics practices in the analytics community.", "Currently working towards a BS, MS, or advanced degree in a relevant engineering program such as Computer Science, Computer Engineering, or Electrical Engineering", "Proficiency in one or more of the following developer skills: Python, Java, Go, C/C++, Ruby, SQL or other common industry languages", "Familiarity with database concepts such as MySQL, MS SQL", "Nice to have for Data Platforms: Kafka, ETL, IoT telemetry experience, Site Reliability experience", "Nice to have for Data Analytics: AirFlow, Splunk, Kafka, Spark", "Excellent grasp of fundamental computer science concepts and ability to write well-organized code", "Eagerness to collaborate cross-functionally with other engineering teams while able to work independently; detail-oriented and execution focused"]}, {"title": "Intern, Data Science\n- job post", "reqs": ["Application of machine learning in global healthcare", "Receive shadowing opportunities with seasoned professionals", "Receive guidance from a designated mentor", "Network with leaders in the international development field", "Gain the opportunity to hone your communications and presentation skills", "Benefit from consistent guidance and feedback to build skills and experience to chart a fulfilling professional future", "Learn about the different facets of business (business development, proposal preparation, and project delivery)", "This internship can lead to a potential full-time job offer upon graduation, based on performance and work requirements", "Conduct desk review of machine learning applications using routinely collected data in global health", "Train and evaluate an ML model on a topic / outcome to be determined together with project team and client", "Present model results to internal and client audiences", "Support your portfolio internship supervisor with a variety of tasks and activities that could support the portfolio’s business and internal and external clients. These could include project specific tasks, business development activities", "Attend meetings as instructed by your internship supervisor to learn about the different facets of international development industry", "Work with your team in project management, business development, communications, or other activities as needed"]}, {"title": "Data & Control Systems Engineer Intern – Fall 2023\n- job post", "reqs": ["Design advanced control and data acquisition systems for propulsion test stands, including panel layouts, power and load analysis, fabrication drawings, and instrumentation lists", "Solve a wide range of technical challenges, across broad ranges of timeframe, complexity, cost, and long-term impact", "Support test and launch operations and perform related improvements to existing test stands", "Potentially travel to production, test, and launch locations", "Create, modify, and optimize software that will be to test and launch Terran 1", "Gain hands on experience working with control hardware", "Support test and launch operations and perform related improvements to existing test stands", "Potentially travel to and from production, test, and launch locations", "Real time image processing used for gas detection", "Worked on test stand infrastructure to help run tests more often and more efficiently", "Design printed circuit boards for a variety of applications", "Create software that will be used to test and launch Terran 1!", "Test rocket engines!", "Current undergraduate or graduate student earning degree electrical, computer, software, aerospace, or mechanical engineering, computer science, or other related field", "Ability to work in a fast-paced and intense startup environment", "Ownership of projects from beginning to end, with minimum oversight", "Experience with software development processes including source control, bug tracking, and design documentation", "Experience in C/C++ and/or python", "Basic knowledge of common instrumentation, pressure transducers, thermocouples, RTD, flow meters, accelerometers, strain gauges, load cells", "Basic knowledge of data acquisition hardware"]}, {"title": "Data Analyst Coop Internship\n- job post", "reqs": ["Research and develop statistical learning models for data analysis", "Collaborate with Data Engineering, People Science, business partners, and Chief Technology Officer to devise innovative and forward-thinking solutions", "Keep up-to-date with the latest technology trends", "Communicate results and ideas to key stakeholders at Vee", "Implement new statistical or other mathematical methodologies as needed for specific models or analysis", "Optimize joint efforts between Data Science, Data Engineering, business partners, UX, and People Science teams at Vee to drive business results", "Masters degree in Computer Science, Applied Statistics, Applied math, Business Analytics, Data Science, or a related field", "Practical experience with statistical languages (SAS, R, Pandas), data processing, database programming, and data analytics", "Solid background in data mining and statistical analysis", "Experience with Python programming language", "Knowledge of data visualization tools (e.g. PowerBI, Tableau)", "Strong collaboration skills - you partner well with others to solve problems and actively incorporate input from various sources", "Excellent oral and written communication skills", "Working with key stakeholders to drive business results", "Love what you do, love to be busy, and love to produce by being organized and methodical", "Work with a sense of urgency and have a strong drive for results", "Have the resilience and agility to adapt quickly in a fast-paced environment", "Work independently as well as collaboratively to stretch thinking into creative solutions", "Have strong verbal and written communication skills", "Are excited about and suited for a startup, where you'll be wearing a few hats", "Are smart and fun with an empathetic nature, which will add to our culture"]}, {"title": "Intern, Innovation Data Science (Fall 2023)\n- job post", "reqs": ["Partner with team members on innovation engagements to better understand problem statements and identify opportunities to use data to strengthen the value proposition", "Collaborate cross-divisionally to understand data sets, queries, and nuances to supplement value statements with data stories", "Demonstrate persistence and resourcefulness in finding the information, data, and tools you need to get the job done, including proactively seeking information and clarity from a variety of sources and channels", "Assist with the data extraction, discovery, and transformation from multiple and complex, as well as non-traditional data sources to support business cases and initiative value proposition", "Assist with the development and presentation of analytics work to leadership and other stakeholders in a digestible way", "Good written, oral communication, and interpersonal skills", "Successful candidate should possess analytical, critical thinking, and organization skills", "Comfortable asking for help when you need it", "Experience with business intelligence tools such as Python, SAS/SQL, or Hyperion/Brio", "Experience with data visualization tools such as Tableau or PowerBI", "Consistently makes safety and security, of self and others, the priority", "Consistently prioritizes safety and security of self, others, and personal data.", "Embraces diverse people, thinking, and styles.", "Possesses a high school diploma, GED, or high school equivalency.", "Is at least 18 years of age and has authorization to work in the United States.", "Self-starter with the ability to work independently and collaboratively", "Curiosity and willingness to explore topics beyond the surface", "Good communication skills", "Monday to Friday"]}, {"title": "Toner Supplies Marketing - Intern for Data Science\n- job post", "reqs": ["Pursuing a Master’s in Data Science", "Strong analytical and communication skills", "Ability to work efficiently in cross functional team", "Strong interest in artificial intelligence data mining techniques", "Capacity to source, organize and interpret complex data sets to gain deeper understanding and guide strategy formulation.", "Capability to communicate the deeper understanding to provide new and actionable insights in support of decision making to create productive action.", "Application of Strategic/Critical thinking and Problem Solving to move the business forward."]}, {"title": "Data Science Leadership Development Program (DSLDP) Intern\n- job post", "reqs": ["The internship offers a training curriculum focused on data science and business acumen. Other program components include formal mentoring, networking, and career guidance.", "DSLDP Intern duties will vary based on the specific assignment, within one of our research groups, including:", "Bond & Specialty Insurance", "Business Insurance Research & Development", "Claim Business Intelligence & Analytics", "Personal Insurance Research & Development", "Other departments, including Artificial Intelligence and Emerging Technologies", "Work includes:", "Providing recommendations on projects that deal with data science related concepts", "Designing and building statistical models, analyses at the right level of complexity to produce relevant results for the business", "Identifying, integrating and structuring complex data flows", "Identifying new opportunities for analytic solutions", "Validate, manipulate and perform data analysis tasks", "Provide qualitative and quantitative data support to ensure accuracy of metrics", "Perform other duties as assigned.", "Pursuing a Master’s or PhD level degree in Statistics, Mathematics, or Data Science.", "Applied statistical knowledge and experience solving “real-world” problems.", "Demonstrated ability to communicate technical concepts to a non-technical audience.", "Experience with a programming language (Python, R, SAS, etc).", "Accountability: Strong track record of taking ownership and responsibility for actions and outcomes, performance, and results.", "Analytical and Critical Thinking: Demonstrated aptitude in identifying current or future problems or opportunities, analyzing data, synthesizing and comparing information to understand issues, identifying cause/effect relationships and exploring alternative solutions to support sound decision making.", "Change Management/Resilience: Ability to remain energized and focused in the face of ambiguity, change or strenuous demands.", "Customer Focus: Proven customer service skills with the ability to provide service excellence to internal or external clients.", "Emotional Intelligence: Demonstrated track record of self and social awareness, empathy and balances confidence with humility.", "Interpersonal: Excellent communication skills with the ability to actively engage with others while maintaining a positive attitude.", "Judgment/Decision Making: Capability of exercising sound judgment, making decisions and committing to a position.", "Leveraging Differences: Proven capacity to works with and include people from different backgrounds, experiences, cultures, races, etc. and view those differences as assets to be leveraged to accomplish business goals and objectives.", "Relationship Management: Strong relationship management skills including the ability to seek out, build, foster and maintain productive relationships, networks or alliances to meet goals and achieve results.", "Teamwork: Ability to work together in situations when actions are interdependent, and a team is mutually responsible to produce a result.", "Work Ethic: Possession of a strong drive to do what it takes to get the job done; inquisitive and demonstrates a strong willingness to learn.", "Obtained a Bachelor’s degree in Statistics, Mathematics, Decision Sciences, Actuarial Science, or a related analytical STEM field.", "Legally authorized to work in the United States now and in the future."]}, {"title": "Fall Centralized Data Science and Analytics Intern\n- job post", "reqs": ["Developing an understanding of internal clients' business needs by learning about NFA's procedures, risk areas and regulatory framework.", "Identifying possible technical improvements.", "Creating or updating application tools in Python and/or R using advanced modeling techniques.", "Developing Tableau dashboards to present data and application output in a meaningful, visually appealing way.", "Completing code reviews to ensure programs and applications meet organizational standards and end-user requirements.", "Generating ad-hoc SQL queries.", "Participating in and potentially leading CDSA training sessions.", "Pursuing an undergraduate or graduate degree in a quantitative major (e.g. mathematical finance, mathematics, statistics, computer science)", "Experience in data visualization techniques (preferably Tableau)", "Experience in programming (preferably Python, SQL, R and/or Matlab)", "Familiarity with object-oriented programming design and large datasets", "Knowledge of and/or interest in finance or economics", "Excellent oral and written communication skills", "Strong analytical, decision-making and problem-solving skills", "Ability to quickly learn new concepts and adjust to changing priorities/requirements", "Ability to work in NFA's Chicago office at least 20% of the time", "Experience in source control (Git preferred) and testing-driven development a plus", "Experience in Agile/Scrum, Azure Cloud and/or DevOps a plus", "Experience with machine learning/AI a plus"]}, {"title": "Intern - Data Science\n- job post", "reqs": ["Be enrolled in an Bachelors program in Data Science, Statistics, Mathematics, or related field.", "Articulate a willingness to learn program/organizational processes and procedures.", "Demonstrate creative thinking and strong problem solving skills.", "Possess strong leadership, communications, and organizational skills.", "Offer the ability to delve into technical details and translate those into findings and recommendations.", "Must have an active Department of Defense (DoD) Secret security clearance to start and maintain it during the period of employment."]}, {"title": "BCG X Data Scientist Internship\n- job post", "reqs": ["Comfortable in a client-facing role with the ambition to lead teams", "Likes to distill complex results or processes into simple, clear visualizations", "Explain sophisticated data science concepts in an understandable manner", "Love building things and are comfortable working with modern development tools and writing code collaboratively (bonus points if you have a software development or DevOps experience)", "Significant experience applying advanced analytics to a variety of business situations and a proven ability to synthesize complex data", "Deep understanding of modern machine learning techniques and their mathematical underpinnings, and can translate this into business implications for our clients", "Have strong project management skills"]}, {"title": "Multimodal Science/AI Intern\n- job post", "reqs": ["First-hand exposure to Dolby technology.", "A diverse, open, and welcoming culture.", "Practical experience: get to be a part of real-world projects.", "Impact: your work will be used by millions of people every day.", "The potential to publish and/or patent your innovations.", "Multimodal Machine Learning and Deep Learning.", "Audiovisual content analysis and enhancement.", "AI multimodal representation.", "AI for generative media.", "Real-time human sensing for interactive applications (human computer interfaces, affective computing, etc.)", "Immersive experiences and personalization.", "Deep learning-based computer vision and audio processing.", "Working towards a Master’s or Ph.D. degree in Artificial Intelligence, Electrical Engineering, Computer Science, Bioengineering, Neuroscience, or related field.", "Experience working with deep learning architecture for audio or/and video processing.", "Experience developing and training multimodal deep learning architectures.", "Programming experience in Python, and experience working with frameworks like PyTorch or TensorFlow.", "Experience solving analytical problems using quantitative approaches.", "Ability to prototype quickly, with adept critical thinking skills.", "Excellent communication skills and a team-oriented work ethic.", "Proven track record of writing technical reports and/or publications is a plus.", "First-author publications at peer-reviewed AI conferences is a plus.", "Monday, September 25, 2023"]}, {"title": "Intern Data Analysts\n- job post", "reqs": []}, {"title": "Data Science Internship (Fall 2023)\n- job post", "reqs": ["", "", "", "", "", "", "", "", "", "", ""]}, {"title": "Data Science Intern\n- job post", "reqs": ["Assist in data collection, cleaning, and preprocessing tasks to ensure high-quality datasets for analysis.", "Conduct data analysis using statistical methods and data visualization techniques.", "Support the development and implementation of machine learning models and algorithms.", "Collaborate with the team to identify areas for improvement and contribute to data-driven solutions.", "Assist in the creation of data visualizations and reports to communicate findings to stakeholders.", "Stay updated on the latest trends and advancements in data science and apply them to the internship projects.", "Learn from experienced data scientists and professionals in the field, seeking guidance and feedback.", "Collaborate with cross-functional teams, including developers and product managers, to support data-driven decision-making.", "Contribute to the continuous improvement of data processes and methodologies within the organization.", "Currently pursuing a degree in Data Science, Computer Science, Statistics, or a related field.", "Strong analytical skills and a passion for working with data.", "Proficiency in programming languages such as Python or R.", "Familiarity with data manipulation and analysis libraries (e.g., pandas, NumPy).", "Basic understanding of statistical analysis and machine learning concepts.", "Experience with data visualization tools is a plus.", "Excellent problem-solving and critical-thinking abilities.", "Strong communication skills and the ability to work effectively in a team.", "Self-motivated and eager to learn and contribute to data science projects.", "Enthusiasm for the mobile app industry and an interest in data-driven decision-making.", "Ability to adapt to a fast-paced and dynamic work environment.", "Day shift", "Monday to Friday", "Optional: Have you familiarized yourself with the app, are you passionate about finance, which feature do you feel excited to work on?"]}, {"title": "Fall Intern, Data Engineering - Part Time\n- job post", "reqs": ["Contribute in one or more areas of development, ranging from web UI, iOS/Android mobile, music recommendation systems, backend scaling, internal tools, creator tools, user analytics and data science applications and services.", "Perform other duties as required.", "Internships are open to current students enrolled at a university (those graduating by May 2025 are preferred) and recent graduates who graduated within the 12-month period prior to the start of the internship.", "Majors in computer science, data science, machine learning, statistics, finance or a related field preferred.", "Experience with analytics, SQL databases, big data storage platforms and/or machine learning a plus", "Experience developing object-oriented code or functional programming language - Java, Python, Scala or similar", "Previous experience in software development and/or machine learning - work projects, internships, summer jobs, etc. preferred.", "Be enthusiastic about learning new technologies and skills.", "Interest in how companies use data to deliver fantastic experience to our users.", "Must be capable of managing time well and working collaboratively.", "Excellent communication skills, both written and verbal, are required.", "Must have legal right to work in the U.S."]}, {"title": "Data Scientist Intern\n- job post", "reqs": []}, {"title": "Data Scientist Intern\n- job post", "reqs": []}, {"title": "Machine Learning Engineer Intern - Remote US Fall 2023\n- job post", "reqs": ["Achieving data science and software engineering goals set by you and your mentor", "Learning about Splunk, both the product and the company", "Working and socializing with the other interns as well as full-time employees", "Actively pursuing a Bachelor's, Master's, or PhD in Computer Science, Software Engineering, Computer Engineering, Electrical Engineering, Mathematics or a related technical field, and a strong record of academic achievement.", "Applicants should have a minimum of one quarter/semester remaining in their studies after their internship concludes.", "Able to work 40 hours a week for 15 weeks from September-December 2023", "Strong interest in state-of-art Machine Learning techniques", "Ability to work well with others in a fast-paced environment", "Exposure to working within an agile environment", "Strong communication skills, verbal and written", "Passion for solving exciting problems", "Hands-on experience in Machine Learning techniques, such as logistic regression, naïve Bayes, SVM, decision trees and random forests etc.", "Solid understanding of statistical modeling/machine learning/data mining", "Experience programming in a large software project – at school, professionally, or in an open source context", "The opportunity to work with a set of extraordinarily talented and dedicated peers, all the way from engineering and QA to product management and customer support. Splunk flourishes with disruption and diversity.", "A constant stream of new things for you to learn and an opportunity for growth and mentorship. We believe in growing engineers through ownership and leadership opportunities. We also believe mentors help both sides of the equation.", "A stable, collaborative and supportive work environment."]}, {"title": "Data Science Intern\n- job post", "reqs": ["Provide insights into machine learning techniques focused on classification, supervised learning, reinforced learning and eventually deep learning", "Produce new and creative ML solutions in a landscape may include neural networks, with specific interest and emphasis on classification, supervised and unsupervised learning leading to deep learning systems, computer vision, human-computer interaction", "Work with stakeholders throughout the organization to identify opportunities for leveraging company data to drive business solutions", "Assess the effectiveness and accuracy of new data sources and data gathering techniques", "Develop custom data models and algorithms to apply to data sets", "Coordinate with different functional teams to implement models and monitor outcomes", "Develop processes and tools to monitor and analyze model performance and data accuracy", "May require early morning or late night meetings to coordinate work assignments with our worldwide geographical development team.", "Strong problem solving skills", "Experience using statistical computer languages (R, Python, SLQ, etc.) to manipulate data and draw insights from large data sets.", "Experience working with and creating data architectures.", "Knowledge of a variety of machine learning techniques (clustering, decision tree learning, artificial neural networks, etc.) and their real-world advantages/drawbacks.", "Knowledge of advanced statistical techniques and concepts (regression, properties of distributions, statistical tests and proper usage, etc.) and experience with applications.", "Both DS skills and general data engineering skills.", "Excellent written and verbal communication skills for coordinating across teams.", "A drive to learn and master new technologies and techniques", "Knowledge and experience in statistical and data mining techniques: GLM/Regression, Random Forest, Boosting, Trees, text mining, etc.", "Knowledge/Experience querying databases and using statistical computer languages: R, Python", "Knowledge/Experience using web services: Spark, S3, RedShift, etc.", "Knowledge/Experience creating and using advanced machine learning algorithms and statistics: regression, simulation, scenario analysis, modeling, clustering, decision trees, neural networks, etc.", "Knowledge/Experience with distributed data/computing tools: Map/Reduce, Hadoop, Hive, Spark, MySQL", "Knowledge/Experience with NoSQL databases, such as MongoDB, Neo4J, Neptune, Cassandra, HBase and associated languages (Cypher, Gremlin)", "8 hour shift", "Monday to Friday"]}, {"title": "Machine Learning / AI Internships\n- job post", "reqs": ["We typically look for talent with a background in computer science, engineering, applied mathematics, or major equivalent", "Expertise with Machine Learning or Natural Language Processing (NLP), ideally in one or more of these areas: Natural Language Understanding (NLU), Natural Language Generation (NLG), Structured Prediction, Unsupervised Learning & Representation Learning, Text-to-Speech (TTS) or Question Answering", "Python", "ML libraries like TensorFlow, PyTorch, etc.", "Our aim is to create an experience that allows you to learn without pressure, gain practical skills, build real world experience, develop a greater understanding of our industry and form valuable connections.", "You will join an extraordinary team, including world-class software engineers and leading machine learning practitioners who are all passionate about applying groundbreaking techniques to AI.", "We will partner you with a dedicated mentor who is an authority in your specialist area. You and your mentor will collaborate to design and implement an innovative solution for an ML or NLP problem that is meaningful. At the end of your internship, you will have the opportunity to meet and present your work to the AIML leadership. Where appropriate, there may be the ability to submit your work for publication at a suitable conference.", "Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Apple is a drug-free workplace", "This posting is not for a specific job opening and by submitting your resume you are expressing interest in being contacted about this type of role at Apple in the future."]}, {"title": "2023 Diversity Leadership Symposium: 2024 Nestlé USA Data Science Internship\n- job post", "reqs": ["Gain valuable exposure to life and careers at Nestlé and discover how a diverse and inclusive environment fuels career growth", "Network with business leaders and develop relationships with peers from universities across the nation while participating in engaging experiences", "Interview for our 2024 Nestlé USA Data Science Internship, with a chance to return to school with an internship offer in hand", "Graduate students pursuing Master of Science in Data Science, Computer Science, Engineering (Operations Research, Industrial), Business Analytics, Applied Mathematics and/or Statistics. Graduating between December 2024 and June 2025.", "Showcases a strong level of academic success (Cumulative GPA 3.0+)", "Coding skills for analytics and data analysis (SQL, R, Python, etc.)", "Experience with large data sets.", "Results focused and can clearly speak to projects they’ve executed.", "Passionate lifelong learners who are agile and stay abreast of the evolving technology and data landscape.", "Embraces courage to propose new ways of operating and challenges the status quo.", "Leverages their intellectual curiosity to aid in problem solving and distills complex information into simple ideas", "Resourceful, self-starter who applies varied means to uncover answers and arrive at conclusions.", "Fire from within to execute and deliver a successful end product and do it better than the competition.", "Strong communicators who encourage others and excel in a team environment.", "Competitive compensation package.", "Furnished, subsidized housing, car rental, and relocation (for those who qualify)", "Exposure to senior leadership through project presentation and mentoring", "Volunteer in a community service opportunity with one of Nestlé’s Share Valued Organizations (e.g. Boys & Girls Club of America & Nestlé Adopt-A-School Program)", "Potential employment opportunities after completion of degree"]}, {"title": "Data Science Intern\n- job post", "reqs": ["Work on high-visibility projects (e.g. price optimization, content marketing, and demand forecasting)", "Participate in customer engagement, product definition, success metrics, prioritize features, to deliver a polished market-ready product", "Conduct end-to-end analysis that includes data gathering and requirements specification, processing, analysis, and effectively communicate findings and provide key insights/recommendations to various functional leads", "Own cross-functional interactions for your features (across eng/marketing/field/sales)", "Degree or currently pursuing degree in a quantitative discipline (e.g. Operations Research, Statistics, Economics)", "Proficient knowledge of R or Python, SQL", "Comfortable with quantitative analysis, statistical techniques, data mining", "Good communicator (written & visual presentation)", "Strong interpersonal skills and ability to influence others", "Great team player"]}, {"title": "Fall 2023 Intern, Analytics, Fundraising & Engagement (Data Science)\n- job post", "reqs": ["Conducting exploratory analysis on a variety of data sources to help create features for models", "Using multivariate techniques (e.g. GLMs, decision trees, ensemble models like random forest or gradient boosted trees) to help derive insights from data", "Using survival models and other statistical models to understand the lifetime value of our donors.", "Collecting, cleaning, and joining datasets from diverse sources", "Interpreting the results of analyses for non-technical audiences", "Presenting work internally and to stakeholders on other teams", "Engage in special projects and other duties as assigned", "Center principles of equity, inclusion, and belonging in all work, embedding the values in program development, policy application, and organizational practices and processes", "Demonstrate a commitment to the mission of the ACLU", "Demonstrate a commitment to diversity within the office using a personal approach that values all individuals and respects differences in regards to race, ethnicity, age, gender identity and expression, sexual orientation, religion, disability and socio-economic circumstance", "Demonstrate a commitment to work collaboratively and respectfully toward resolving obstacles and/or conflicts", "Familiarity with Python, R, SQL, or similar analytics and programming language.", "Familiarity with the analytics toolkit in Python (e.g. pandas, scikit-learn, statsmodels, matplotlib, seaborn, etc.) or R (e.g. tidyverse packages like dplyr, tidymodels, ggplot or packages like caret).", "Has prior academic or professional experience cleaning and/or combining tabular data sources.", "Basic exposure to at least one of following: Machine Learning, Causal Inference, Bayesian statistics", "Excellent problem-solving skills", "Excellent organizational and communication skills", "Experience working in the cloud (I.e. AWS, Azure or GCP) a plus", "Proficiency in Microsoft Word, PowerPoint, and Excel a plus", "Commitment to work collaboratively and respectfully toward resolving obstacles and/or conflict", "A commitment to civil liberties, civil rights, and social justice", "Commitment to the mission of the ACLU", "Location: Our Internship Program offers a limited number of remote or hybrid intern positions. Candidates for this internship can select a fully remote or hybrid (part in-person and part remote) arrangement.", "Time Commitment: This internship requires a part-time commitment of 10 or 15 hours hours per week.", "Internship Duration: Part-time internships extend for 12 weeks and begin either September 11 or September 25, 2023.", "Stipend: A stipend is available for those students who do not receive course credit and are lawfully authorized to work. Students who receive outside funding are eligible for a partial stipend to bring their total funding up to the level of ACLU's stipend amount for that term, if applicable. Arrangements can be made with educational institutions for work/study or course credit. Below is the stipend breakdown:\n$20/hour for undergraduate students or equivalent experience and $24/hour for graduate and law students or equivalent experience", "$20/hour for undergraduate students or equivalent experience and $24/hour for graduate and law students or equivalent experience", "$20/hour for undergraduate students or equivalent experience and $24/hour for graduate and law students or equivalent experience"]}, {"title": "2023 Data Science Researcher Intern\n- job post", "reqs": ["PhD student studying Computer Science, Electrical Engineering", "Passionate about writing production quality code", "Knowledge in distributed compute/data processing technologies (eg: Apache Hadoop, Spark, Hive)", "Curious learner that keeps up to date with ML technologies, ML frameworks and libraries (eg. Tensor Flow, Pytorch, scikit-learn)", "Understanding of data structures, data modeling and software architectures", "Knowledge of SQL and NoSQL databases and ELK stack", "Knowledge or demo projects with Container technology and AWS services including S3, Amazon ECS or Google cloud", "Experience in NLP, AI, Voice Assistants, Machine Learning"]}, {"title": "Data Scientist - Intern\n- job post", "reqs": ["Brand (marketplace quality improvement, NLP and/or Computer Vision background preferred)", "Define, plan and execute cutting-edge machine learning or other new algorithms that will be a/b tested with guidance from a manager or technical lead", "Communicate project objectives and results clearly, both within the group as well as to the broader team", "Tackle complex issues inherent in managing a two-sided marketplace. Your ability to identify and address these challenges will be critical to our continued growth and success", "We are open to currently enrolled Master's & PhD students and recent Master's & PhD graduates, who have an academic focus in Computer Science, Operations Research, Statistics, Econometrics or a related technical field", "Hands on experience with real datasets and familiarity using python, sklearn, numpy, pandas, and SQL", "Familiarity with various machine learning techniques and statistical methodologies (Bayesian methods, experimental design, causal inference)", "A track record of developing end-to-end Data Science projects and/or producing academic papers that have been showcased in top journals or conferences", "We are entrepreneurs: Faire is being built for entrepreneurs, by entrepreneurs. We believe entrepreneurship is a calling and our mission is to empower entrepreneurs to chase their dreams. Every member of our team is an owner of the business and taking part in the founding process.", "We are using technology and data to level the playing field: We are leveraging the power of product innovation and machine learning to connect brands and boutiques from all over the world, building a growing community of more than 350,000 small business owners.", "We build products our customers love: Everything we do is ultimately in the service of helping our customers grow their business because our goal is to grow the pie - not steal a piece from it. Running a small business is hard work, but using Faire makes it easy.", "We are curious and resourceful: Inquisitive by default, we explore every possibility, test every assumption, and develop creative solutions to the challenges at hand. We lead with curiosity and data in our decision making, and reason from a first principles mentality."]}, {"title": "Fall Centralized Data Science and Analytics Intern\n- job post", "reqs": ["Developing an understanding of internal clients' business needs by learning about NFA's procedures, risk areas and regulatory framework.", "Identifying possible technical improvements.", "Creating or updating application tools in Python and/or R using advanced modeling techniques.", "Developing Tableau dashboards to present data and application output in a meaningful, visually appealing way.", "Completing code reviews to ensure programs and applications meet organizational standards and end-user requirements.", "Generating ad-hoc SQL queries.", "Participating in and potentially leading CDSA training sessions.", "Pursuing an undergraduate or graduate degree in a quantitative major (e.g. mathematical finance, mathematics, statistics, computer science)", "Experience in data visualization techniques (preferably Tableau)", "Experience in programming (preferably Python, SQL, R and/or Matlab)", "Familiarity with object-oriented programming design and large datasets", "Knowledge of and/or interest in finance or economics", "Excellent oral and written communication skills", "Strong analytical, decision-making and problem-solving skills", "Ability to quickly learn new concepts and adjust to changing priorities/requirements", "Ability to work in NFA's Chicago office at least 20% of the time", "Experience in source control (Git preferred) and testing-driven development a plus", "Experience in Agile/Scrum, Azure Cloud and/or DevOps a plus", "Experience with machine learning/AI a plus"]}, {"title": "Internship - Machine Learning\n- job post", "reqs": ["You are a student or a new graduate of Associates, Bachelor's, Master's & PhD degree.", "Some experience with developing Machine Learning pipelines.", "Experience with one or more general purpose programming languages including but not limited to: C/C++ or Python.", "Some understanding of visual recognition, classification, insight generation and similar.", "Exposure to deep learning frameworks including PyTorch and Tensorflow.", "Understanding of model quantization or learning quantized models.", "Experience with NVIDIA Triton, Deepstream.", "Experience with MLOps concepts (Data versioning, ML pipelines, model serving).", "Tell us what you know about machine learning. How would you begin to approach figuring out where we stand with our technology, and where we should be standing?", "Chart us an example of a machine learning pipeline that can support the needs of modern applications (related to detecting a person's activity)", "What technologies inspired you recently? What machine learning technologies are you the most excited about?"]}, {"title": "Data Science Internship (Fall 2023)\n- job post", "reqs": ["Contribute to all the stages of data science projects: from translating a complex business problem into a data science problem to performing data analysis & modeling, and providing solutions to the business.", "Apply various ML, advanced analytics, and visualization techniques to various projects across the company.", "Develop and maintain complex data pipelines, supporting our team’s mission in democratizing data and enabling a data driven organization, partnering with Data Analysts, Data Engineers, Machine Learning (ML) Engineers, and Product Managers.", "Effectively communicate actionable insights to stakeholders with varying degree of data science understanding and backgrounds.", "Currently working towards a BS, MS, or advanced degree in a quantitative field (e.g. Data Science, Applied Mathematics, Business Analytics, Operations Research, Statistics, Computer Science, Artificial Intelligence, Economics or Engineering).", "Proficiency in SQL and Python, especially in standard data science libraries and frameworks", "Results oriented with strong business acumen and practical data science skills.", "Strong written, verbal, and interpersonal communication skills.", "Prior success deploying ML solutions.", "Experience in data engineering tools such as Airflow, Spark, Kafka, etc.", "Experience in visualization tools such as Tableau, PowerBI, etc."]}, {"title": "Data Science Intern\n- job post", "reqs": ["Assist in data collection, cleaning, and preprocessing tasks to ensure high-quality datasets for analysis.", "Conduct data analysis using statistical methods and data visualization techniques.", "Support the development and implementation of machine learning models and algorithms.", "Collaborate with the team to identify areas for improvement and contribute to data-driven solutions.", "Assist in the creation of data visualizations and reports to communicate findings to stakeholders.", "Stay updated on the latest trends and advancements in data science and apply them to the internship projects.", "Learn from experienced data scientists and professionals in the field, seeking guidance and feedback.", "Collaborate with cross-functional teams, including developers and product managers, to support data-driven decision-making.", "Contribute to the continuous improvement of data processes and methodologies within the organization.", "Currently pursuing a degree in Data Science, Computer Science, Statistics, or a related field.", "Strong analytical skills and a passion for working with data.", "Proficiency in programming languages such as Python or R.", "Familiarity with data manipulation and analysis libraries (e.g., pandas, NumPy).", "Basic understanding of statistical analysis and machine learning concepts.", "Experience with data visualization tools is a plus.", "Excellent problem-solving and critical-thinking abilities.", "Strong communication skills and the ability to work effectively in a team.", "Self-motivated and eager to learn and contribute to data science projects.", "Enthusiasm for the mobile app industry and an interest in data-driven decision-making.", "Ability to adapt to a fast-paced and dynamic work environment.", "Day shift", "Monday to Friday", "Optional: Have you familiarized yourself with the app, are you passionate about finance, which feature do you feel excited to work on?"]}, {"title": "Fall Intern, Data Engineering - Part Time\n- job post", "reqs": ["Contribute in one or more areas of development, ranging from web UI, iOS/Android mobile, music recommendation systems, backend scaling, internal tools, creator tools, user analytics and data science applications and services.", "Perform other duties as required.", "Internships are open to current students enrolled at a university (those graduating by May 2025 are preferred) and recent graduates who graduated within the 12-month period prior to the start of the internship.", "Majors in computer science, data science, machine learning, statistics, finance or a related field preferred.", "Experience with analytics, SQL databases, big data storage platforms and/or machine learning a plus", "Experience developing object-oriented code or functional programming language - Java, Python, Scala or similar", "Previous experience in software development and/or machine learning - work projects, internships, summer jobs, etc. preferred.", "Be enthusiastic about learning new technologies and skills.", "Interest in how companies use data to deliver fantastic experience to our users.", "Must be capable of managing time well and working collaboratively.", "Excellent communication skills, both written and verbal, are required.", "Must have legal right to work in the U.S."]}, {"title": "Data Scientist Intern\n- job post", "reqs": []}, {"title": "Data Scientist Intern\n- job post", "reqs": []}, {"title": "Multimodal Science/AI Intern\n- job post", "reqs": ["First-hand exposure to Dolby technology.", "A diverse, open, and welcoming culture.", "Practical experience: get to be a part of real-world projects.", "Impact: your work will be used by millions of people every day.", "The potential to publish and/or patent your innovations.", "Multimodal Machine Learning and Deep Learning.", "Audiovisual content analysis and enhancement.", "AI multimodal representation.", "AI for generative media.", "Real-time human sensing for interactive applications (human computer interfaces, affective computing, etc.)", "Immersive experiences and personalization.", "Deep learning-based computer vision and audio processing.", "Working towards a Master’s or Ph.D. degree in Artificial Intelligence, Electrical Engineering, Computer Science, Bioengineering, Neuroscience, or related field.", "Experience working with deep learning architecture for audio or/and video processing.", "Experience developing and training multimodal deep learning architectures.", "Programming experience in Python, and experience working with frameworks like PyTorch or TensorFlow.", "Experience solving analytical problems using quantitative approaches.", "Ability to prototype quickly, with adept critical thinking skills.", "Excellent communication skills and a team-oriented work ethic.", "Proven track record of writing technical reports and/or publications is a plus.", "First-author publications at peer-reviewed AI conferences is a plus.", "Monday, September 25, 2023"]}, {"title": "Data & Control Systems Engineer Intern – Fall 2023\n- job post", "reqs": ["Design advanced control and data acquisition systems for propulsion test stands, including panel layouts, power and load analysis, fabrication drawings, and instrumentation lists", "Solve a wide range of technical challenges, across broad ranges of timeframe, complexity, cost, and long-term impact", "Support test and launch operations and perform related improvements to existing test stands", "Potentially travel to production, test, and launch locations", "Create, modify, and optimize software that will be to test and launch Terran 1", "Gain hands on experience working with control hardware", "Support test and launch operations and perform related improvements to existing test stands", "Potentially travel to and from production, test, and launch locations", "Real time image processing used for gas detection", "Worked on test stand infrastructure to help run tests more often and more efficiently", "Design printed circuit boards for a variety of applications", "Create software that will be used to test and launch Terran 1!", "Test rocket engines!", "Current undergraduate or graduate student earning degree electrical, computer, software, aerospace, or mechanical engineering, computer science, or other related field", "Ability to work in a fast-paced and intense startup environment", "Ownership of projects from beginning to end, with minimum oversight", "Experience with software development processes including source control, bug tracking, and design documentation", "Experience in C/C++ and/or python", "Basic knowledge of common instrumentation, pressure transducers, thermocouples, RTD, flow meters, accelerometers, strain gauges, load cells", "Basic knowledge of data acquisition hardware"]}, {"title": "Data Science Leadership Development Program (DSLDP) Intern\n- job post", "reqs": ["The internship offers a training curriculum focused on data science and business acumen. Other program components include formal mentoring, networking, and career guidance.", "DSLDP Intern duties will vary based on the specific assignment, within one of our research groups, including:", "Bond & Specialty Insurance", "Business Insurance Research & Development", "Claim Business Intelligence & Analytics", "Personal Insurance Research & Development", "Other departments, including Artificial Intelligence and Emerging Technologies", "Work includes:", "Providing recommendations on projects that deal with data science related concepts", "Designing and building statistical models, analyses at the right level of complexity to produce relevant results for the business", "Identifying, integrating and structuring complex data flows", "Identifying new opportunities for analytic solutions", "Validate, manipulate and perform data analysis tasks", "Provide qualitative and quantitative data support to ensure accuracy of metrics", "Perform other duties as assigned.", "Pursuing a Master’s or PhD level degree in Statistics, Mathematics, or Data Science.", "Applied statistical knowledge and experience solving “real-world” problems.", "Demonstrated ability to communicate technical concepts to a non-technical audience.", "Experience with a programming language (Python, R, SAS, etc).", "Accountability: Strong track record of taking ownership and responsibility for actions and outcomes, performance, and results.", "Analytical and Critical Thinking: Demonstrated aptitude in identifying current or future problems or opportunities, analyzing data, synthesizing and comparing information to understand issues, identifying cause/effect relationships and exploring alternative solutions to support sound decision making.", "Change Management/Resilience: Ability to remain energized and focused in the face of ambiguity, change or strenuous demands.", "Customer Focus: Proven customer service skills with the ability to provide service excellence to internal or external clients.", "Emotional Intelligence: Demonstrated track record of self and social awareness, empathy and balances confidence with humility.", "Interpersonal: Excellent communication skills with the ability to actively engage with others while maintaining a positive attitude.", "Judgment/Decision Making: Capability of exercising sound judgment, making decisions and committing to a position.", "Leveraging Differences: Proven capacity to works with and include people from different backgrounds, experiences, cultures, races, etc. and view those differences as assets to be leveraged to accomplish business goals and objectives.", "Relationship Management: Strong relationship management skills including the ability to seek out, build, foster and maintain productive relationships, networks or alliances to meet goals and achieve results.", "Teamwork: Ability to work together in situations when actions are interdependent, and a team is mutually responsible to produce a result.", "Work Ethic: Possession of a strong drive to do what it takes to get the job done; inquisitive and demonstrates a strong willingness to learn.", "Obtained a Bachelor’s degree in Statistics, Mathematics, Decision Sciences, Actuarial Science, or a related analytical STEM field.", "Legally authorized to work in the United States now and in the future."]}, {"title": "Intern, Innovation Data Science (Fall 2023)\n- job post", "reqs": ["Partner with team members on innovation engagements to better understand problem statements and identify opportunities to use data to strengthen the value proposition", "Collaborate cross-divisionally to understand data sets, queries, and nuances to supplement value statements with data stories", "Demonstrate persistence and resourcefulness in finding the information, data, and tools you need to get the job done, including proactively seeking information and clarity from a variety of sources and channels", "Assist with the data extraction, discovery, and transformation from multiple and complex, as well as non-traditional data sources to support business cases and initiative value proposition", "Assist with the development and presentation of analytics work to leadership and other stakeholders in a digestible way", "Good written, oral communication, and interpersonal skills", "Successful candidate should possess analytical, critical thinking, and organization skills", "Comfortable asking for help when you need it", "Experience with business intelligence tools such as Python, SAS/SQL, or Hyperion/Brio", "Experience with data visualization tools such as Tableau or PowerBI", "Consistently makes safety and security, of self and others, the priority", "Consistently prioritizes safety and security of self, others, and personal data.", "Embraces diverse people, thinking, and styles.", "Possesses a high school diploma, GED, or high school equivalency.", "Is at least 18 years of age and has authorization to work in the United States.", "Self-starter with the ability to work independently and collaboratively", "Curiosity and willingness to explore topics beyond the surface", "Good communication skills", "Monday to Friday"]}, {"title": "Toner Supplies Marketing - Intern for Data Science\n- job post", "reqs": ["Pursuing a Master’s in Data Science", "Strong analytical and communication skills", "Ability to work efficiently in cross functional team", "Strong interest in artificial intelligence data mining techniques", "Capacity to source, organize and interpret complex data sets to gain deeper understanding and guide strategy formulation.", "Capability to communicate the deeper understanding to provide new and actionable insights in support of decision making to create productive action.", "Application of Strategic/Critical thinking and Problem Solving to move the business forward."]}, {"title": "Data Science Intern\n- job post", "reqs": ["Work through the full data science lifecycle: ask/receive question, collect/clean/store/manage data, perform exploration/analysis/modeling, derive insights, distribute information to shareholders through custom applications, data visualization tools, reports, and presentations.", "Complete research projects highlighting new ideas and potential areas of study.", "Support data and video requests from Football Operations", "Manage analytics infrastructure (databases, servers, containers, packages, code repositories, security, etc.)", "Bachelor’s Degree in Data Science, Computer Science, Engineering, Statistics, Applied Mathematics, or related fields", "Advanced degree or other continuing education a plus", "Inventive approach – desire to create and design new solutions that solve complex problems", "Detail oriented with strong analytical skills and an eagerness to learn and implement new technologies", "Strong interpersonal and relationship management skills", "Able to own individual projects as well as work on a team", "Self-motivated, dedicated and solutions oriented", "Comfortable working in an agile environment with a small team", "Motivated to work in professional football", "Football knowledge is a plus", "Experience using R (preferred) or Python to:", "Clean, aggregate, summarize, and pre-process data", "Develop, train, and validate supervised machine learning models", "Produce engaging data visualizations", "Experience using SQL", "Some experience with:", "Version control systems (Git)", "Containerization (Docker)", "Interactive web applications (R Shiny)", "BI/data visualization tools (Tableau/Qlik)", "Hierarchical/Mixed modeling"]}, {"title": "Data Engineer Intern 2024\n- job post", "reqs": ["Work for one of South Florida’s 2023 Top Workplaces", "Continuous learning opportunities", "Energetic and collaborative environment", "Work alongside world-renowned data scientists and Kaggle competitors including Grandmasters", "Daily on-site meals and snacks", "Career growth potential", "Volunteer opportunities", "Game rooms with ping pong, foosball, pool table, darts and arcade", "Office location four minutes from the beach", "Highly competitive base salary", "Profit sharing bonus", "Fully paid employee medical coverage", "Dental, vision, life and disability insurance", "Generous 401K match, $1 for $1 up to 4% of compensation"]}, {"title": "Internship: Data Scientist, Health Informatics\n- job post", "reqs": ["Work remotely with a cross-functional team of analysts, medical doctors, business leaders, and IT professionals to develop and deliver informatics and analytics services and solutions utilizing data from varied healthcare related data sources", "Utilize strong data science programming, quantitative and analytical skills to standardize, integrate, analyze, and model large clinical data", "Identify meaningful patterns in diagnostic test results using data mining, pattern recognition techniques (clustering, association rule mining, and decision trees), and predictive analytics (regression modelling, machine and deep learning, neural networks)", "Contribute to product development including visualizations and statistics-based altering systems to enable public health entities and clinicians to better serve their communities.", "Build scaled data engineering algorithms to minimize the need for additional data curation", "Work on end-to-end projects from data engineering, through advanced analytics, to final presentation and visualization", "Other duties as assigned", "Master’s degree student in quantitative field including Data Science, Biostatistics, Bioinformatics, Public Health, Computer Science, Economics, Statistics, or Mathematics", "Strong ability to work on multiple projects simultaneously, balancing priorities, and to work on cross-functional teams", "Ability to work on large data sets using Python is required", "Candidates with both advanced Python and SQL skills are strongly preferred", "Experience using data mining, pattern recognition, machine learning, deep learning, statistical and/or mathematical programming and modeling preferred", "Experience with visualization tools like Tableau, AWS-Quicksight, qlik, Power-BI, SAS-VIYA preferred", "Use of other tools like AWS-Sagemaker preferred", "Professional data science/data engineering experience preferred", "Experience with clinical/health care data and specifically lab data preferred", "Excellent communication skills strongly preferred", "Experience with Microsoft Office products required. Expertise in Excel preferred", "Open to limited travel"]}, {"title": "Battery Data Scientist Internship (Fall 2023)\n- job post", "reqs": ["Designing tests and analyzing data to explore fundamental battery degradation modes", "Exploring large datasets to evaluate, benchmark, and understand cell lifetime and degradation", "Creating tools for rapid analysis of datasets and characterization techniques", "Improve robustness of our ML and analysis pipeline", "Currently working towards a BS, MS, or PhD in Chemical Engineering, Mechanical Engineering, Materials Science, Electrical Engineering, Computer Science, or equivalent", "Significant, demonstrated technical contributions towards past projects", "Programming experience with Python (preferred), MATLAB, and/or JavaScript", "Ability to work independently on multiple projects with complex requirements", "Excellent communication skills, both verbal and written", "Experience with continuous integration / continuous deployment", "Some familiarity with dev-ops tools: Git, Jenkins, Docker, Kubernetes, Splunk, Redis", "Some familiarity with data science, image analysis and deep learning"]}, {"title": "Software Development, Data and AI internship with leadership training\n- job post", "reqs": ["100% remote", "Regular team bonding exercise", "Flexible hours with communication", "Communication and leadership coaching", "Select platforms, plan features and define the architecture and technology road map.", "Be part of the dynamic engineering team.", "Adopt an appropriate development methodology.", "Estimate costs and timelines.", "Develop software applications to integrate bio-sensors, mobile apps, and virtual communication platforms (HTML, CSS, JavaScript, ReactJS, NodeJS, AngularJS, WebRTC, SemanticUI, MongoDB, WordPress, Woocommerce, PrintOnDemand).", "Build a HIPPA-compliant data server, and integrate bio-sensor data into the virtual platform.", "Build artificial intelligence algorithms utilizing machine learning and big data.", "React: 1 year (Preferred)", "JavaScript: 1 year (Preferred)"]}, {"title": "Artificial Intelligence & Machine Learning, Internship\n- job post", "reqs": ["Utilize tools such as OpenAI, ChatGPT and others to develop a process for creating tools to simplify our marketing content creation, market research and other similar use cases", "Utilize tools such as OpenAI to support our operations teams on an ad-hoc basis to support new challenges", "Recently graduated with a degree in a technology-related field", "Experience with the OpenAI API and ChatGPT", "Experience in mobile web development", "Familiarity with natural language processing, machine learning, and other AI techniques", "Familiarity with language models, such as GPT-2, GPT-3, BERT, etc..", "Familiarity with cloud services such as AWS, Azure, or Google Cloud", "Experience with scrum and other agile based methodology of software development", "Experience working with large data sets", "Experience in food industry"]}, {"title": "Data Science Specialist - Internship\n- job post", "reqs": ["Work closely with engineering directors, product leaders, global sales strategy, and executive leadership to ensure solutions alignment with engineering, product, and go-to-market priorities", "Work with the VP of Operations, Kasey McKenney on Data Solutions initiatives, as well as the CEO and other key leaders to set a data-driven vision and direction for Predictive Analytics Definition and Commercialization at Upper Hand; oversee delivery and execution across the complete portfolio of SQL query management, ETL and ELT design and delivery, Data Analysis and Visualization and Predictive Analytics solutions", "Mine large amounts of data and perform data analysis to extract useful business insights for a wide range of topics including product development and performance, market dynamics, consumer and audience knowledge, internal operations, and external research", "Deliver presentations to senior leadership to explain and illustrate complex analytical findings", "Medical: Upper Hand pays 80% of premium for both the employee and dependents", "Dental and Vision: Upper Hand pays 50% premium for both the employee and dependents", "401K benefits offered through Guideline with premium offerings from Vanguard", "Combined Personal Time Off (PTO): Unlimited days per year", "Modern office with ergonomic Herman-Miller sit-stand desks, chairs and rotating dual monitor stands; Seven flat-screen tv’s with a relaxation room", "Free coffee and tea with 16 flavors; complimentary snacks and other beverages", "Company retreats and outings", "Support for H-1B sponsorship"]}, {"title": "Data Science Intern\n- job post", "reqs": ["Assemble large, complex data sets that meet business requirements", "Scrub data", "Construct automatable processes for replication", "Explore and analyze complex relationships to identify underlying trends, patterns, and relationships", "Develop visualizations, reports, and observation summaries", "Identify relevant features or covariates to inform model selection", "Develop, test, and validate multivariate statistical, predictive, or machine learning model(s)", "Interpret and document findings, lessons learned, and final recommendations", "Create and maintain appropriate technical documentation, code repository, and source control", "Assist in developing end-to-end pipeline for production as appropriate", "Critically evaluate final model, algorithms, processes, or recommendations. Document potential limitations and biases.", "Meet department and company performance and attendance expectations.", "Follow the PacificSource privacy policy and HIPAA laws and regulations concerning confidentiality and security of protected health information.", "Perform other duties as assigned.", "Educational and/or applied experience with:\nResearch methods\nProgram evaluation\nHealth care analysis\nCreating technical documentation", "Research methods", "Program evaluation", "Health care analysis", "Creating technical documentation", "Research methods", "Program evaluation", "Health care analysis", "Creating technical documentation", "Proficiency in at least one or more programming languages (such as R, Python, SAS, Stata, MPlus, SQL, SPSS) with a desire to learn new technologies as needed.", "Working understanding of statistical and predictive modeling concepts (and appropriate uses), machine learning approaches, natural language processes, and/or clustering and classification techniques", "Work well both independently and on a team", "Excellent communication skills", "Self-motivated and eager to learn", "Strong critical thinking and collaborative problem-solving skills", "Attention to details both subtle and obvious", "working knowledge of relational databases", "experience working with large, complex data sets", "experience wrangling and scrubbing data sets", "coursework in statistical modeling", "interest in pursuing career in the health system, public health, or health care field", "Adaptability", "Building Customer Loyalty", "Building Strategic Work Relationships", "Building Trust", "Continuous Improvement", "Contributing to Team Success", "Planning and Organizing", "Work Standards", "We are committed to doing the right thing.", "We are one team working toward a common goal.", "We are each responsible for customer service.", "We practice open communication at all levels of the company to foster individual, team and company growth.", "We actively participate in efforts to improve our many communities-internally and externally.", "We actively work to advance social justice, equity, diversity and inclusion in our workplace, the healthcare system and community.", "We encourage creativity, innovation, and the pursuit of excellence."]}, {"title": "Intern, Data Scientist (Remote in USA)\n- job post", "reqs": ["Perform detailed analysis of solar, wind and storage performance data, using new in-house techniques, for internal R&D;", "Work independently to investigate and develop innovative analytical solutions;", "Write sophisticated data analysis code in Python;", "Communicate effectively your questions and conclusions.", "Internship in final year of B.Sc. or in M.Sc. (or similar STEM degree)", "Proficiency in Python (strongly preferred) or other programming languages;", "Solid knowledge in statistics and mathematics;", "Good understanding of machine learning and data mining algorithms;", "Proven team player, able to gain the respect of clients and colleagues;", "Ability to grasp and clearly communicate complex ideas.", "A humble cause with a clear purpose– you will help us fight climate change with every day at work. We aim to be environmentally conscious in all aspects of our operations.", "Work with passionate experts and top-talents in your field– we are proud of our highly skilled crowd and the savviness each of us brings to the team.", "Friendly and uplifting atmosphere – we believe kindness and respectfulness is core for our culture. A friendly smile or a helping hand is never far away.", "Flexible hours and workplace – it is the result that counts, not when or where. Our hybrid/remote work setup allows everyone to set themselves up for success and create a more sustainable work-life balance.", "All the benefits you expect (and more) – besides the basic benefits (adopted to local needs and norms), you will enjoy perks such as 8h of paid volunteering per year and participation in our Corporate Bonus Program (to name a few)."]}, {"title": "Data Engineering Intern (Remote from MD/VA/DC Only) Fall Recruitment\n- job post", "reqs": ["Extract, manage, and analyze data for reporting and recommendations", "Develop ad hoc and strategic reporting to support Quality initiatives", "Build pilot projects to explore potential data-driven solutions and products", "Communicate findings and recommendations to Quality leadership", "Explore complex and messy data sets and learn to derive and communicate actionable insights", "Learn proficiency in SQL, Snowflake, and automation tools such as Alteryx", "Gain a deeper understanding of the healthcare quality landscape", "Basic SQL programming experience", "Basic proficiency in Microsoft Excel (loading and saving data, simple formulas, etc.)", "Experience with healthcare quality measurement or improvement"]}, {"title": "Multimodal Science/AI Intern\n- job post", "reqs": ["First-hand exposure to Dolby technology.", "A diverse, open, and welcoming culture.", "Practical experience: get to be a part of real-world projects.", "Impact: your work will be used by millions of people every day.", "The potential to publish and/or patent your innovations.", "Multimodal Machine Learning and Deep Learning.", "Audiovisual content analysis and enhancement.", "AI multimodal representation.", "AI for generative media.", "Real-time human sensing for interactive applications (human computer interfaces, affective computing, etc.)", "Immersive experiences and personalization.", "Deep learning-based computer vision and audio processing.", "Working towards a Master’s or Ph.D. degree in Artificial Intelligence, Electrical Engineering, Computer Science, Bioengineering, Neuroscience, or related field.", "Experience working with deep learning architecture for audio or/and video processing.", "Experience developing and training multimodal deep learning architectures.", "Programming experience in Python, and experience working with frameworks like PyTorch or TensorFlow.", "Experience solving analytical problems using quantitative approaches.", "Ability to prototype quickly, with adept critical thinking skills.", "Excellent communication skills and a team-oriented work ethic.", "Proven track record of writing technical reports and/or publications is a plus.", "First-author publications at peer-reviewed AI conferences is a plus.", "Monday, September 25, 2023"]}, {"title": "Data & Control Systems Engineer Intern – Fall 2023\n- job post", "reqs": ["Design advanced control and data acquisition systems for propulsion test stands, including panel layouts, power and load analysis, fabrication drawings, and instrumentation lists", "Solve a wide range of technical challenges, across broad ranges of timeframe, complexity, cost, and long-term impact", "Support test and launch operations and perform related improvements to existing test stands", "Potentially travel to production, test, and launch locations", "Create, modify, and optimize software that will be to test and launch Terran 1", "Gain hands on experience working with control hardware", "Support test and launch operations and perform related improvements to existing test stands", "Potentially travel to and from production, test, and launch locations", "Real time image processing used for gas detection", "Worked on test stand infrastructure to help run tests more often and more efficiently", "Design printed circuit boards for a variety of applications", "Create software that will be used to test and launch Terran 1!", "Test rocket engines!", "Current undergraduate or graduate student earning degree electrical, computer, software, aerospace, or mechanical engineering, computer science, or other related field", "Ability to work in a fast-paced and intense startup environment", "Ownership of projects from beginning to end, with minimum oversight", "Experience with software development processes including source control, bug tracking, and design documentation", "Experience in C/C++ and/or python", "Basic knowledge of common instrumentation, pressure transducers, thermocouples, RTD, flow meters, accelerometers, strain gauges, load cells", "Basic knowledge of data acquisition hardware"]}, {"title": "Data Science Leadership Development Program (DSLDP) Intern\n- job post", "reqs": ["The internship offers a training curriculum focused on data science and business acumen. Other program components include formal mentoring, networking, and career guidance.", "DSLDP Intern duties will vary based on the specific assignment, within one of our research groups, including:", "Bond & Specialty Insurance", "Business Insurance Research & Development", "Claim Business Intelligence & Analytics", "Personal Insurance Research & Development", "Other departments, including Artificial Intelligence and Emerging Technologies", "Work includes:", "Providing recommendations on projects that deal with data science related concepts", "Designing and building statistical models, analyses at the right level of complexity to produce relevant results for the business", "Identifying, integrating and structuring complex data flows", "Identifying new opportunities for analytic solutions", "Validate, manipulate and perform data analysis tasks", "Provide qualitative and quantitative data support to ensure accuracy of metrics", "Perform other duties as assigned.", "Pursuing a Master’s or PhD level degree in Statistics, Mathematics, or Data Science.", "Applied statistical knowledge and experience solving “real-world” problems.", "Demonstrated ability to communicate technical concepts to a non-technical audience.", "Experience with a programming language (Python, R, SAS, etc).", "Accountability: Strong track record of taking ownership and responsibility for actions and outcomes, performance, and results.", "Analytical and Critical Thinking: Demonstrated aptitude in identifying current or future problems or opportunities, analyzing data, synthesizing and comparing information to understand issues, identifying cause/effect relationships and exploring alternative solutions to support sound decision making.", "Change Management/Resilience: Ability to remain energized and focused in the face of ambiguity, change or strenuous demands.", "Customer Focus: Proven customer service skills with the ability to provide service excellence to internal or external clients.", "Emotional Intelligence: Demonstrated track record of self and social awareness, empathy and balances confidence with humility.", "Interpersonal: Excellent communication skills with the ability to actively engage with others while maintaining a positive attitude.", "Judgment/Decision Making: Capability of exercising sound judgment, making decisions and committing to a position.", "Leveraging Differences: Proven capacity to works with and include people from different backgrounds, experiences, cultures, races, etc. and view those differences as assets to be leveraged to accomplish business goals and objectives.", "Relationship Management: Strong relationship management skills including the ability to seek out, build, foster and maintain productive relationships, networks or alliances to meet goals and achieve results.", "Teamwork: Ability to work together in situations when actions are interdependent, and a team is mutually responsible to produce a result.", "Work Ethic: Possession of a strong drive to do what it takes to get the job done; inquisitive and demonstrates a strong willingness to learn.", "Obtained a Bachelor’s degree in Statistics, Mathematics, Decision Sciences, Actuarial Science, or a related analytical STEM field.", "Legally authorized to work in the United States now and in the future."]}, {"title": "Intern, Innovation Data Science (Fall 2023)\n- job post", "reqs": ["Partner with team members on innovation engagements to better understand problem statements and identify opportunities to use data to strengthen the value proposition", "Collaborate cross-divisionally to understand data sets, queries, and nuances to supplement value statements with data stories", "Demonstrate persistence and resourcefulness in finding the information, data, and tools you need to get the job done, including proactively seeking information and clarity from a variety of sources and channels", "Assist with the data extraction, discovery, and transformation from multiple and complex, as well as non-traditional data sources to support business cases and initiative value proposition", "Assist with the development and presentation of analytics work to leadership and other stakeholders in a digestible way", "Good written, oral communication, and interpersonal skills", "Successful candidate should possess analytical, critical thinking, and organization skills", "Comfortable asking for help when you need it", "Experience with business intelligence tools such as Python, SAS/SQL, or Hyperion/Brio", "Experience with data visualization tools such as Tableau or PowerBI", "Consistently makes safety and security, of self and others, the priority", "Consistently prioritizes safety and security of self, others, and personal data.", "Embraces diverse people, thinking, and styles.", "Possesses a high school diploma, GED, or high school equivalency.", "Is at least 18 years of age and has authorization to work in the United States.", "Self-starter with the ability to work independently and collaboratively", "Curiosity and willingness to explore topics beyond the surface", "Good communication skills", "Monday to Friday"]}, {"title": "Toner Supplies Marketing - Intern for Data Science\n- job post", "reqs": ["Pursuing a Master’s in Data Science", "Strong analytical and communication skills", "Ability to work efficiently in cross functional team", "Strong interest in artificial intelligence data mining techniques", "Capacity to source, organize and interpret complex data sets to gain deeper understanding and guide strategy formulation.", "Capability to communicate the deeper understanding to provide new and actionable insights in support of decision making to create productive action.", "Application of Strategic/Critical thinking and Problem Solving to move the business forward."]}, {"title": "Artificial Intelligence & Machine Learning, Internship\n- job post", "reqs": ["Utilize tools such as OpenAI, ChatGPT and others to develop a process for creating tools to simplify our marketing content creation, market research and other similar use cases", "Utilize tools such as OpenAI to support our operations teams on an ad-hoc basis to support new challenges", "Recently graduated with a degree in a technology-related field", "Experience with the OpenAI API and ChatGPT", "Experience in mobile web development", "Familiarity with natural language processing, machine learning, and other AI techniques", "Familiarity with language models, such as GPT-2, GPT-3, BERT, etc..", "Familiarity with cloud services such as AWS, Azure, or Google Cloud", "Experience with scrum and other agile based methodology of software development", "Experience working with large data sets", "Experience in food industry"]}, {"title": "Data Science Specialist - Internship\n- job post", "reqs": ["Work closely with engineering directors, product leaders, global sales strategy, and executive leadership to ensure solutions alignment with engineering, product, and go-to-market priorities", "Work with the VP of Operations, Kasey McKenney on Data Solutions initiatives, as well as the CEO and other key leaders to set a data-driven vision and direction for Predictive Analytics Definition and Commercialization at Upper Hand; oversee delivery and execution across the complete portfolio of SQL query management, ETL and ELT design and delivery, Data Analysis and Visualization and Predictive Analytics solutions", "Mine large amounts of data and perform data analysis to extract useful business insights for a wide range of topics including product development and performance, market dynamics, consumer and audience knowledge, internal operations, and external research", "Deliver presentations to senior leadership to explain and illustrate complex analytical findings", "Medical: Upper Hand pays 80% of premium for both the employee and dependents", "Dental and Vision: Upper Hand pays 50% premium for both the employee and dependents", "401K benefits offered through Guideline with premium offerings from Vanguard", "Combined Personal Time Off (PTO): Unlimited days per year", "Modern office with ergonomic Herman-Miller sit-stand desks, chairs and rotating dual monitor stands; Seven flat-screen tv’s with a relaxation room", "Free coffee and tea with 16 flavors; complimentary snacks and other beverages", "Company retreats and outings", "Support for H-1B sponsorship"]}, {"title": "Data Engineering Intern (Remote from MD/VA/DC Only) Fall Recruitment\n- job post", "reqs": ["Extract, manage, and analyze data for reporting and recommendations", "Develop ad hoc and strategic reporting to support Quality initiatives", "Build pilot projects to explore potential data-driven solutions and products", "Communicate findings and recommendations to Quality leadership", "Explore complex and messy data sets and learn to derive and communicate actionable insights", "Learn proficiency in SQL, Snowflake, and automation tools such as Alteryx", "Gain a deeper understanding of the healthcare quality landscape", "Basic SQL programming experience", "Basic proficiency in Microsoft Excel (loading and saving data, simple formulas, etc.)", "Experience with healthcare quality measurement or improvement"]}, {"title": "Business Analyst Intern - Summer 2024\n- job post", "reqs": ["This is a full-time paid internship program spanning ten weeks from June through August 2024.", "Participation in the internship requires that you are located in the continental United States with in-person attendance at your assigned location, in accordance with Capital One’s hybrid working model, for the duration of the program.", "Interns will be evaluated for a full-time position within our rotational programs, with start dates six months to one year following the completion of the internship.", "Currently pursuing a Bachelors or higher with an expectation that the most recent degree will be obtained by August 2025 or earlier.", "Must be continuing in the same course of study of the most recent degree following completion of the internship", "Build your business acumen. Develop strategic problem-solving, quantitative analytics and communication skills. Armed with our best-in-class analytical practices, you’ll partner across teams to create new solutions to major challenges.", "Act as an owner. Be a key decision maker and business owner, driving recommendations, implementing solutions and realizing your impact, all while collaborating with senior leaders across product, tech, sales, operations, design, data science, engineering and finance.", "Reimagine banking. Use information, data, analytics, ingenuity and empathy in innovative ways to deliver technology-driven solutions for our customers.", "Be a change agent. Help people improve their relationship with their money. Transform the communities we serve through financial inclusion—helping to identify the right products for the right customers, assessing risks and optimizing our lending practices.", "Find answers. Develop hypotheses and set up your own analytical frameworks to test for the best solutions. Scope operational feasibility, lead implementation efforts and monitor the success of new initiatives.", "Build and grow your network. Establish an impactful network of peers, leaders and mentors who will help you develop a clear and a vision for your career.", "Prioritize your wellbeing. Create your definition of balance through flexible hours, locations, resources and benefits, while working in an environment that emphasizes creativity, collaboration, innovation and fun.", "You ask why, explore and bring your unique perspective to the table. You’re comfortable with ambiguity and constantly seek out new challenges.", "You have a desire to take action, try new things, and fail fast so you can grow quickly", "You’re organized and can juggle multiple deliverables while utilizing data analysis, technology and human-centered design to create solutions for our customers.", "You thrive in a collaborative and inclusive team environment where diverse perspectives and backgrounds are valued and celebrated.", "You have the desire and ability to connect and empathize with your colleagues and customers.", "You always keep the people around you in the loop and are excited to communicate ideas clearly to help your colleagues understand the “why” and key priorities."]}, {"title": "Technical Data Analyst, Intern\n- job post", "reqs": []}, {"title": "Performance Engineer Intern - Remote US Fall 2023\n- job post", "reqs": ["Collaborate with peers, field teams, and customers to understand and encapsulate the use cases into industry standard benchmarks.", "Work with Performance Stability & Reliability (PSR) senior leads and involve in customer engagement proof-of-concept projects to get direct exposure to the usage patterns we strive to satisfy.", "Drive projects to integrate benchmarking into our continuous integration and test automation frameworks. At Splunk, each and every release of our software is highly scrutinized to meet the demands of our customers.", "Define, code and perform performance/scalability benchmarks on Splunk Enterprise and Cloud products.", "Work with various profiling tools to identify performance and concurrency bottlenecks, and propose and implement optimizations to improve the Splunk product.", "Code and improve sizing and capacity calculators for key Splunk applications on the cloud.", "Actively pursuing a Bachelor's, Master's, or PhD in Computer Science, Software Engineering, Computer Engineering, Electrical Engineering, Mathematics or a related technical field, and a strong record of academic achievement", "At least one semester/quarter remaining to complete after the internship", "Available to work 40 hours a week for 15 weeks from September-December 2023", "Knowledge of software engineering processes, agile framework, tools (e.g.: programming proficiency in a language, preferably Python), methods, test development, algorithms and data structures", "Familiarity with object-oriented programming concepts, large-scale software architecture, networking and distributed systems, and UNIX/Linux environments", "Proficient in one or more of the following programming languages including but not limited to Go, C++, Java, Python, Javascript", "Experience with scripting languages (Python) and compiled languages (C/C+) is a plus.", "Familiarity with tools and technologies like Git, AWS, Linux, Docker and Artifactory is a plus", "Experience in tackling problems of load, scale, and optimizations of complex large-scale deployments is a plus", "Ability to find root cause of performance bottlenecks with profiling tools, pstack, qmlprofiler is a plus", "A fun and collaborative environment with many exciting events from interacting with other interns to conversations with our executive leadership team.", "A constant stream of new things for you to learn. We're always expanding into new areas, bringing in open source projects and contributing back, and exploring new technologies.", "A set of exceptionally talented and dedicated peers, all the way from engineering and QA to product management and customer support.", "Growth and mentorship. We believe in growing engineers through ownership and leadership opportunities. We also believe mentors help both sides of the equation.", "A stable, collaborative and supportive work environment."]}, {"title": "Data Scientist Intern- Fall 2023\n- job post", "reqs": ["Create AI/ML prototypes for use cases requiring identifying entity/objects, determining object association, object disambiguation, anomaly detection, state estimations, etc.", "Develop and maintain data models (both physical and logical)", "Perform extraction, transform, and load (ETL) tasks related to the different modalities and algorithms being applied. This data ETL includes identifying the data’s relevant metadata to ensure consistency, quality, accuracy, integrity, and information assurance and security.", "Conduct anomaly detection using various AI/ML techniques", "Use algorithms to identify complex patterns across multiple modalities", "Increase the efficiency and quality data alignment and fusion", "Enhance and maintain analysis tools, including automation of current processes using AI/ML algorithms", "Direct quantitative data analysis including developing retrieval, processing, fusion, analysis, and visualization of various datasets", "Configure and program prototypes Jupyter notebooks with ML solutions", "Setup and use AWS instances to train and operate AI/ML models", "College student actively seeking a B.S. degree in Aerospace Engineering, Computer Science, Mathematics, Statistics, Physics, Electrical Engineering, Computer Engineering, or related fields", "Must be able to obtain a Top Secret security clearance with a polygraph security clearance", "Practical hands-on experience and the ability to explain statistical analysis, reinforcement learning, transfer learning, natural language processing, and computer vision", "Intermediate software development skills lifecycle including developing and maintaining good production quality code", "Hands-on Software Development Skills (Python-Preferred)", "Experience or educational courses/projects in Machine Learning, and/or Text", "Visualizations/Web Development Skills (e.g. Tableau, D3, etc).", "Hands-on experience with prototype development", "Hands-on experience with automating data cleansing, formatting, staging, and transforming data human", "Hands-on experience applying data analytics", "Hands-on experience with intelligent systems and machine learning", "Experience with interpretability of deep learning models", "Big Data Skills (Azure, Hadoop, Spark, recent deep learning platforms)", "Experience with text mining tools and techniques including in areas of summarization, search (e.g. ELK Stack), entity extraction, training set generation (e.g. Snorkel) and anomaly detection"]}, {"title": "Intern - Computational Biology and Data Science, R&D Undergrad Year Round\n- job post", "reqs": ["Currently attending and enrolled full time in an accredited undergraduate program", "Pursuing a science, engineering, or math major", "Minimum cumulative GPA of 3.0/4.0", "Ability to work up to 25 hours per week during the academic year, and up to 40 hours per week during the summer", "U.S. citizen, asylee, refugee, or lawful permanent resident of the U.S.", "Strong desire to learn, exhibit a strong work ethic, and be able to work both independently and as part of a team.", "Strong background in statistics, machine learning and data science with applications to biological data analysis (e.g., from next-generation sequencing or high-throughput screening methods).", "Strong programming and database skills (e.g., Python, R, Matlab, C++, MySQL)", "Challenging work with amazing impact that contributes to security, peace, and freedom worldwide", "Extraordinary co-workers", "Some of the best tools, equipment, and research facilities in the world", "Career advancement and enrichment opportunities", "Flexible work arrangements for many positions include 9/80 (work 80 hours every two weeks, with every other Friday off) and 4/10 (work 4 ten-hour days each week) compressed workweeks, part-time work, and telecommuting (a mix of onsite work and working from home)", "Generous vacations, strong medical and other benefits, competitive 401k, learning opportunities, relocation assistance and amenities aimed at creating a solid work/life balance*", "These benefits vary by job classification."]}, {"title": "Intern - Sustainable Transportation\n- job post", "reqs": ["Provide research and analytical support for transportation technology research and demonstration projects", "Evaluate technical and economic feasibility and market trends of advanced transportation technologies", "Assist with data collection and analysis of vehicle operations or charging station use", "Use and/or develop computer tools to facilitate research and analysis tasks", "Review technical reports, compile technical information, and develop other written materials as requested", "Pursuit of a bachelor’s degree in an environmental, science, or technical field from an accredited university", "Interest in energy efficiency and clean energy with specific emphasis on transportation technologies such as: alternative fuels, vehicle electrification, autonomous vehicles and vehicle-miles-traveled reduction strategies.", "Strong technical and analytical capabilities", "Proficient in Microsoft Office, specifically with Excel", "Good communication skills (verbal, interpersonal, and written)", "Good organization and time management skills", "Successful when working on self-managed tasks", "Ability to work within a diverse team · In compliance with Executive Order 14042, any successful applicant for this position must be fully vaccinated against COVID-19 or obtain an accommodation from the vaccination requirement based on disability or sincerely held religious belief, on or before the start date.", "Pursuit of a bachelor’s degree in engineering from an accredited university", "Electrical knowledge", "Alternative fuels and transportation electrification familiarity", "Hands-on experience with automotive systems", "Data analytics and visualization experience (e.g., Python, R, MATLAB, Microsoft Power BI, Tableau)", "Geographical information system (GIS) program use and results analysis"]}, {"title": "Global Quantitative Analytics Summer 2024 Analyst\n- job post", "reqs": ["Bank-provided learnings focused on our seven key risk types (Strategic, Credit, Market, Liquidity. Operational, Compliance and Reputational Risk), as well as topics such as Modeling Principles, Software Development Life Cycle, Data Science and Analytics, latest Regulatory developments and more", "Intern Mentorship Program", "Enterprise Executive Speaker Series", "Diversity & Inclusion Employee Networks – LEAD for Women, Black Professional Group, LGBT+ Pride, and more", "Continuous Educational Speakers and Events", "Networking Events", "Developing emerging risk assessments and analyzing credit risk scenarios", "Quantitative modeling, including building forecast models, pricing models, and stress test models", "Conducting research and analysis to provide a micro view of risk management in a particular business line and a macro view of risk management for the bank as a whole", "Assessing market trends and providing quantitative data for internal partners and ultimately, clients", "Applying quantitative knowledge to specific financial challenges and projects specific to your business alignment", "Implementing solutions applying both qualitative and quantitative methods", "Networking with risk executives and key stakeholders to cultivate meaningful relationships across various lines of business", "Intern team assignments are developed based on business need and aligned to skillset and therefore cannot be guaranteed.", "Candidates are required to be pursuing an undergraduate or masters degree from an accredited college or university. Eligible candidates must have a graduation timeframe between December 2024 and June 2025.", "GPA of 3.2 or higher is preferred", "Common areas of study include but are not limited to:", "Candidates should possess a high level of intellectual curiosity, a drive for operational excellence, and a commitment to achieving sustainable results. Additionally, students should hold strong academic and technical skills in Microsoft Office as well as show proficiencies in leadership, teamwork, problem solving & analytical skills, verbal and written communication, and professionalism.", "Candidates should have an understanding of program applications including but not limited to Python, SQL, R, and/or C++.", "Bank of America does not complete third party forms from colleges, universities, or other parties."]}, {"title": "Fall 2023 Intern, Analytics, Fundraising & Engagement (Marketing Analytics)\n- job post", "reqs": ["Helping to build analytical tools, including dashboards for internal partners", "Conducting quantitative analyses", "Collecting, cleaning, and joining datasets from diverse sources Interpreting the results of analyses for non-technical audiences", "Presenting work internally and to stakeholders on other teams", "Engage in special projects and other duties as assigned", "Center principles of equity, inclusion, and belonging in all work, embedding the values in program development, policy application, and organizational practices and processes", "Demonstrate a commitment to the mission of the ACLU", "Demonstrate a commitment to diversity within the office using a personal approach that values all individuals and respects differences in regards to race, ethnicity, age, gender identity and expression, sexual orientation, religion, disability and socio-economic circumstance", "Demonstrate a commitment to work collaboratively and respectfully toward resolving obstacles and/or conflicts", "Familiarity with Python, R, SQL, or similar analytics and programming language", "Excellent problem-solving skills", "Excellent organizational and communication skills", "Experience with data collection and cleaning a plus", "Proficiency in Microsoft Word, PowerPoint, and Excel a plus", "Familiarity with Looker, Tableau, or other data visualization tools a plus", "Familiarity with web analytics tools (e.g., Heap, Google Analytics) a plus", "Commitment to work collaboratively and respectfully toward resolving obstacles and/or conflict", "A commitment to civil liberties, civil rights, and social justice", "Commitment to the mission of the ACLU", "Location: Our Internship Program offers a limited number of remote or hybrid intern positions. Candidates for this internship can select a fully remote or hybrid (part in-person and part remote) arrangement.", "Time Commitment: This internship requires a part-time commitment of 10,15, or 20 hours hours per week.", "Internship Duration: Part-time internships extend for 12 weeks and begin either September 11 or September 25, 2023.", "Stipend: A stipend is available for those students who do not receive course credit and are lawfully authorized to work. Students who receive outside funding are eligible for a partial stipend to bring their total funding up to the level of ACLU's stipend amount for that term, if applicable. Arrangements can be made with educational institutions for work/study or course credit. Below is the stipend breakdown:\n$20/hour for undergraduate students or equivalent experience and $24/hour for graduate and law students or equivalent experience", "$20/hour for undergraduate students or equivalent experience and $24/hour for graduate and law students or equivalent experience", "$20/hour for undergraduate students or equivalent experience and $24/hour for graduate and law students or equivalent experience"]}, {"title": "Environment & Business Data Scientist - Internship\n- job post", "reqs": ["The sky is the limit!", "Designing and implementing databases that adequately address business needs", "Analyzing data for possible inconsistencies that may skew analytical results", "Evaluating and documenting database changes or refinements", "Applying best practices when storing, organizing, cleaning, and mining data", "Developing and implementing policies and procedures for effective data handling and management", "Assessing systems and recommending necessary software, hardware, and storage upgrades", "Ensuring that a company's data management protocols are in line with regulatory standards", "Providing guidance and training for team members", "Streamlining data collection and analysis procedures to ensure fast access to metrics", "Implement and measure and communicate carbon reduction results", "Identify valuable data sources and automate collection processes", "Undertake preprocessing of structured and unstructured data", "Analyze large amounts of information to discover trends and patterns", "Build predictive models and machine-learning algorithms", "Combine models through ensemble modeling", "Present information using data visualization techniques", "Propose solutions and strategies to business challenges", "Collaborate with engineering and product development teams", "Graduate in Master's degree in Computer science, Data Science, Data Analytics, Business Analytics, Statistics or similar field of study", "Academic course in environment science is a plus", "Knowledge of SQL", "Interest or experience as a Data Scientist or Data Analyst", "Interest or experience in data mining", "Knowledge of business intelligence tools (e.g. Tableau, PowerBI) and data framework", "Analytical mind and business acumen", "Strong math skills (e.g. statistics, algebra)", "Passion for developing sustainable solutions to problems is a plus", "Excellent communication and presentation skills", "The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions while performing the duties of this Job:", "While performing the duties of this Job the intern is:", "The noise level in the work environment is usually quiet."]}, {"title": "Marketing Data Science Intern\n- job post", "reqs": ["We have a variety of teams and problems where you can work and learn", "Be part of a dynamic, highly-focused team that is responsible for providing machine-learning insights and products that engage Live Nation’s 170+MM users", "Work with Recommendations, Analytics, Marketing Automation and SEO Team members to create tools to analyze audiences, website content, conversion, search keywords and their relationships", "Higher Education (Masters or PhD) Student", "Coursework and/or professional experience with a high-level programming language like: Java and/or Python", "Machine learning coursework a plus", "Experience with state-of-the-art machine learning tool kits and algorithms", "Interest and the desire to learn", "Effective communication skills and enjoying work as part of a team", "HEALTH: Medical, Vision and Dental benefits for you and your family, including Flexible Spending Accounts (FSA) and Health Savings Accounts (HSAs)", "YOURSELF: Generous paid time off policy including paid holidays, sick time and paid days off for your birthday, Free concert tickets", "WEALTH: 401(k) program with company match, Stock Program", "FAMILY: New parent programs & support including caregiver leave and childcare cash, infertility support", "CAREER: Tuition reimbursement, student loan repayment internal growth and development programs & trainings", "OTHERS: Volunteer time off, crowdfunding network"]}, {"title": "AI Application Intern\n- job post", "reqs": ["Leverage AI to improve user experience, customer support quality and reduce IT support.", "Automate code development and data analysis.", "Any other practical use cases driven by business needs.", "Ph.D. or master students in computer science, electrical engineering, or a related field;", "Self-motivated, practical and creative;", "Has application or research experiences in natural language processing, speech processing, dialog system, or machine learning;", "Demonstrable experience or applications will be a huge plus;"]}, {"title": "Data Science Research Technician/Intern\n- job post", "reqs": ["Computer Vision and Image Processing", "Machine Learning and Natural Language Processing", "3D Modeling and Image Synthesis", "Remote Sensing and use of GIS", "State Estimation, Filtering, and Statistical Analysis", "Data Acquisition, Synthesis, Wrangling, and Processing", "First 15 Days: Intern has familiarized themselves with our operations and working environments. Any knowledge gaps have been identified, and intern is on the path to learning what is needed to fulfill job duties. Intern has demonstrated ability to complete individual tasks with supervision. Supervisor has provided the necessary tools, environments, and resources for job duties and has established and prioritized tasks for the intern.", "First 30 Days: Intern can perform tasks with decreasing supervision and is gaining domain expertise on one subsystem. Supervisor and intern have together identified candidate subsystems for which the intern may be responsible for in the future. Intern successfully completes tasks on time. Supervisor continues to prioritize tasks for intern.", "First 60 Days: Intern has taken ownership of a subsystem and understands the inputs/outputs to their subsystem and its relevance to the overall project. Intern continues to be aware of deadlines and can successfully provide finished work on time. Supervisor has established project goals with sufficient clarity for the intern to start prioritizing tasks themselves.", "First 90 Days: Intern has successfully managed their subsystem while providing aid to others and fulfilling various tasks. Intern has successfully prioritized tasks related to their subsystem. Supervisor and intern have discussed opportunities for the intern owning larger systems in the future.", "The candidate must be able to provide evidence of being either a U.S. citizen or U.S. permanent resident at the time of application to meet contract requirements.", "Intern should have on average 15 to 20+ hours per week availability. (30 to 40+ bi-weekly)", "Job is on-site. After a minimal six-week period, hybrid work may be possible per supervisor discretion.", "Ability to work in teams and juggle multiple, possibly changing, priorities", "Platform agnostic: should be able to work with Microsoft Windows, Linux, or MacOS.", "Proficiency with word processing, spreadsheet, and slide show software (e.g. MS Office)", "Programming proficiency with languages such as Python, MATLAB, C and C++\nIteration, recursion, conditional statements\nBasic data structures and algorithms: sorting, trees, queues, etc\nComplexity estimation\nData types and computer logic\nDevelopment environments and revision control\nNumerical methods and approximation techniques\nImage processing methods", "Iteration, recursion, conditional statements", "Basic data structures and algorithms: sorting, trees, queues, etc", "Complexity estimation", "Data types and computer logic", "Development environments and revision control", "Numerical methods and approximation techniques", "Image processing methods", "Mathematics proficiency with algebra, linear algebra and linear systems, information theory, probability and statics\nSolving linear systems\nBasic matrix algebra\nBase conversion\nCalculations of means, standard deviations, RMS\nRegression analysis and model fitting\nBasic calculus", "Solving linear systems", "Basic matrix algebra", "Base conversion", "Calculations of means, standard deviations, RMS", "Regression analysis and model fitting", "Basic calculus", "Iteration, recursion, conditional statements", "Basic data structures and algorithms: sorting, trees, queues, etc", "Complexity estimation", "Data types and computer logic", "Development environments and revision control", "Numerical methods and approximation techniques", "Image processing methods", "Solving linear systems", "Basic matrix algebra", "Base conversion", "Calculations of means, standard deviations, RMS", "Regression analysis and model fitting", "Basic calculus", "Experience with Deep Learning and Neural Networks such as detectors, classifiers, Generative Adversarial Networks (GANs), Reinforcement Learning, Style Transfer, and related algorithms or architectures.", "Experience in developing AI solutions for any of the following domains: Computer Vision, Medical Image Processing, Geo-spatial Intelligence, Natural Language Processing (NLP) or Signal Processing.", "AI Explainability methods, Adversarial Examples, and evaluation of AI algorithms performance.", "Game development, Virtual Reality, or Augmented Reality", "Intelligence, Surveillance, Reconnaissance (ISR) and Security", "Navigation and Tracking", "Healthcare and Life Sciences", "Opportunities to pursue R&D interests through government grants with full support of our Project Management Office (PMO) for assisting with the application process and document submission", "Benefits: Medical, Dental, Life, Disability, Vision, Retirement and Leave", "Short commute and low cost of living for the Bryan-College Station area", "Close proximity to Texas A&M University and frequent opportunities for collaboration with faculty.", "< 2-hour drive from the Austin and Houston, < 3-hour drive from San Antonio and Dallas metro areas.", "Your work will have an impact and make a difference in the world: Lynntech employees get to work across various disciplines and are engaged in all aspects of technology development from idea generation to commercialization.", "Opportunities to own your projects. On-boarding at Lynntech is designed to provide new hires with opportunities to take on more and more responsibilities in our R&D projects, eventually have the chance to lead them.", "You get the best of both worlds: We offer the infrastructure and stability of an established company as well as the challenge, benefits, and entrepreneurial spirit associated with a small business.", "Your work will be interesting and varied: You will have the opportunity to be creative and work on a myriad of projects across various industries (defense, energy, aerospace and medical). If you can get buy-in for your idea and procure funding to pursue research, you will get to work on it.", "You'll be able to contribute to the organization in a variety of ways: You will get to wear a variety of hats in this role. Some examples include core technology strategy development, proposal writing, research and technology development, product development, program management, business development and mentorship of young researchers.", "Computer Vision, Image Processing, and Numerical Methods", "Machine Learning and Natural Language Processing", "Simulation, 3D Modeling, and Image Synthesis", "Remote Sensing and Geospatial Analytics", "State Estimation, Filtering, and Statistical Analysis", "Data Acquisition, Synthesis, Wrangling, and Processing", "Software Development and Sys Admin", "Research, Proposal Writing, Grantsmanship, and Business Development", "Pre-screening and request for work sample. If an applicant's resume passes pre-screening, Lynntech will send out a candidate packet which contains information about the company and the team. We will also request a work sample which is demonstrative of the applicant's experience relevant to the job posting. If the work sample demonstrates relevant proficiency in the job domain, Lynntech will continue with scheduling a time for an interview.", "1st Interview (Usually Phone/Virtual unless local candidate). [Duration: 1 hr] During this call, both parties will review background information and review eligibility requirements. Company policies, job expectations, work environment, and availability will be discussed. The interview may conclude here if the candidate is no longer interested in pursuing the opportunity or if the candidate does not meet basic eligibility requirements. We will also discuss the different roles in the group and establish the domain specific project needs which we have at that moment and candidate will be asked to rank their experience and comfort level with the various core disciplines. Candidates will be expected to elaborate on their relevant past project experience.", "Candidate Assessment, Part 1: If both parties choose to continue, candidates will be asked to complete and submit Part 1 of the Assessment which was included in their packets. This assessment covers fundamentals in computer literacy, programming, and mathematics. Lynntech will review the submission and before scheduling a second interview. Part 2 of the assessment is only requested if a second interview is scheduled.", "2nd Interview (Usually On-site*) and Part 2 of Assessment. [Duration: 3 to 4 hr] If both parties choose to continue, an in-person interview will be scheduled, and the candidate is responsible for completing Part 2 of the assessment prior to the second interview. The candidate will be notified in advance if an optional domain specific assignment or live coding interview is required. This final step will be comprised of the following:\nPast Project Presentation/Demo: The candidate will give a 10-15 minute presentation/demonstration of a past personal or professional project which relates to one of our core disciplines. Your presentation should resemble more of a story than an academic talk and it can be an example from your past personal or professional experience. If you have physical or virtual demonstrations at hand, or something interactive, you're encouraged to bring them. It's also beneficial if you have pictures/graphics and videos walking us through your development process and showing the final result. Highlight any problems or challenges you faced along the way and how you overcame them. There will be time at the end for Q&A and open discussion. If you're uncertain about what topic to present on, please reference our technical domains for guidance. Duration: 25 to 45 min\nProject Domains and Core Disciplines Discussion: We will discuss what the existing project needs are and how the candidate's skill set can best fit the project needs. We will review the various roles, responsibilities, and how the various core disciplines relate to our projects. Duration: 30 to 40 min\n[Optional] Assessment Review: If reviewers have previously provided a domain specific assignment, candidate answers will be reviewed, and additional questions may be given. Interviewers will assess candidate's ability to reason through challenges and their ability to identify and test their assumptions when approaching problems. Duration: 30 to 60 min\n[Optional] Live Coding Interview: A live open-book set of coding problems. Candidates will be given programming problems which they must solve. Internet search will be available for looking up information and interviewers will be there to answer questions and help if necessary. This will test not only the candidate's ability to program, but also their ability to search for answers and ask for help and collaborate when appropriate. Duration: 30 to 60 min", "Past Project Presentation/Demo: The candidate will give a 10-15 minute presentation/demonstration of a past personal or professional project which relates to one of our core disciplines. Your presentation should resemble more of a story than an academic talk and it can be an example from your past personal or professional experience. If you have physical or virtual demonstrations at hand, or something interactive, you're encouraged to bring them. It's also beneficial if you have pictures/graphics and videos walking us through your development process and showing the final result. Highlight any problems or challenges you faced along the way and how you overcame them. There will be time at the end for Q&A and open discussion. If you're uncertain about what topic to present on, please reference our technical domains for guidance. Duration: 25 to 45 min", "Project Domains and Core Disciplines Discussion: We will discuss what the existing project needs are and how the candidate's skill set can best fit the project needs. We will review the various roles, responsibilities, and how the various core disciplines relate to our projects. Duration: 30 to 40 min", "[Optional] Assessment Review: If reviewers have previously provided a domain specific assignment, candidate answers will be reviewed, and additional questions may be given. Interviewers will assess candidate's ability to reason through challenges and their ability to identify and test their assumptions when approaching problems. Duration: 30 to 60 min", "[Optional] Live Coding Interview: A live open-book set of coding problems. Candidates will be given programming problems which they must solve. Internet search will be available for looking up information and interviewers will be there to answer questions and help if necessary. This will test not only the candidate's ability to program, but also their ability to search for answers and ask for help and collaborate when appropriate. Duration: 30 to 60 min", "Past Project Presentation/Demo: The candidate will give a 10-15 minute presentation/demonstration of a past personal or professional project which relates to one of our core disciplines. Your presentation should resemble more of a story than an academic talk and it can be an example from your past personal or professional experience. If you have physical or virtual demonstrations at hand, or something interactive, you're encouraged to bring them. It's also beneficial if you have pictures/graphics and videos walking us through your development process and showing the final result. Highlight any problems or challenges you faced along the way and how you overcame them. There will be time at the end for Q&A and open discussion. If you're uncertain about what topic to present on, please reference our technical domains for guidance. Duration: 25 to 45 min", "Project Domains and Core Disciplines Discussion: We will discuss what the existing project needs are and how the candidate's skill set can best fit the project needs. We will review the various roles, responsibilities, and how the various core disciplines relate to our projects. Duration: 30 to 40 min", "[Optional] Assessment Review: If reviewers have previously provided a domain specific assignment, candidate answers will be reviewed, and additional questions may be given. Interviewers will assess candidate's ability to reason through challenges and their ability to identify and test their assumptions when approaching problems. Duration: 30 to 60 min", "[Optional] Live Coding Interview: A live open-book set of coding problems. Candidates will be given programming problems which they must solve. Internet search will be available for looking up information and interviewers will be there to answer questions and help if necessary. This will test not only the candidate's ability to program, but also their ability to search for answers and ask for help and collaborate when appropriate. Duration: 30 to 60 min", "For long-distance candidates, this may be a virtual interview. If a job offer is made the candidate will be invited to for an on-site visit before a final response is expected."]}, {"title": "Artificial Intelligence & Machine Learning, Internship\n- job post", "reqs": ["Utilize tools such as OpenAI, ChatGPT and others to develop a process for creating tools to simplify our marketing content creation, market research and other similar use cases", "Utilize tools such as OpenAI to support our operations teams on an ad-hoc basis to support new challenges", "Recently graduated with a degree in a technology-related field", "Experience with the OpenAI API and ChatGPT", "Experience in mobile web development", "Familiarity with natural language processing, machine learning, and other AI techniques", "Familiarity with language models, such as GPT-2, GPT-3, BERT, etc..", "Familiarity with cloud services such as AWS, Azure, or Google Cloud", "Experience with scrum and other agile based methodology of software development", "Experience working with large data sets", "Experience in food industry"]}, {"title": "Data Science Specialist - Internship\n- job post", "reqs": ["Work closely with engineering directors, product leaders, global sales strategy, and executive leadership to ensure solutions alignment with engineering, product, and go-to-market priorities", "Work with the VP of Operations, Kasey McKenney on Data Solutions initiatives, as well as the CEO and other key leaders to set a data-driven vision and direction for Predictive Analytics Definition and Commercialization at Upper Hand; oversee delivery and execution across the complete portfolio of SQL query management, ETL and ELT design and delivery, Data Analysis and Visualization and Predictive Analytics solutions", "Mine large amounts of data and perform data analysis to extract useful business insights for a wide range of topics including product development and performance, market dynamics, consumer and audience knowledge, internal operations, and external research", "Deliver presentations to senior leadership to explain and illustrate complex analytical findings", "Medical: Upper Hand pays 80% of premium for both the employee and dependents", "Dental and Vision: Upper Hand pays 50% premium for both the employee and dependents", "401K benefits offered through Guideline with premium offerings from Vanguard", "Combined Personal Time Off (PTO): Unlimited days per year", "Modern office with ergonomic Herman-Miller sit-stand desks, chairs and rotating dual monitor stands; Seven flat-screen tv’s with a relaxation room", "Free coffee and tea with 16 flavors; complimentary snacks and other beverages", "Company retreats and outings", "Support for H-1B sponsorship"]}, {"title": "Data Engineering Intern (Remote from MD/VA/DC Only) Fall Recruitment\n- job post", "reqs": ["Extract, manage, and analyze data for reporting and recommendations", "Develop ad hoc and strategic reporting to support Quality initiatives", "Build pilot projects to explore potential data-driven solutions and products", "Communicate findings and recommendations to Quality leadership", "Explore complex and messy data sets and learn to derive and communicate actionable insights", "Learn proficiency in SQL, Snowflake, and automation tools such as Alteryx", "Gain a deeper understanding of the healthcare quality landscape", "Basic SQL programming experience", "Basic proficiency in Microsoft Excel (loading and saving data, simple formulas, etc.)", "Experience with healthcare quality measurement or improvement"]}, {"title": "Business Analyst Intern - Summer 2024\n- job post", "reqs": ["This is a full-time paid internship program spanning ten weeks from June through August 2024.", "Participation in the internship requires that you are located in the continental United States with in-person attendance at your assigned location, in accordance with Capital One’s hybrid working model, for the duration of the program.", "Interns will be evaluated for a full-time position within our rotational programs, with start dates six months to one year following the completion of the internship.", "Currently pursuing a Bachelors or higher with an expectation that the most recent degree will be obtained by August 2025 or earlier.", "Must be continuing in the same course of study of the most recent degree following completion of the internship", "Build your business acumen. Develop strategic problem-solving, quantitative analytics and communication skills. Armed with our best-in-class analytical practices, you’ll partner across teams to create new solutions to major challenges.", "Act as an owner. Be a key decision maker and business owner, driving recommendations, implementing solutions and realizing your impact, all while collaborating with senior leaders across product, tech, sales, operations, design, data science, engineering and finance.", "Reimagine banking. Use information, data, analytics, ingenuity and empathy in innovative ways to deliver technology-driven solutions for our customers.", "Be a change agent. Help people improve their relationship with their money. Transform the communities we serve through financial inclusion—helping to identify the right products for the right customers, assessing risks and optimizing our lending practices.", "Find answers. Develop hypotheses and set up your own analytical frameworks to test for the best solutions. Scope operational feasibility, lead implementation efforts and monitor the success of new initiatives.", "Build and grow your network. Establish an impactful network of peers, leaders and mentors who will help you develop a clear and a vision for your career.", "Prioritize your wellbeing. Create your definition of balance through flexible hours, locations, resources and benefits, while working in an environment that emphasizes creativity, collaboration, innovation and fun.", "You ask why, explore and bring your unique perspective to the table. You’re comfortable with ambiguity and constantly seek out new challenges.", "You have a desire to take action, try new things, and fail fast so you can grow quickly", "You’re organized and can juggle multiple deliverables while utilizing data analysis, technology and human-centered design to create solutions for our customers.", "You thrive in a collaborative and inclusive team environment where diverse perspectives and backgrounds are valued and celebrated.", "You have the desire and ability to connect and empathize with your colleagues and customers.", "You always keep the people around you in the loop and are excited to communicate ideas clearly to help your colleagues understand the “why” and key priorities."]}, {"title": "Technical Data Analyst, Intern\n- job post", "reqs": []}, {"title": "Intern - Sustainable Transportation\n- job post", "reqs": ["Provide research and analytical support for transportation technology research and demonstration projects", "Evaluate technical and economic feasibility and market trends of advanced transportation technologies", "Assist with data collection and analysis of vehicle operations or charging station use", "Use and/or develop computer tools to facilitate research and analysis tasks", "Review technical reports, compile technical information, and develop other written materials as requested", "Pursuit of a bachelor’s degree in an environmental, science, or technical field from an accredited university", "Interest in energy efficiency and clean energy with specific emphasis on transportation technologies such as: alternative fuels, vehicle electrification, autonomous vehicles and vehicle-miles-traveled reduction strategies.", "Strong technical and analytical capabilities", "Proficient in Microsoft Office, specifically with Excel", "Good communication skills (verbal, interpersonal, and written)", "Good organization and time management skills", "Successful when working on self-managed tasks", "Ability to work within a diverse team · In compliance with Executive Order 14042, any successful applicant for this position must be fully vaccinated against COVID-19 or obtain an accommodation from the vaccination requirement based on disability or sincerely held religious belief, on or before the start date.", "Pursuit of a bachelor’s degree in engineering from an accredited university", "Electrical knowledge", "Alternative fuels and transportation electrification familiarity", "Hands-on experience with automotive systems", "Data analytics and visualization experience (e.g., Python, R, MATLAB, Microsoft Power BI, Tableau)", "Geographical information system (GIS) program use and results analysis"]}, {"title": "(Onsite) Business Analyst Intern Part Time - Fall 2023\n- job post", "reqs": ["Develop consumer-segmentation models and appropriate product recommendations", "Analyze consumerism around Financial Centers based on web and mobile use versus in person locations", "Analyze call volumes to determine Net Promotor Scores", "Develop a model to assess acquisition predictions and forecasting", "Currently enrolled full-time at an accredited institution studying: Business Analytics, Data Science (or a closely related degree program)", "Must be classified as a Junior, having a strong GPA", "Must have understanding of Data Mining, Machine Learning, Predictive Analytics, Business Intelligence, and/or Data Management", "Must have strong technology and reporting experience", "Must have strong written and verbal communication skills", "Must have creative, analytical, and critical thinking skills", "The anticipated timeframe for this internship is September 11 - November 17, the selected candidate must be able to work in an office setting for the entire timeframe", "Veterans encouraged to apply"]}, {"title": "AI Inference Software Engineer Intern, Autonomy (Fall 2023)\n- job post", "reqs": ["Take ownership of a few areas of the compiler (flexible, based on skills/interests/needs).", "Closely collaborate with AI team to guide them on the design and the development of Neural Networks into production.", "Collaborate with HW team to understand current HW architecture and propose future improvements.", "Develop algorithms to improve performance and reduce compiler overhead.", "Debug functional and performance issues on massively-parallel systems.", "Work on architecture-specific neural network optimization algorithms for high performance computing.", "Prior industry experience as a compiler developer", "Comfortable with C++ and assembly code", "Capable of delivering results with minimal oversight"]}, {"title": "Research Internship (Fall 2023)\n- job post", "reqs": ["Company paid medical, dental and vision insurance for employees and their dependents", "Generous PTO, unlimited sick days and remote working options", "Paid parental leave and family forming benefits", "Company equity (RSUs)", "Reimbursements for mental health and wellness apps", "Perform public-facing research to advance the state of the art and solve specific problems at scale in one or more of the following areas: NLP, HCI, Data Science, Machine Learning/Deep Learning/Large Language Models, Computer Vision, Complex Networks, Knowledge Graphs, Multimodality.", "Work closely with a diverse, interdisciplinary team on a specific project to be completed during the internship.", "Excel in placing a human-centered focus on the work (context, end-user impact, etc), finding solutions that work in practice and have significant impact.", "Must be enrolled in a Ph.D. program in Computer Science, Electrical Engineering or a related field.", "Ideal candidates will have had prior internship experience.", "Outstanding publication record in the candidate’s field of study (AAAI, ACL, CHI, CVPR, ICCV, ICML, NeurIPS, RecSys, etc.).", "Demonstrated ability to work independently, set up experiments and demonstrate progress through principled use of metrics."]}, {"title": "Data Analyst/Engineer, Supply Chain Optimization Internship (Fall 2023)\n- job post", "reqs": ["Multiple Locations Possible", "Create and/ or enhance action-driven dashboards (e.g., using Tableau).", "Support ad hoc data, SQL query, analysis, and debugging requests.", "Create and maintain an optimal database schema and data pipeline architecture.", "Create ETL pipelines in Airflow for analytics team members that assist them in building and optimizing their reports.", "Communicate with stakeholders, gather business requirements, and brainstorm KPIs.", "Develop/ maintain internal documentation.", "Currently pursuing a bachelor’s or master’s degree in a relevant program including, but not limited to: Data Analytics, Data Science, Information Systems, Information Technology, Computer Science, or equivalent.", "Proficiency in SQL, and comfort with a scripting language (e.g., Python) is a plus.", "Proficiency with a data visualization tool (e.g., Tableau).", "A good understanding of relational databases and database engineering concepts.", "Familiarity with data pipelines and a Workflow Management Tool (e.g., Airflow) is desirable.", "Excellent written and verbal communication across technical and non-technical stakeholders.", "Eagerness to collaborate cross-functionally with other business and engineering teams, while able to work independently.", "Organized, detail-oriented, execution-focused, relentless and willing to find cracks in the system to expose problems."]}, {"title": "Data Analytics Intern: Data Science or Compu\n- job post", "reqs": ["Write reproducible scripts and workflows to collect, clean, and analyze data to answer key public policy questions.", "Assist with managing large databases, as well as analyzing, filtering, and processing data.", "Assist with primary data collection processes by developing and utilizing innovative programming tools.", "Provide support to visualize data, write descriptions and summaries of projects, and create presentations of results.", "Assist in automating graphs and dashboards for print and web.", "Proactively provide ideas and critical feedback on data collection methodologies.", "Bachelor’s or master’s degree (completed or currently pursuing) in Computer Science, Data Science, Statistics, or related field.", "Superior coding skills and proficiency in statistical programming languages (R or Python), and data analysis including, but not limited to, data mining, descriptive statistics, and data visualization.", "Experience with automated scraping of data from websites.", "Experience with advanced computational social sciences tools such as machine learning, text-as-data, and natural language processing.", "The ability to learn new approaches and techniques as the need arises.", "Prior experience/proven ability managing large databases.", "Ability to communicate clearly and efficiently and ability to give and receive feedback.", "Highly dependable with the ability to work in a team-oriented environment.", "Excellent written and oral communication skills, excellent problem-solving skills, and attention to detail.", "Understanding of rule of law and governance issues in global contexts.", "Commitment to the WJP’s mission and principles (www.worldjusticeproject.org).", "Cover letter", "Resume", "Writing sample (5 pages max)", "Contact information for 3 professional references"]}, {"title": "DATA SCIENTIST INTERN\n- job post", "reqs": ["You will work alongside our consultants and data scientists to build models and visualizations for our clients", "Build data visualizations to communicate our models outputs to external clients", "Execute batch jobs on our custom-built computing cluster", "Knowledge of Python modeling libraries, Flask, HTML/PHP, GITLAB", "Knowledge of fundamental statistics", "An interest in applying abstract mathematical concepts to noisy real-world data", "Currently enrolled in a top university", "Must be authorized to work in the US", "NY/DC (Possibility of remote work on the East Coast)"]}, {"title": "Intern - Computational Materials and Data Science R&D Graduate Year Round\n- job post", "reqs": ["Work directly with other students, postdocs, and research scientists to model the behavior of materials in a variety of environments (mechanical, corrosive, radiation, etc.)", "Write scripts, run simulation codes, and perform data analysis", "Implement machine learning algorithms to analyze image data, atomistic configurations, or microstructural evolution", "Earned bachelor's degree", "Currently attending and enrolled full time in an accredited science, engineering, or math graduate program", "Minimum cumulative GPA of 3.0/4.0", "Ability to work up to 30 hours per week during the academic year, and up to 40 hours per week during the summer", "U.S. citizens, legal permanent residents, asylees or refugees in the U.S.", "Be enrolled in graduate level coursework in computer science, physics, chemistry, materials science or engineering and must be interested in developing modeling, simulation, and data science skills.", "Experience writing code with Python, pytorch, Matlab, Mathematica, C++, or similar", "Familiarity or interest in artificial intelligence and data science", "Students must have the desire to be part of a high-performing research team.", "Students must demonstrate increasing levels of independence and responsibility and must show a commitment to operate in and contribute to a safe operating environment.", "Students will present the results of their work at group meetings or summer symposia, so good written and oral communication skills are important.", "Ability to use Microsoft Office Suite software is needed.", "Basic work skills such as reliability, critical thinking, and organization are expected.", "Challenging work with amazing impact that contributes to security, peace, and freedom worldwide", "Extraordinary co-workers", "Some of the best tools, equipment, and research facilities in the world", "Career advancement and enrichment opportunities", "Flexible work arrangements for many positions include 9/80 (work 80 hours every two weeks, with every other Friday off) and 4/10 (work 4 ten-hour days each week) compressed workweeks, part-time work, and telecommuting (a mix of onsite work and working from home)", "Generous vacations, strong medical and other benefits, competitive 401k, learning opportunities, relocation assistance and amenities aimed at creating a solid work/life balance*", "These benefits vary by job classification."]}, {"title": "Artificial Intelligence (AI) Programmer, Internship\n- job post", "reqs": ["World Wide Land Transfer (WWLT) is seeking an enthusiastic Artificial Intelligence (AI) Programmer, for a summer internship or project-based role, who is eager to gain practical experience and contribute to real-world AI applications. The selected candidate will work closely with our leadership team and will assist in designing, developing, and maintaining several new AI based tools. Main responsibilities include the implementation of OpenAI, ChatGPT, Zapier, Google Sheets, and other related tools to help speed up our processes and create successful and ROI-driven tools to support the business and our clients. This position is in Trevose, PA and can be on site, hybrid, or remote.", "Develop and implement AI models with a focus on OpenAI and ChatGPT4 technology.", "Assist in programming and training our AI chatbot to improve customer service efficiency.", "Debug and problem-solve AI-related issues.", "Collaborate with cross-functional teams to integrate AI capabilities into our business processes.", "Continually research and adapt to emerging AI trends and technologies.", "Utilize the above-referenced tools to support our operations teams on an ad-hoc basis as new challenges arise.", "Currently enrolled in or recently graduated from a Computer Science or related technology degree program with a focus on Artificial Intelligence.", "Experience with AI technologies, specifically OpenAI’s GPT-4 or similar language models.", "Familiarity with natural language processing, machine learning, and other AI techniques.", "Familiarity with cloud services such as AWS or Google Cloud.", "Experience with agile based methodology of software development.", "Experience working with large data sets, preferred.", "Experience in the title / real estate industry, preferred.", "Experience using APIs and integrating multiple systems, preferred.", "Experience in mobile web development, preferred.", "Understanding of the utilization of web hook technology, preferred.", "Competitive compensation and benefits package.", "Remote or hybrid or in-office"]}, {"title": "Machine Learning (NLP) Internship\n- job post", "reqs": ["Design and execute Natural Language Processing experiments to help advance Vee's strategy", "Research and run topic analysis on targeted content", "Scrape targeted content from social media and open Web sources", "Collaborate with Data Engineering, People Science, business partners, and Chief Technology Officer to create robust NLP pipelines using AWS Comprehend", "Communicate results and ideas to key stakeholders at Vee", "Masters degree in Computer Science, Applied Statistics, Applied math, Data Science, or a related field", "Previous experience running NLP projects, ideally in a corporate or startup context", "Practical experience with multiple statistical languages (SAS, R, Pandas), data processing, database programming, and data analytics", "Solid background in data mining and statistical analysis", "Experience with programming languages such as Python and R", "Knowledge of data visualization tools (e.g. Tableau)", "Strong collaboration skills - you partner well with others to solve problems and actively incorporate input from various sources", "Excellent oral and written communication skills", "Working with key stakeholders to drive business results", "Love what you do, love to be busy, and love to produce by being organized and methodical", "Work with a sense of urgency and have a strong drive for results", "Have the resilience and agility to adapt quickly in a fast-paced environment", "Work independently as well as collaboratively to stretch thinking into creative solutions", "Have strong verbal and written communication skills", "Are excited about and suited for a startup, where you'll be wearing a few hats", "Are smart and fun with an empathetic nature, which will add to our culture"]}, {"title": "Data Analyst Intern\n- job post", "reqs": ["Analyzing and interpreting Pricing and Market data collected from various sources from a business perspective.", "Performing statistical analysis on the data to identify patterns and trends.", "Creating visualizations to communicate insights from the data effectively.", "Working with the team to identify opportunities for improving data collection and analysis processes.", "Documenting analysis methods and results.", "Presenting findings to team members and stakeholders.", "Must be currently a student enrolled in a degree-seeking program and in the process of obtaining a bachelor's or master's degree. (Required)", "Business analytics, finance, economics, engineering-based degree/master preferred.", "Experience with statistical analysis software (e.g., Python, Excel). (Required)", "Strong analytical and problem-solving skills.", "Excellent written and verbal communication skills.", "Ability to work independently and in a team environment.", "Familiarity with pricing strategies and market analysis techniques."]}, {"title": "S&OP Internship\n- job post", "reqs": ["Support the team in providing timely, accurate, and insightful reporting and analysis related to supply, demand and inventory", "Assist with PowerPoint slides for various meetings", "Provide support in reporting projects, such as patching forecast, orders, production and inventory", "Assist with IBP related meetings (S&OP, Integrated Reconciliation and MBR meetings)", "Participate in Corporate Project Darwin related Inventory reduction initiatives by analysis, reporting and sometimes as project lead", "Report building in Power BI via various data sources", "Improve Inventory forecasting process including detailed analysis on anatomy of Inventory by region by product family", "Intern rotates between activities and assignments for the business", "Assist in maintaining HPP product hierarchy, ensure material master data accuracy.", "Full time college student at the Junior, Senior or Master level by the end of Spring 2023", "Must be currently enrolled at an accredited university seeking a Bachelor’s or Master’s degree in Supply Chain, Data Analytics/Data Science and/or Operations", "Must have 3.0 or higher GPA", "Must have courses or experiences that demonstrates and understanding of Supply Chain and/or Data Analytics", "Independent self-starter with high level of confidence and energy and a critical", "Strong analytical and conceptual thinking skills", "Excellent computer skills; especially proficient in Excel and PowerPoint", "Knowledge of building dashboards in Power BI is a plus"]}, {"title": "Software Engineer Intern for Workstations Data Science Team\n- job post", "reqs": ["Should have knowledge and/or hands-on software development project experience in the following:\nLinux OS, Ubuntu, Read Hat, Windows, and/or others\nC++, Python, and/or Java\nArchitectural solutions for software systems\nCloud Native Architecture and Distributed Architecture fundamentals", "Linux OS, Ubuntu, Read Hat, Windows, and/or others", "C++, Python, and/or Java", "Architectural solutions for software systems", "Cloud Native Architecture and Distributed Architecture fundamentals", "Would be a plus to have the following hands-on experience:\nWS, Azure, and/or Google Cloud Platform (GCP)\nMicroservices", "WS, Azure, and/or Google Cloud Platform (GCP)", "Microservices", "Linux OS, Ubuntu, Read Hat, Windows, and/or others", "C++, Python, and/or Java", "Architectural solutions for software systems", "Cloud Native Architecture and Distributed Architecture fundamentals", "WS, Azure, and/or Google Cloud Platform (GCP)", "Microservices"]}, {"title": "Intern - Data Scientist\n- job post", "reqs": ["Collecting, cleaning, and preparing data for analysis.", "Building, training, and deploying predictive models using statistical, machine and deep learning techniques", "Creating and modifying python scripts for data analysis and automation", "Ensuring the accuracy and validity of data analysis results and models developed", "Development of automation scripts for use in GKN Automotive's Engineering Virtual Toolkit", "Perform end of term presentation on either general function or project.", "Flexible work hours", "College student pursing a Master’s degree in a relevant field (Data Science, CS, Mathematics, ME, etc.) with 3+ months previous work experience in data science/IT.", "Self-Starter", "Strong project and time management skills", "Strong computer application software knowledge and skills (specifically: Python)", "Effective written and verbal communication skills (ability to explain technical programming and ML concepts in common language)", "Must be fluent in English", "Must be able to work and travel independently"]}, {"title": "Data Science Intern\n- job post", "reqs": ["Natural Language Processing", "Computer Vision", "Data exploration, visualization and analysis", "AWS Cloud"]}, {"title": "Intern - Sustainable Transportation\n- job post", "reqs": ["Provide research and analytical support for transportation technology research and demonstration projects", "Evaluate technical and economic feasibility and market trends of advanced transportation technologies", "Assist with data collection and analysis of vehicle operations or charging station use", "Use and/or develop computer tools to facilitate research and analysis tasks", "Review technical reports, compile technical information, and develop other written materials as requested", "Pursuit of a bachelor’s degree in an environmental, science, or technical field from an accredited university", "Interest in energy efficiency and clean energy with specific emphasis on transportation technologies such as: alternative fuels, vehicle electrification, autonomous vehicles and vehicle-miles-traveled reduction strategies.", "Strong technical and analytical capabilities", "Proficient in Microsoft Office, specifically with Excel", "Good communication skills (verbal, interpersonal, and written)", "Good organization and time management skills", "Successful when working on self-managed tasks", "Ability to work within a diverse team · In compliance with Executive Order 14042, any successful applicant for this position must be fully vaccinated against COVID-19 or obtain an accommodation from the vaccination requirement based on disability or sincerely held religious belief, on or before the start date.", "Pursuit of a bachelor’s degree in engineering from an accredited university", "Electrical knowledge", "Alternative fuels and transportation electrification familiarity", "Hands-on experience with automotive systems", "Data analytics and visualization experience (e.g., Python, R, MATLAB, Microsoft Power BI, Tableau)", "Geographical information system (GIS) program use and results analysis"]}, {"title": "(Onsite) Business Analyst Intern Part Time - Fall 2023\n- job post", "reqs": ["Develop consumer-segmentation models and appropriate product recommendations", "Analyze consumerism around Financial Centers based on web and mobile use versus in person locations", "Analyze call volumes to determine Net Promotor Scores", "Develop a model to assess acquisition predictions and forecasting", "Currently enrolled full-time at an accredited institution studying: Business Analytics, Data Science (or a closely related degree program)", "Must be classified as a Junior, having a strong GPA", "Must have understanding of Data Mining, Machine Learning, Predictive Analytics, Business Intelligence, and/or Data Management", "Must have strong technology and reporting experience", "Must have strong written and verbal communication skills", "Must have creative, analytical, and critical thinking skills", "The anticipated timeframe for this internship is September 11 - November 17, the selected candidate must be able to work in an office setting for the entire timeframe", "Veterans encouraged to apply"]}, {"title": "AI Inference Software Engineer Intern, Autonomy (Fall 2023)\n- job post", "reqs": ["Take ownership of a few areas of the compiler (flexible, based on skills/interests/needs).", "Closely collaborate with AI team to guide them on the design and the development of Neural Networks into production.", "Collaborate with HW team to understand current HW architecture and propose future improvements.", "Develop algorithms to improve performance and reduce compiler overhead.", "Debug functional and performance issues on massively-parallel systems.", "Work on architecture-specific neural network optimization algorithms for high performance computing.", "Prior industry experience as a compiler developer", "Comfortable with C++ and assembly code", "Capable of delivering results with minimal oversight"]}, {"title": "Research Internship (Fall 2023)\n- job post", "reqs": ["Company paid medical, dental and vision insurance for employees and their dependents", "Generous PTO, unlimited sick days and remote working options", "Paid parental leave and family forming benefits", "Company equity (RSUs)", "Reimbursements for mental health and wellness apps", "Perform public-facing research to advance the state of the art and solve specific problems at scale in one or more of the following areas: NLP, HCI, Data Science, Machine Learning/Deep Learning/Large Language Models, Computer Vision, Complex Networks, Knowledge Graphs, Multimodality.", "Work closely with a diverse, interdisciplinary team on a specific project to be completed during the internship.", "Excel in placing a human-centered focus on the work (context, end-user impact, etc), finding solutions that work in practice and have significant impact.", "Must be enrolled in a Ph.D. program in Computer Science, Electrical Engineering or a related field.", "Ideal candidates will have had prior internship experience.", "Outstanding publication record in the candidate’s field of study (AAAI, ACL, CHI, CVPR, ICCV, ICML, NeurIPS, RecSys, etc.).", "Demonstrated ability to work independently, set up experiments and demonstrate progress through principled use of metrics."]}, {"title": "Data Analyst/Engineer, Supply Chain Optimization Internship (Fall 2023)\n- job post", "reqs": ["Multiple Locations Possible", "Create and/ or enhance action-driven dashboards (e.g., using Tableau).", "Support ad hoc data, SQL query, analysis, and debugging requests.", "Create and maintain an optimal database schema and data pipeline architecture.", "Create ETL pipelines in Airflow for analytics team members that assist them in building and optimizing their reports.", "Communicate with stakeholders, gather business requirements, and brainstorm KPIs.", "Develop/ maintain internal documentation.", "Currently pursuing a bachelor’s or master’s degree in a relevant program including, but not limited to: Data Analytics, Data Science, Information Systems, Information Technology, Computer Science, or equivalent.", "Proficiency in SQL, and comfort with a scripting language (e.g., Python) is a plus.", "Proficiency with a data visualization tool (e.g., Tableau).", "A good understanding of relational databases and database engineering concepts.", "Familiarity with data pipelines and a Workflow Management Tool (e.g., Airflow) is desirable.", "Excellent written and verbal communication across technical and non-technical stakeholders.", "Eagerness to collaborate cross-functionally with other business and engineering teams, while able to work independently.", "Organized, detail-oriented, execution-focused, relentless and willing to find cracks in the system to expose problems."]}, {"title": "Data Analytics Intern: Data Science or Compu\n- job post", "reqs": ["Write reproducible scripts and workflows to collect, clean, and analyze data to answer key public policy questions.", "Assist with managing large databases, as well as analyzing, filtering, and processing data.", "Assist with primary data collection processes by developing and utilizing innovative programming tools.", "Provide support to visualize data, write descriptions and summaries of projects, and create presentations of results.", "Assist in automating graphs and dashboards for print and web.", "Proactively provide ideas and critical feedback on data collection methodologies.", "Bachelor’s or master’s degree (completed or currently pursuing) in Computer Science, Data Science, Statistics, or related field.", "Superior coding skills and proficiency in statistical programming languages (R or Python), and data analysis including, but not limited to, data mining, descriptive statistics, and data visualization.", "Experience with automated scraping of data from websites.", "Experience with advanced computational social sciences tools such as machine learning, text-as-data, and natural language processing.", "The ability to learn new approaches and techniques as the need arises.", "Prior experience/proven ability managing large databases.", "Ability to communicate clearly and efficiently and ability to give and receive feedback.", "Highly dependable with the ability to work in a team-oriented environment.", "Excellent written and oral communication skills, excellent problem-solving skills, and attention to detail.", "Understanding of rule of law and governance issues in global contexts.", "Commitment to the WJP’s mission and principles (www.worldjusticeproject.org).", "Cover letter", "Resume", "Writing sample (5 pages max)", "Contact information for 3 professional references"]}, {"title": "Data Analyst Intern\n- job post", "reqs": ["Analyzing and interpreting Pricing and Market data collected from various sources from a business perspective.", "Performing statistical analysis on the data to identify patterns and trends.", "Creating visualizations to communicate insights from the data effectively.", "Working with the team to identify opportunities for improving data collection and analysis processes.", "Documenting analysis methods and results.", "Presenting findings to team members and stakeholders.", "Must be currently a student enrolled in a degree-seeking program and in the process of obtaining a bachelor's or master's degree. (Required)", "Business analytics, finance, economics, engineering-based degree/master preferred.", "Experience with statistical analysis software (e.g., Python, Excel). (Required)", "Strong analytical and problem-solving skills.", "Excellent written and verbal communication skills.", "Ability to work independently and in a team environment.", "Familiarity with pricing strategies and market analysis techniques."]}, {"title": "Intern - Data Scientist\n- job post", "reqs": ["Collecting, cleaning, and preparing data for analysis.", "Building, training, and deploying predictive models using statistical, machine and deep learning techniques", "Creating and modifying python scripts for data analysis and automation", "Ensuring the accuracy and validity of data analysis results and models developed", "Development of automation scripts for use in GKN Automotive's Engineering Virtual Toolkit", "Perform end of term presentation on either general function or project.", "Flexible work hours", "College student pursing a Master’s degree in a relevant field (Data Science, CS, Mathematics, ME, etc.) with 3+ months previous work experience in data science/IT.", "Self-Starter", "Strong project and time management skills", "Strong computer application software knowledge and skills (specifically: Python)", "Effective written and verbal communication skills (ability to explain technical programming and ML concepts in common language)", "Must be fluent in English", "Must be able to work and travel independently"]}, {"title": "Data Analytics and Reporting Intern\n- job post", "reqs": ["Supporting the core analytics team in development of Robotic Process Automation, Data Engineering, and Business intelligence solutions", "Develop and maintain dashboards and reports to monitor key performance indicators", "Process mapping and documentation", "Consolidation of data sources and reports for efficiency", "Lead a project leveraging machine learning/advanced analytics/artificial intelligence to drive additional business insight", "Completed or in pursuit of Undergraduate degree in Business Administration, Computer Science, Industrial Engineering, or Supply Chain Management", "Strong analytical and problem-solving skills", "Proficiency in SQL, Python, or R", "Experience with data visualization tools such as Tableau, Power BI, or Excel", "Competency with Microsoft Office Suite", "Fluent in English"]}, {"title": "AI, Analytics, and Automation Intern\n- job post", "reqs": ["Assist in the development and implementation of machine learning models for data analysis.", "Work with the team to collect and analyze data from various sources.", "Contribute to the development and maintenance of chatbots using platforms such as Dialogflow, Rasa, or Microsoft Bot Framework.", "Help develop digital assistants using platforms such as Oracle Digital Assist.", "Assist in the testing and debugging of chatbots, digital assistants, scripts, and workflows.", "Contribute to the development and maintenance of conversational AI models using frameworks such as Hugging Face or OpenAI.", "Help integrate ChatGPT models into chatbots, digital assistants, and other conversational AI systems.", "Contribute to the development of best practices for data analysis, automation, chatbot development, digital assistants, and conversational AI.", "Attend team meetings and provide input on project progress and ideas for improvement.", "Support the creation and maintenance of data visualizations and dashboards using tools such as Tableau, Power BI, and Excel.", "Support the automation of manual tasks and processes using tools like UiPath and Automation Anywhere.", "Currently enrolled in a Bachelor’s or Master’s degree program in Computer Science, Mathematics, Statistics, Data Science, or a related field.", "Strong understanding of programming languages such as Python, R, and SQL.", "Familiarity with machine learning concepts and tools such as TensorFlow and PyTorch.", "Experience with chatbot development using platforms such as Dialogflow, Rasa, or Microsoft Bot Framework is a plus.", "Experience with digital assistant development using platforms such as Oracle Digital Assist, Amazon Alexa, Google Assistant, or Apple Siri is a plus.", "Experience with conversational AI models using frameworks such as Hugging Face or OpenAI is a plus.", "Experience with ChatGPT models and their integration into chatbots, digital assistants, and conversational AI systems is a plus.", "Experience with automation tools such as UiPath and Automation Anywhere is a plus.", "Excellent analytical and problem-solving skills.", "Strong attention to detail and ability to work independently.", "Strong communication skills and ability to work in a team environment."]}, {"title": "2024 Summer Corporate Intern – Digital and Analytics\n- job post", "reqs": ["Optional medical coverage", "Optional voluntary benefits", "Paid holidays", "Comprehensive internship orientation", "Tours of state-of-the-art manufacturing and research facilities", "Product Demonstration", "Various social events", "Networking with leadership", "Business skill building", "Career discussion with leaders and experts", "Must be enrolled full time at a 4-year accredited university/college in a Computer Science, Computer Engineering, Business Administration, Data Science/Analytics, Data Visualization, Marketing Analytics, Math, Stats, Software Engineering, Information Systems, Systems Engineering or related degree", "Expected graduation date of August 2024 and beyond", "Minimum cumulative GPA requirement 3.0/ 4.0 (no rounding)", "Must be able/willing to relocate to internship location", "Demonstrated leadership experience", "Previous technical internship, co-op, or research/relevant experience", "Participation in school clubs or student organizations", "Demonstrated experience with several of the following: Python, Java, SQL, Snowflake, AWS/Azure, Tableau, PowerBI, Google Analytics, Machine Learning, Deep Learning, R, Salesforce, React, JavaScript, Node.js, HTML, UI Design, UX Research, writing API’s for deployment, Postman, Scala, Akka, BigQuery", "Relevant coursework and/or projects", "Strong analytical and problem-solving skills", "Ability to demonstrate strong communication skills, initiative, and intellectual curiosity", "Able to work independently or as a collaborative team member", "Ability to learn and comply with company policies and procedures", "Comfortable working in a dynamic environment where digital is still evolving as a core offering", "Passion for technology and an eagerness to contribute to a team-orientated environment", "Ability to clearly communicate technical ideas, regardless of the technical capacity of the audience"]}, {"title": "Computer Vision Intern - Deep Learning\n- job post", "reqs": ["Experience in a Deep Learning framework such as Tensorflow or Pytorch", "Experience in applying Deep Learning on visual and/or geometric data", "Proficient in Python"]}, {"title": "Summer 2024 Investment Analyst Intern\n- job post", "reqs": ["Conduct fundamental analysis on companies and industries, building full 3-statement models for investment targets", "Perform statistical analysis of large alternative datasets to support investment conclusions", "Provide investment recommendations by drafting memos and comprehensive reports, combining both qualitative and quantitative insights", "Build predictive models on top of market/alternative data and backtest results as systematic strategies", "Pursuing a BS/MS degree with relevant coursework and experience", "Previously demonstrated proficiency with Python and Java/C++", "Proficiency in Excel and modeling", "Excellent written and verbal communication skills"]}, {"title": "AI Engineering Intern\n- job post", "reqs": ["Strong coding skills. Though the requirement is not language specific, proficiency in one or more of the following is required: Python, C/C++/C#, Java, React, R, database design and development (SQL, MongoDB), AWS.", "A sharp understanding of Data Analytics and Structures. This includes a demonstrated understanding of how to retrieve data from databases and other systems and tools using queries, exporting capabilities, and other effective methods.", "A cautious curiosity about generative AI and the role it will play in data security.", "Knowledge of MS Office applications.", "Ability to conduct research by hypothesis, using online search tools, data analysis, and documenting the research process for presentation of results.", "Be a self-motivated learner and can learn new software and tech through both formal training and self-led instruction.", "Work collaboratively with product and platform colleagues to understand key research questions around generative AI.", "Create an original Proof of Concept incorporating ideas presented, discussed, and delegated.", "Identify risks in the whole life cycle of model development and design novel approaches to avoid these risks.", "Conduct analyses, visualize data, and deliver data science findings to stakeholders which include engineers, product developers, solutions engineers, and others.", "Be part of an AI think-tank that will support internal workflows to meet our product and market needs.", "Gain powerful, practical experience at the intersection of generative AI use and software development."]}, {"title": "Intern\n- job post", "reqs": ["Work with functional representatives to develop use cases, requirements, and business logic for digital applications", "Develop digital applications to support business needs, including efficiency and automation", "Develop solutions to extract, transform, and load unstructured data for further analysis using python, R, and other languages", "Develop interactive dashboards using Power BI and Tableau", "Assist in generating analytical results", "Participate in key technical meetings and workshops", "Candidates shall be majoring in a highly analytical field of study such as: engineering, computer science, data science, or related field", "Experience using common coding languages to develop applications", "Ability to work in a dynamic team environment and perform assigned tasks with minimal guidance", "High proficiency with Microsoft Office Programs, especially Excel", "Superior interpersonal and written/oral communications", "Familiarity with basic data science techniques such as machine learning", "Familiarity with quantitative analysis techniques including statistical analysis", "Familiarity with the software development lifecycle phases of requirements, design, build, and test"]}, {"title": "Market Intelligence Analyst Intern\n- job post", "reqs": ["Current MBA student with BS in science or engineering preferred", "Undergraduate junior/senior student preferably pursuing in one of the following\nDual bachelor degrees of engineering and business\nMajor/minor in engineering/business\nBusiness and technology management\nEngineering with entrepreneurship\nEngineering with business related field such as economics, quantitative analytics, statistics or data science.", "Dual bachelor degrees of engineering and business", "Major/minor in engineering/business", "Business and technology management", "Engineering with entrepreneurship", "Engineering with business related field such as economics, quantitative analytics, statistics or data science.", "Previous experience in market research of technology trends preferred", "Strong analytical and communication skills", "Problem solver, fast learner and highly motivated", "Being able to work independently - Remote work with flexibility", "Dual bachelor degrees of engineering and business", "Major/minor in engineering/business", "Business and technology management", "Engineering with entrepreneurship", "Engineering with business related field such as economics, quantitative analytics, statistics or data science."]}, {"title": "Product & Test Engineering Intern\n- job post", "reqs": ["Using commercial and internally-developed tools to perform statistical data analyses in support of yield improvement, problem resolution, and other activities.", "Developing or enhancing custom tools (software or scripts) used within the group or within Skyworks Solutions. This may include working with potential users to gather and document requirements, and investigating or testing potential solutions to determine options and recommend an optimal approach.", "Providing training and support to product engineers, test engineers, yield engineers, and other engineers across Skyworks Solutions who use the tools supported by the Product/Test Engineering Tools team.", "Creating or updating documentation on tools and processes.", "The candidate must be available to work full-time in the Skyworks Irvine office for the Summer 2024 term.", "The candidate must be working on a Bachelors or Masters Degree in Data Science, Electrical Engineering, Computer Engineering, or a similar degree for the duration of the internship.", "The candidate should have strong software skills, good data analytics skills, and electronics knowledge."]}, {"title": "AI Research Intern\n- job post", "reqs": ["Work closely with the research team to develop and implement natural language processing models.", "Execute experiments and analyze data to evaluate model performance and identify areas for improvement.", "Perform error analysis, synthesize observations, and draw meaningful conclusions to improve model accuracy and efficiency.", "Present research results and findings to the research team and other stakeholders in a clear and concise manner.", "Participate in research discussions and contribute ideas to improve research projects.", "Document research findings and share knowledge with other team members.", "Continuously learn and stay up to date with the latest advancements in machine learning research and techniques.", "Strong Python and programming skills and related deep learning tool chains including Python, Pandas, etc.", "Significant experience with NLP techniques and models such as word embeddings, neural networks, and transformer-based models.", "Excellent problem-solving skills and Experience performing research, running experiments, and reporting on results.", "Ability to work well in a team and collaborate with researchers and engineers with diverse backgrounds and skillsets.", "Graduate student in CS/Data Science/NLP/ML/AI (or undergrad with significant work experience)"]}, {"title": "Intern - Data Scientist\n- job post", "reqs": ["Support data scientists, researchers and software developers on projects bridging the gap between research and analytics.", "Assist in the development of streamlined protocols to systematize workflow.", "Aid to develop schema, business rules and configuration testing processes.", "Support efforts with systems management to capture information that can be used for quantitative analysis.", "Support the development of standardized protocols to manipulate information captured in a fixed format to usable data, using non-traditional data sources like scraping data from social media, mining data from natural language texts, as well as vectorizing images to create analytical dataset to inform policy decisions.", "Knowledge using data science toolkits, such as R, MatLab, Python, and neural network frameworks such as Torch, Keras, Café, and Tensorfow.", "Knowledge using data visualization tools, such as D3.js, GGplot, PlotLy, Moicrosoft Power BI, and Tableau.", "Requirements gathering experience in developing schema, business rules, and test protocols.", "Knowledge conducting tests for configuring and developing integrated data systems.", "Experience working with query languages such as SQL.", "Knowledge of statistics and research methods and experience developing regression models.", "Experience developing technical documentation for datasets, code, and data products.", "Excellent verbal and written communication skills."]}, {"title": "Data Science Intern - Digital and Technology Partners\n- job post", "reqs": ["Learn and build machine learning models using Spark MLlib, Spark NLP, Pytorch, and TensorFlow", "Work on developing deep learning model using Tensor Flow and other open-source technology", "Hands-on experience with noSQL data base and data interfacing", "Build real-time MLOPS dashboards", "Work on deployment and maintenance of machine learning model", "Hands-on experience with hybrid infrastructure (on-premises and Azure)", "Additional responsibilities include developing prototypes and proof of concepts for the selected use cases, and implementing complex machine learning algorithms", "Learn and build machine learning models using Spark MLlib, Spark NLP, Pytorch, and TensorFlow", "Work on developing deep learning model using Tensor Flow and other open-source technology", "Hands-on experience with noSQL data base and data interfacing", "Build real-time MLOPS dashboards", "Work on deployment and maintenance of machine learning model", "Hands-on experience with hybrid infrastructure (on-premises and Azure)", "Additional responsibilities include developing prototypes and proof of concepts for the selected use cases, and implementing complex machine learning algorithms", "Master/PhD degree in Computer Science, Software Engineering, bio-computational Sciences, Mathematics, Physics, Statistics, Informatics, and related fields", "Completion of at least first semester of degree program", "Basic knowledge with at least 1 programming language among Scala/Python/ Java. Must be flexible and fast to pick up new languages.", "Basic Knowledge of Supervised Learning, Unsupervised learning and Clustering", "Basic Knowledge of Deep Learning", "Knowledge of Hadoop, Spark, Kafka and other big data technology stacks and streaming tools.", "Familiarity with and the ability to leverage a wide variety of open-source technologies and tools.", "Knowledge of cloud architecture and implementation on Azure or AWS is a big plus.", "Using a lens of equity in all aspects of patient care delivery, education, and research to promote policies and practices to allow opportunities for all to thrive and reach their potential.", "Serving as a role model confronting racist, sexist, or other inappropriate actions by speaking up, challenging exclusionary organizational practices, and standing side-by-side in support of colleagues who experience discrimination.", "Inspiring and fostering an environment of anti-racist behaviors among and between departments and co-workers."]}, {"title": "Machine Learning for Natural Language Processing Intern\n- job post", "reqs": ["Research and develop state-of-the-art machine learning models for natural language processing tasks including information extraction, question answering", "Collaborate with mentors and other colleagues to integrate the developed methods into prototype systems for Bosch applications", "Summarize research findings in high-quality NLP conference papers (e.g., ACL, EMNLP, AAAI) and/or patent submissions", "Ph.D. or Master student on Computer Science, Electrical Engineering or related fields (Must be a current student or recent graduate – less than 1 year)", "Strong background in natural language processing, machine learning and related fields", "Hands-on experience of developing natural language processing models", "Hands-on experience of deep learning technologies and familiar with state-of-the-art deep learning toolkits", "Good communication and team-working skills", "Proficient with Python programming", "Publication record in top NLP or machine learning venues (e. g. ACL, EMNLP, AAAI, NAACL, TACL).", "Experience on domain-specific NLP tasks", "Experience on weakly supervised learning, semi-supervised learning and/or active learning", "Experience on transfer learning/domain adaptation and/or data augmentation", "FIRST Robotics (For Inspiration and Recognition of Science and Technology)", "AWIM (A World In Motion)"]}, {"title": "Data Analyst Intern\n- job post", "reqs": ["Analyzing and interpreting Pricing and Market data collected from various sources from a business perspective.", "Performing statistical analysis on the data to identify patterns and trends.", "Creating visualizations to communicate insights from the data effectively.", "Working with the team to identify opportunities for improving data collection and analysis processes.", "Documenting analysis methods and results.", "Presenting findings to team members and stakeholders.", "Must be currently a student enrolled in a degree-seeking program and in the process of obtaining a bachelor's or master's degree. (Required)", "Business analytics, finance, economics, engineering-based degree/master preferred.", "Experience with statistical analysis software (e.g., Python, Excel). (Required)", "Strong analytical and problem-solving skills.", "Excellent written and verbal communication skills.", "Ability to work independently and in a team environment.", "Familiarity with pricing strategies and market analysis techniques."]}, {"title": "Intern - Data Scientist\n- job post", "reqs": ["Collecting, cleaning, and preparing data for analysis.", "Building, training, and deploying predictive models using statistical, machine and deep learning techniques", "Creating and modifying python scripts for data analysis and automation", "Ensuring the accuracy and validity of data analysis results and models developed", "Development of automation scripts for use in GKN Automotive's Engineering Virtual Toolkit", "Perform end of term presentation on either general function or project.", "Flexible work hours", "College student pursing a Master’s degree in a relevant field (Data Science, CS, Mathematics, ME, etc.) with 3+ months previous work experience in data science/IT.", "Self-Starter", "Strong project and time management skills", "Strong computer application software knowledge and skills (specifically: Python)", "Effective written and verbal communication skills (ability to explain technical programming and ML concepts in common language)", "Must be fluent in English", "Must be able to work and travel independently"]}, {"title": "Data Analytics and Reporting Intern\n- job post", "reqs": ["Supporting the core analytics team in development of Robotic Process Automation, Data Engineering, and Business intelligence solutions", "Develop and maintain dashboards and reports to monitor key performance indicators", "Process mapping and documentation", "Consolidation of data sources and reports for efficiency", "Lead a project leveraging machine learning/advanced analytics/artificial intelligence to drive additional business insight", "Completed or in pursuit of Undergraduate degree in Business Administration, Computer Science, Industrial Engineering, or Supply Chain Management", "Strong analytical and problem-solving skills", "Proficiency in SQL, Python, or R", "Experience with data visualization tools such as Tableau, Power BI, or Excel", "Competency with Microsoft Office Suite", "Fluent in English"]}, {"title": "AI, Analytics, and Automation Intern\n- job post", "reqs": ["Assist in the development and implementation of machine learning models for data analysis.", "Work with the team to collect and analyze data from various sources.", "Contribute to the development and maintenance of chatbots using platforms such as Dialogflow, Rasa, or Microsoft Bot Framework.", "Help develop digital assistants using platforms such as Oracle Digital Assist.", "Assist in the testing and debugging of chatbots, digital assistants, scripts, and workflows.", "Contribute to the development and maintenance of conversational AI models using frameworks such as Hugging Face or OpenAI.", "Help integrate ChatGPT models into chatbots, digital assistants, and other conversational AI systems.", "Contribute to the development of best practices for data analysis, automation, chatbot development, digital assistants, and conversational AI.", "Attend team meetings and provide input on project progress and ideas for improvement.", "Support the creation and maintenance of data visualizations and dashboards using tools such as Tableau, Power BI, and Excel.", "Support the automation of manual tasks and processes using tools like UiPath and Automation Anywhere.", "Currently enrolled in a Bachelor’s or Master’s degree program in Computer Science, Mathematics, Statistics, Data Science, or a related field.", "Strong understanding of programming languages such as Python, R, and SQL.", "Familiarity with machine learning concepts and tools such as TensorFlow and PyTorch.", "Experience with chatbot development using platforms such as Dialogflow, Rasa, or Microsoft Bot Framework is a plus.", "Experience with digital assistant development using platforms such as Oracle Digital Assist, Amazon Alexa, Google Assistant, or Apple Siri is a plus.", "Experience with conversational AI models using frameworks such as Hugging Face or OpenAI is a plus.", "Experience with ChatGPT models and their integration into chatbots, digital assistants, and conversational AI systems is a plus.", "Experience with automation tools such as UiPath and Automation Anywhere is a plus.", "Excellent analytical and problem-solving skills.", "Strong attention to detail and ability to work independently.", "Strong communication skills and ability to work in a team environment."]}, {"title": "2024 Summer Corporate Intern – Digital and Analytics\n- job post", "reqs": ["Optional medical coverage", "Optional voluntary benefits", "Paid holidays", "Comprehensive internship orientation", "Tours of state-of-the-art manufacturing and research facilities", "Product Demonstration", "Various social events", "Networking with leadership", "Business skill building", "Career discussion with leaders and experts", "Must be enrolled full time at a 4-year accredited university/college in a Computer Science, Computer Engineering, Business Administration, Data Science/Analytics, Data Visualization, Marketing Analytics, Math, Stats, Software Engineering, Information Systems, Systems Engineering or related degree", "Expected graduation date of August 2024 and beyond", "Minimum cumulative GPA requirement 3.0/ 4.0 (no rounding)", "Must be able/willing to relocate to internship location", "Demonstrated leadership experience", "Previous technical internship, co-op, or research/relevant experience", "Participation in school clubs or student organizations", "Demonstrated experience with several of the following: Python, Java, SQL, Snowflake, AWS/Azure, Tableau, PowerBI, Google Analytics, Machine Learning, Deep Learning, R, Salesforce, React, JavaScript, Node.js, HTML, UI Design, UX Research, writing API’s for deployment, Postman, Scala, Akka, BigQuery", "Relevant coursework and/or projects", "Strong analytical and problem-solving skills", "Ability to demonstrate strong communication skills, initiative, and intellectual curiosity", "Able to work independently or as a collaborative team member", "Ability to learn and comply with company policies and procedures", "Comfortable working in a dynamic environment where digital is still evolving as a core offering", "Passion for technology and an eagerness to contribute to a team-orientated environment", "Ability to clearly communicate technical ideas, regardless of the technical capacity of the audience"]}, {"title": "Computer Vision Intern - Deep Learning\n- job post", "reqs": ["Experience in a Deep Learning framework such as Tensorflow or Pytorch", "Experience in applying Deep Learning on visual and/or geometric data", "Proficient in Python"]}, {"title": "Summer 2024 Investment Analyst Intern\n- job post", "reqs": ["Conduct fundamental analysis on companies and industries, building full 3-statement models for investment targets", "Perform statistical analysis of large alternative datasets to support investment conclusions", "Provide investment recommendations by drafting memos and comprehensive reports, combining both qualitative and quantitative insights", "Build predictive models on top of market/alternative data and backtest results as systematic strategies", "Pursuing a BS/MS degree with relevant coursework and experience", "Previously demonstrated proficiency with Python and Java/C++", "Proficiency in Excel and modeling", "Excellent written and verbal communication skills"]}, {"title": "AI Engineering Intern\n- job post", "reqs": ["Strong coding skills. Though the requirement is not language specific, proficiency in one or more of the following is required: Python, C/C++/C#, Java, React, R, database design and development (SQL, MongoDB), AWS.", "A sharp understanding of Data Analytics and Structures. This includes a demonstrated understanding of how to retrieve data from databases and other systems and tools using queries, exporting capabilities, and other effective methods.", "A cautious curiosity about generative AI and the role it will play in data security.", "Knowledge of MS Office applications.", "Ability to conduct research by hypothesis, using online search tools, data analysis, and documenting the research process for presentation of results.", "Be a self-motivated learner and can learn new software and tech through both formal training and self-led instruction.", "Work collaboratively with product and platform colleagues to understand key research questions around generative AI.", "Create an original Proof of Concept incorporating ideas presented, discussed, and delegated.", "Identify risks in the whole life cycle of model development and design novel approaches to avoid these risks.", "Conduct analyses, visualize data, and deliver data science findings to stakeholders which include engineers, product developers, solutions engineers, and others.", "Be part of an AI think-tank that will support internal workflows to meet our product and market needs.", "Gain powerful, practical experience at the intersection of generative AI use and software development."]}, {"title": "Summer 2024 Investment Analyst Intern\n- job post", "reqs": ["Conduct fundamental analysis on companies and industries, building full 3-statement models for investment targets", "Perform statistical analysis of large alternative datasets to support investment conclusions", "Provide investment recommendations by drafting memos and comprehensive reports, combining both qualitative and quantitative insights", "Build predictive models on top of market/alternative data and backtest results as systematic strategies", "Pursuing a BS/MS degree with relevant coursework and experience", "Previously demonstrated proficiency with Python and Java/C++", "Proficiency in Excel and modeling", "Excellent written and verbal communication skills"]}, {"title": "Intern\n- job post", "reqs": ["Work with functional representatives to develop use cases, requirements, and business logic for digital applications", "Develop digital applications to support business needs, including efficiency and automation", "Develop solutions to extract, transform, and load unstructured data for further analysis using python, R, and other languages", "Develop interactive dashboards using Power BI and Tableau", "Assist in generating analytical results", "Participate in key technical meetings and workshops", "Candidates shall be majoring in a highly analytical field of study such as: engineering, computer science, data science, or related field", "Experience using common coding languages to develop applications", "Ability to work in a dynamic team environment and perform assigned tasks with minimal guidance", "High proficiency with Microsoft Office Programs, especially Excel", "Superior interpersonal and written/oral communications", "Familiarity with basic data science techniques such as machine learning", "Familiarity with quantitative analysis techniques including statistical analysis", "Familiarity with the software development lifecycle phases of requirements, design, build, and test"]}, {"title": "AI Research Intern\n- job post", "reqs": ["Work closely with the research team to develop and implement natural language processing models.", "Execute experiments and analyze data to evaluate model performance and identify areas for improvement.", "Perform error analysis, synthesize observations, and draw meaningful conclusions to improve model accuracy and efficiency.", "Present research results and findings to the research team and other stakeholders in a clear and concise manner.", "Participate in research discussions and contribute ideas to improve research projects.", "Document research findings and share knowledge with other team members.", "Continuously learn and stay up to date with the latest advancements in machine learning research and techniques.", "Strong Python and programming skills and related deep learning tool chains including Python, Pandas, etc.", "Significant experience with NLP techniques and models such as word embeddings, neural networks, and transformer-based models.", "Excellent problem-solving skills and Experience performing research, running experiments, and reporting on results.", "Ability to work well in a team and collaborate with researchers and engineers with diverse backgrounds and skillsets.", "Graduate student in CS/Data Science/NLP/ML/AI (or undergrad with significant work experience)"]}, {"title": "Machine Learning Intern, 3D Computer Vision – Autopilot, AI\n- job post", "reqs": ["", "", "", "", "", "", "", "", "", "", "", "", "", ""]}, {"title": "Statistical Analyst Intern\n- job post", "reqs": ["Candidates must currently pursue a PhD or Master degree in biostatistics, statistics, or related program", "Candidates should have a solid understanding of statistical inference and Bayesian methods", "Must have extensive experience with conducting simulations", "Must be proficient in SAS and/or R", "Candidates must be legally authorized to work in the United States", "Vaccination is required and upon starting with the company, you will be asked to provide proof of vaccination", "Regular travel to the Boston office may be required", "8 hour shift", "Day shift", "Monday to Friday", "No weekends", "Rockland, MA 02370: Reliably commute or planning to relocate before starting work (Required)"]}, {"title": "Natural Language Processing Intern\n- job post", "reqs": ["Research and develop state-of-the-art machine learning models for natural language processing tasks including code generation, task decomposition, information extraction", "Collaborate with mentors and other colleagues to integrate the developed methods into prototype systems for Bosch applications", "Summarize research findings in high-quality NLP conference papers (e.g., ACL, EMNLP, AAAI) and/or patent submissions", "Ph.D. or Master student on Computer Science, Electrical Engineering or related fields (Must be a current student or recent graduate – less than 1 year)", "Strong background in natural language processing, machine learning and related fields", "Hands-on experience of developing NLP models with Reinforcement Learning", "Hands-on experience of deep learning technologies and familiar with state-of-the-art deep learning toolkits", "Good communication and team-working skills", "Proficient with Python programming", "Publication record in top NLP or machine learning venues (e. g. ACL, EMNLP, AAAI, NAACL, TACL).", "Experience on domain-specific NLP tasks", "Experience on language generation tasks specifically on Code generation", "Experience on weakly supervised learning, semi-supervised learning and/or active learning", "Experience on API guided text generation", "FIRST Robotics (For Inspiration and Recognition of Science and Technology)", "AWIM (A World In Motion)"]}, {"title": "Business Analytics Specialist - Fall Internship\n- job post", "reqs": ["Collaborate with business stakeholders to identify opportunities and scope pragmatic advanced analytics business cases to drive impact.", "Work with IT Data Analytics delivery teams to understand AI services offering and help establish scalable agile.", "Program delivery mechanisms to realize business use cases.", "Use advanced statistics, machine learning and other techniques to help develop insightful analytics and make data-driven business decisions.", "Create interactive data visualizations & reports to communicate recommendations to both technical and non-technical audiences.", "Execute and improve Transforming Everyday Analytics program processes with the Business + IT fusion team collaboratively.", "Develop knowledge base artifacts and conduct Data literacy training for empowering the citizen developer network across business functions.", "Stay up to date with the latest data science and AI techniques and tools.", "Ensure the ongoing accuracy and reliability of models by implementing quality control & model retraining measures.", "Master’s with focus on business analytics or data science.", "2+ years of relevant industry or consulting experience preferred. Hands on experience with machine learning techniques and tools required.", "Experience working with SQL data bases /Snowflake and data analytics tools such as Tableau and Knime.", "Proficiency in programming languages such as Python strongly preferred.", "Strong communication and cross-functional collaboration skills. Ability to work independently and as part of an agile program team."]}, {"title": "Graduate Student Intern - Machine Learning\n- job post", "reqs": ["Work closely with other chemical and mechanical engineers to develop and apply machine learning models to pilot projects", "Perform data analysis to understand model performance and derive insights from data sets", "Prepare reports and present the findings to peers unfamiliar with machine learning at project/program review meetings", "A graduate-level student in data/computer science, electrical engineering, or other related disciplines", "Strong grasp of machine learning concepts proven through academic or research projects", "Competence in computer programming and automatic data processing", "Critical thinking and excellent communication skills", "Passion for applied research and product development"]}, {"title": "2023 Fall Applied Science Internship - Natural Language Processing and Speech Technologies - United States, Student Science Recruiting\n- job post", "reqs": ["Enrolled in a Ph.D. degree or equivalent in speech or language technologies, computer science, statistics, physics, engineering, or related topics.", "Experience in designing experiments and statistical analysis of results.", "Experience in understanding and ability to implement algorithms using both toolkits and self-developed code.", "Experience with Java, C++, or other programming language, as well as with R, MATLAB, Python, or similar scripting language.", "Technical fluency; comfort understanding and discussing architectural concepts and algorithms, schedule tradeoffs and new opportunities with technical team members.", "Publication(s) at peer-reviewed conferences or journals.", "Excellent critical thinking skills, combined with the ability to present your beliefs clearly and compellingly in both verbal and written form."]}, {"title": "Spring '23 Machine Learning/HPC Architect Co-Op/ Intern\n- job post", "reqs": ["Communicate and collaborate with a network of experienced architects and designers around the world.", "Identify complex technical problems, break them down, summarize possible solutions", "Work with architects to propose innovative solutions that can be implemented in HW, validated by developing various models/simulators", "Collect/summarize data or simulation results for consumption by architects and design teams", "Knowledge of CPU architectures, basic knowledge of GPGPU architectures", "Excellent C/C++/Scripting (Python, etc.) experience", "HW/RTL/SystemC experience", "Knowledge of Graphics/Compute APIs (CUDA/OpenCL/Vulkan etc.) is desirable", "Knowledge of ML networks, Tensorflow/Pytorch desirable", "Knowledge of OS/device drivers is a plus", "Bachelor of Science degree with emphasis in Electrical Engineering, Computer architecture, or Computer Science with relevant experience preferred, or", "Master or PhD degree with emphasis in Electrical Engineering, Computer architecture, or Computer Science"]}, {"title": "Software Engineering Intern (Machine Learning Sys-US) - 2023 Fall (BS/MS)\n- job post", "reqs": ["Develop key components of machine learning systems, including compiler, distributed frameworks, cluster scheduling, storage systems, etc.", "Optimize the implementation and deploy them in production systems.", "Currently pursuing a Undergraduate/Graduate/Master/PhD in Software Development, Computer Science, Computer Engineering, or a related technical discipline.", "Able to commit to working for 12 weeks during Fall 2023", "Must obtain work authorization in country of employment at the time of hire, and maintain ongoing work authorization during employment.", "Familiar with the C/C++ and Python development in Linux environments;", "Familiar with at least one deep learning framework (TensorFlow, PyTorch, MXNet, or other);", "Self-motivated and can solve challenging technical problems with good teamwork", "Good communication and teamwork skills to clearly communicate technical concepts with other teammates.", "Graduating December 2023 onwards with intent to return to degree-program after the completion of the internship.", "Demonstrated software engineering experience from previous internship, work experience, coding competitions, or publications", "High levels of creativity and quick problem-solving capabilities"]}, {"title": "Data Scientist, PhD Intern\n- job post", "reqs": []}, {"title": "Deep Learning Algorithm Engineering Intern\n- job post", "reqs": ["Develop algorithms for deep learning, data analytics, machine learning, or scientific computing.", "Construct and curate large problem specific datasets.", "Analyze and improve performance of GPU implementations.", "Collaborate with team members and other partners.", "Keep up with the latest DL research and collaborate with diverse teams (internal and external to NVIDIA), including DL researchers, hardware and software engineers.", "Pursuing a Bachelors, Masters, or PhD or equivalent in Computer Science, Artificial Intelligence, or Applied Math.", "Strong Mathematical fundamentals and algorithms skills or experience.", "Background with Deep Learning or DL Frameworks (e.g. TensorFlow, PyTorch, MXNet).", "Excellent Python skills.", "Excellent analytical, programming, debugging, performance analysis, and test design skills.", "Experience doing performance analysis and tuning.", "Excellent C/C++, GPU programming (CUDA or OpenCL) skills.", "Familiarity with HW architecture (ideally accelerators), numerical software, DL inference, deployment, model conversion topics (e.g. Torch Script, Torch Trace, ONNX, TensorRT/TRT)"]}, {"title": "3D Perception and Deep Learning - Intern\n- job post", "reqs": ["Conduct advanced research and engineering in 3D perception and machine learning to address challenges in mixed reality and autonomous systems.", "Apply research results to real-world applications with high quality implementation", "Integrate the resulting system/software into existing Bosch platform", "Summarize research findings in high-quality paper and/or patent submissions", "Ph.D. student in Computer Science or related fields (Must be a current student or recent graduate – less than 1 year)", "Hands-on experience on developing computer vision and machine learning algorithms with focus on at least two of the following areas: object detection/segmentation, 3D scene understanding, autonomous driving, mixed reality, localization, SfM, and sensor fusion.", "Solid python and/or C++ programming skills and proficient with libraries such as OpenCV, Tensorflow, and PyTorch.", "Publication record in top venues including CVPR, ICCV, ICRA, ISMAR, ECCV, NeurIPS, ICLR, TVCG, SIGGRAPH.", "Experience in working with hardware systems including sensors such as cameras, depth sensors, IMU, LIDAR, etc.", "Familiar with SOTA vision and learning methods of self-supervised learning, ViT, GAN, NeRF, Diffusion, vision-language modeling, and so on.", "Familiar with vector/point-based input representations for learning", "Able to work independently, has strong research and problem-solving skills", "Strong background in math and statistics", "Good communication and teamwork skills", "Major(s): Computer Science or related fields", "Degree level: Ph.D. Candidates", "Start Date: May 2023", "FIRST Robotics (For Inspiration and Recognition of Science and Technology)", "AWIM (A World In Motion)"]}, {"title": "Biostatistics and Statistical Programming Intern\n- job post", "reqs": []}, {"title": "Graduate Intern – Academic Advising\n- job post", "reqs": ["Current student in a M.A., M.S., M.Ed. or Ed.D. program in educational policy leadership, student affairs, higher education or a similar field", "Desire to support a diverse array of master’s students (both domestic and international) in Computer Science and Data Science", "Experience with Microsoft Suite and Google Suite", "Strong interpersonal and communication skills"]}, {"title": "R&D and Production Scale-up Intern\n- job post", "reqs": ["Conduct R&D trials for new plant-based cheese products, including recipe development, ingredient sourcing, and production process optimization, in collaboration with the R&D team and under the supervision of the production manager.", "Assist with scale-up trials to test and optimize production processes", "Organize sensory tastings to evaluate plant-based cheese products' taste, texture, and overall quality, and organize shelf-life study.", "Collect and analyze data from experiments and trials, and assist with data interpretation and reporting.", "Collaborate with R&D and production teams", "Keep detailed records of experiments, trials, and other project activities.", "Support the team in other tasks as needed.", "Currently enrolled in or recently graduated from a Bachelor's or Master's degree program in Food Science, Chemical Engineering, or a related field.", "Knowledge of food science and food processing", "Ability to work collaboratively with cross-functional teams.", "Proficiency with Microsoft Office applications and the Google Workspace tools suite", "Strong communication skills", "Strong attention to detail and recordkeeping", "Must have the authorization to work in the US", "Must be able to lift 50 lbs.", "Proficient in written and spoken English"]}, {"title": "Student Opportunities - Actuarial Internship - Summer 2024 (Hybrid)\n- job post", "reqs": ["active pursuit of a degree in Actuarial Science, Data Science, Math, Statistics, Physics, Chemistry, Finance, or related major", "clear communication, both oral and written", "ability to solve problems systematically and creatively", "work independently and as part of a team", "use computers confidently, MS Excel and SAS experience desired", "preferred candidates have passed at least one actuarial exam"]}, {"title": "Machine Learning Intern, 3D Computer Vision – Autopilot, AI\n- job post", "reqs": ["Develop novel formulations and architectures for a wide variety of computer vision tasks.", "Perform large-scale distributed training of deep neural networks to build a unified and consistent vector space for autonomous driving tasks (e.g., occupancy, occupancy flow, semantics, geometry, detection, drivable surface).", "Design metrics, tasks, and datasets that aid in perception and autonomy.", "Deploy models at scale to millions of Tesla cars in the real world.", "Strict adherence to strong software engineering practices to develop novel work quickly and safely.", "Strong experience writing production-level Python and software engineering best practices.", "Solid mathematical fundamentals including linear algebra, vector calculus, probability theory, and numeric optimization.", "An “under the hood” knowledge of deep learning: layer details, loss functions, optimization, etc.", "Understanding of modern deep learning techniques (CNNs, transformers, autoregressive models, etc.).", "Domain expertise in at least one of these areas: object detection & tracking, pose estimation, depth estimation, semantic & instance segmentation, video models, differentiable rendering, Neural Radiance Field (NeRF), 3D reconstruction, visual SLAM, structure from motion.", "Familiarity with basic computer vision concepts such as intrinsic and extrinsic calibrations, homogeneous coordinates, projection matrices, and epipolar geometry.", "Experience with PyTorch, or at least another major deep learning framework such as TensorFlow.", "Experience in GPU programming (e.g., CUDA, OpenCL, OpenGL) or GPU-accelerated libraries.", "Comfortable working in a shared cluster environment."]}, {"title": "Statistical Analyst Intern\n- job post", "reqs": ["Candidates must currently pursue a PhD or Master degree in biostatistics, statistics, or related program", "Candidates should have a solid understanding of statistical inference and Bayesian methods", "Must have extensive experience with conducting simulations", "Must be proficient in SAS and/or R", "Candidates must be legally authorized to work in the United States", "Vaccination is required and upon starting with the company, you will be asked to provide proof of vaccination", "Regular travel to the Boston office may be required", "8 hour shift", "Day shift", "Monday to Friday", "No weekends", "Rockland, MA 02370: Reliably commute or planning to relocate before starting work (Required)"]}, {"title": "Natural Language Processing Intern\n- job post", "reqs": ["Research and develop state-of-the-art machine learning models for natural language processing tasks including code generation, task decomposition, information extraction", "Collaborate with mentors and other colleagues to integrate the developed methods into prototype systems for Bosch applications", "Summarize research findings in high-quality NLP conference papers (e.g., ACL, EMNLP, AAAI) and/or patent submissions", "Ph.D. or Master student on Computer Science, Electrical Engineering or related fields (Must be a current student or recent graduate – less than 1 year)", "Strong background in natural language processing, machine learning and related fields", "Hands-on experience of developing NLP models with Reinforcement Learning", "Hands-on experience of deep learning technologies and familiar with state-of-the-art deep learning toolkits", "Good communication and team-working skills", "Proficient with Python programming", "Publication record in top NLP or machine learning venues (e. g. ACL, EMNLP, AAAI, NAACL, TACL).", "Experience on domain-specific NLP tasks", "Experience on language generation tasks specifically on Code generation", "Experience on weakly supervised learning, semi-supervised learning and/or active learning", "Experience on API guided text generation", "FIRST Robotics (For Inspiration and Recognition of Science and Technology)", "AWIM (A World In Motion)"]}, {"title": "Business Analytics Specialist - Fall Internship\n- job post", "reqs": ["Collaborate with business stakeholders to identify opportunities and scope pragmatic advanced analytics business cases to drive impact.", "Work with IT Data Analytics delivery teams to understand AI services offering and help establish scalable agile.", "Program delivery mechanisms to realize business use cases.", "Use advanced statistics, machine learning and other techniques to help develop insightful analytics and make data-driven business decisions.", "Create interactive data visualizations & reports to communicate recommendations to both technical and non-technical audiences.", "Execute and improve Transforming Everyday Analytics program processes with the Business + IT fusion team collaboratively.", "Develop knowledge base artifacts and conduct Data literacy training for empowering the citizen developer network across business functions.", "Stay up to date with the latest data science and AI techniques and tools.", "Ensure the ongoing accuracy and reliability of models by implementing quality control & model retraining measures.", "Master’s with focus on business analytics or data science.", "2+ years of relevant industry or consulting experience preferred. Hands on experience with machine learning techniques and tools required.", "Experience working with SQL data bases /Snowflake and data analytics tools such as Tableau and Knime.", "Proficiency in programming languages such as Python strongly preferred.", "Strong communication and cross-functional collaboration skills. Ability to work independently and as part of an agile program team."]}, {"title": "Graduate Student Intern - Machine Learning\n- job post", "reqs": ["Work closely with other chemical and mechanical engineers to develop and apply machine learning models to pilot projects", "Perform data analysis to understand model performance and derive insights from data sets", "Prepare reports and present the findings to peers unfamiliar with machine learning at project/program review meetings", "A graduate-level student in data/computer science, electrical engineering, or other related disciplines", "Strong grasp of machine learning concepts proven through academic or research projects", "Competence in computer programming and automatic data processing", "Critical thinking and excellent communication skills", "Passion for applied research and product development"]}, {"title": "Spring '23 Machine Learning/HPC Architect Co-Op/ Intern\n- job post", "reqs": ["Communicate and collaborate with a network of experienced architects and designers around the world.", "Identify complex technical problems, break them down, summarize possible solutions", "Work with architects to propose innovative solutions that can be implemented in HW, validated by developing various models/simulators", "Collect/summarize data or simulation results for consumption by architects and design teams", "Knowledge of CPU architectures, basic knowledge of GPGPU architectures", "Excellent C/C++/Scripting (Python, etc.) experience", "HW/RTL/SystemC experience", "Knowledge of Graphics/Compute APIs (CUDA/OpenCL/Vulkan etc.) is desirable", "Knowledge of ML networks, Tensorflow/Pytorch desirable", "Knowledge of OS/device drivers is a plus", "Bachelor of Science degree with emphasis in Electrical Engineering, Computer architecture, or Computer Science with relevant experience preferred, or", "Master or PhD degree with emphasis in Electrical Engineering, Computer architecture, or Computer Science"]}, {"title": "Software Engineering Intern (Machine Learning Sys-US) - 2023 Fall (BS/MS)\n- job post", "reqs": ["Develop key components of machine learning systems, including compiler, distributed frameworks, cluster scheduling, storage systems, etc.", "Optimize the implementation and deploy them in production systems.", "Currently pursuing a Undergraduate/Graduate/Master/PhD in Software Development, Computer Science, Computer Engineering, or a related technical discipline.", "Able to commit to working for 12 weeks during Fall 2023", "Must obtain work authorization in country of employment at the time of hire, and maintain ongoing work authorization during employment.", "Familiar with the C/C++ and Python development in Linux environments;", "Familiar with at least one deep learning framework (TensorFlow, PyTorch, MXNet, or other);", "Self-motivated and can solve challenging technical problems with good teamwork", "Good communication and teamwork skills to clearly communicate technical concepts with other teammates.", "Graduating December 2023 onwards with intent to return to degree-program after the completion of the internship.", "Demonstrated software engineering experience from previous internship, work experience, coding competitions, or publications", "High levels of creativity and quick problem-solving capabilities"]}, {"title": "3D Perception and Deep Learning - Intern\n- job post", "reqs": ["Conduct advanced research and engineering in 3D perception and machine learning to address challenges in mixed reality and autonomous systems.", "Apply research results to real-world applications with high quality implementation", "Integrate the resulting system/software into existing Bosch platform", "Summarize research findings in high-quality paper and/or patent submissions", "Ph.D. student in Computer Science or related fields (Must be a current student or recent graduate – less than 1 year)", "Hands-on experience on developing computer vision and machine learning algorithms with focus on at least two of the following areas: object detection/segmentation, 3D scene understanding, autonomous driving, mixed reality, localization, SfM, and sensor fusion.", "Solid python and/or C++ programming skills and proficient with libraries such as OpenCV, Tensorflow, and PyTorch.", "Publication record in top venues including CVPR, ICCV, ICRA, ISMAR, ECCV, NeurIPS, ICLR, TVCG, SIGGRAPH.", "Experience in working with hardware systems including sensors such as cameras, depth sensors, IMU, LIDAR, etc.", "Familiar with SOTA vision and learning methods of self-supervised learning, ViT, GAN, NeRF, Diffusion, vision-language modeling, and so on.", "Familiar with vector/point-based input representations for learning", "Able to work independently, has strong research and problem-solving skills", "Strong background in math and statistics", "Good communication and teamwork skills", "Major(s): Computer Science or related fields", "Degree level: Ph.D. Candidates", "Start Date: May 2023", "FIRST Robotics (For Inspiration and Recognition of Science and Technology)", "AWIM (A World In Motion)"]}, {"title": "Biostatistics and Statistical Programming Intern\n- job post", "reqs": []}, {"title": "Graduate Intern – Academic Advising\n- job post", "reqs": ["Current student in a M.A., M.S., M.Ed. or Ed.D. program in educational policy leadership, student affairs, higher education or a similar field", "Desire to support a diverse array of master’s students (both domestic and international) in Computer Science and Data Science", "Experience with Microsoft Suite and Google Suite", "Strong interpersonal and communication skills"]}, {"title": "R&D and Production Scale-up Intern\n- job post", "reqs": ["Conduct R&D trials for new plant-based cheese products, including recipe development, ingredient sourcing, and production process optimization, in collaboration with the R&D team and under the supervision of the production manager.", "Assist with scale-up trials to test and optimize production processes", "Organize sensory tastings to evaluate plant-based cheese products' taste, texture, and overall quality, and organize shelf-life study.", "Collect and analyze data from experiments and trials, and assist with data interpretation and reporting.", "Collaborate with R&D and production teams", "Keep detailed records of experiments, trials, and other project activities.", "Support the team in other tasks as needed.", "Currently enrolled in or recently graduated from a Bachelor's or Master's degree program in Food Science, Chemical Engineering, or a related field.", "Knowledge of food science and food processing", "Ability to work collaboratively with cross-functional teams.", "Proficiency with Microsoft Office applications and the Google Workspace tools suite", "Strong communication skills", "Strong attention to detail and recordkeeping", "Must have the authorization to work in the US", "Must be able to lift 50 lbs.", "Proficient in written and spoken English"]}, {"title": "Intern, Innovation and AI Engineering (Fall 2023)\n- job post", "reqs": ["Speaking with business stakeholders and customers to identify problem areas", "Developing and modifying state-of-the-art ML models to build robust and holistic solutions", "Collaborating with other engineers, strategists, venture capitalists, and designers to think of customer experiences that can be transformed by machine learning and AI", "Staying in touch with advancements in technology and brainstorming ways to incorporate them into different areas.", "Experience travel and culture through unmatched flight benefits", "Incredibly passionate, empathetic, and truly talented team members across engineering, strategy, venture, and design functions", "Freedom of working on a small team while having the impact of a team that drives innovation forward at a huge company", "Excitement of working on customer-facing projects that can ship within weeks", "Offices located in Midtown in Atlanta, adjacent to Georgia Tech campus", "Have experience developing machine learning models (e.g. neural networks, deep reinforcement learning, gradient boosted trees, etc.) using Python, TensorFlow, PyTorch, or other machine learning platforms", "Knowledgeable about different machine learning domains like natural language processing, computer vision, personalization and recommendation, and anomaly detection", "Identify the pros and cons of multiple options and come up with a recommendation", "Self-manage your time really well—you may have competing priorities and will need to decide what to work on and how much time to dedicate", "Consistently prioritizes safety and security of self, others, and personal data.", "Embraces diverse people, thinking, and styles.", "Possesses a high school diploma, GED, or high school equivalency.", "Is at least 18 years of age and has authorization to work in the United States.", "Self-starter with the ability to work independently and collaboratively", "Curiosity and willingness to explore topics beyond the surface", "Monday to Friday"]}, {"title": "UIUC Research Park Intern - Machine Learning\n- job post", "reqs": ["Challenge assumptions and be an advocate for best practices", "Discover your potential with cross-functional partnerships and be an asset to your leadership team.", "Ability to navigate ambiguity in a fast-paced environment.", "Capable of working as a member of a team across several cross functional disciplines, including with external stakeholders.", "Exceptional verbal and written communication skills.", "Must be currently pursuing a bachelors, masters, or PhD degree in Machine Learning, Computer Vision or similar at University of Illinois, Urbana-Champaign\nGood understanding of algorithms for Computer Vision applications, Deep Learning, Natural Language Processing, Artificial Intelligence, or related fields, required.\nStrong mathematical background and capability to analyze results, required.\nExcellent PyTorch, C++ programming skills , required.\nGood understanding of software fundamentals, preferred.\nWorking knowledge of AWS cloud infrastructure, preferred.\nExperience with various HW platforms used for machine learning, preferred.\nMust be a located in Champaign, IL\nMust be available for 15-20 hours per week in the Fall and Spring and 40 hours in the summer.\nThis project will require weekly task status update and monthly project updates.\nThis internship will likely continue beyond Spring 2024.\n#LI-SAI7", "Must be currently pursuing a bachelors, masters, or PhD degree in Machine Learning, Computer Vision or similar at University of Illinois, Urbana-Champaign", "Good understanding of algorithms for Computer Vision applications, Deep Learning, Natural Language Processing, Artificial Intelligence, or related fields, required.", "Strong mathematical background and capability to analyze results, required.", "Excellent PyTorch, C++ programming skills , required.", "Good understanding of software fundamentals, preferred.", "Working knowledge of AWS cloud infrastructure, preferred.", "Experience with various HW platforms used for machine learning, preferred.", "Must be a located in Champaign, IL", "Must be available for 15-20 hours per week in the Fall and Spring and 40 hours in the summer.", "This project will require weekly task status update and monthly project updates.", "This internship will likely continue beyond Spring 2024.", "Must be currently pursuing a bachelors, masters, or PhD degree in Machine Learning, Computer Vision or similar at University of Illinois, Urbana-Champaign", "Good understanding of algorithms for Computer Vision applications, Deep Learning, Natural Language Processing, Artificial Intelligence, or related fields, required.", "Strong mathematical background and capability to analyze results, required.", "Excellent PyTorch, C++ programming skills , required.", "Good understanding of software fundamentals, preferred.", "Working knowledge of AWS cloud infrastructure, preferred.", "Experience with various HW platforms used for machine learning, preferred.", "Must be a located in Champaign, IL", "Must be available for 15-20 hours per week in the Fall and Spring and 40 hours in the summer.", "This project will require weekly task status update and monthly project updates.", "This internship will likely continue beyond Spring 2024."]}, {"title": "Business Intelligence Intern\n- job post", "reqs": ["Support ongoing projects for Business Intelligence, Partnerships, Ticketing, Marketing, Mobile App, and other areas of the business", "Provide insights using data on consumer behavior, attitudes, demographics, and more", "Review and maintain current Tableau dashboards and optimize SQL queries", "Assist with organizing, cleaning, and managing data in CRM", "Pursuing a degree in Statistics, Mathematics, Business Administration, Computer Science, or other related disciplines", "Interest in working in the sports industry, specifically within Business Intelligence", "Detail-oriented self-starter with proven ability to learn new skills quickly", "Possess strong analytical, creative problem-solving, and project management skills", "Advanced experience with Microsoft Excel", "Experience with market research is preferred", "Experience with data visualization tools (Tableau preferred) is preferred", "Experience with SQL or other database languages is preferred", "Experience with data science and statistical software (R, Python) is a plus", "Experience with HTML a plus"]}, {"title": "Nittany AI Advance Internship - PSU Undergrad - Multiple Opportunities\n- job post", "reqs": []}, {"title": "Research Intern – AI-based Planning for Autonomous Systems\n- job post", "reqs": ["Conduct cutting-edge research and engineering projects in AI, deep learning and reinforcement learning algorithms to tackle challenges and uncertainties of predication and planning for autonomous systems.", "Work with an international team of experts to transfer the results of advanced research to Bosch business units. Benchmark, validate and test research ideas on simulated environments, large scale datasets, and self-driving vehicles.", "Summarize research findings in high-quality paper and/or patent submissions.", "Currently pursuing MS or PhD in Computer Science / Robotics / Systems Engineering or a related technical field, with research focus on robotic systems or autonomous driving applications.", "Hands-on experience in deep learning and/or AI system topics with focus on at least two of the following areas: reinforcement learning, imitation learning, vector/point-based input representations for learning, planning for navigation, behavior prediction, multi-agent training, uncertainty estimation, localization, and sensor fusion.", "Programming experience in C++, Python, and hands-on experience with libraries such as Tensorflow, PyTorch, OpenCV, etc.", "Publication record in top venues in robotics/machine learning/computer vision, e.g., ICRA, IROS, RSS, NeurIPS, ICML, ICLR, CVPR, ICCV, and ECCV.", "Project experience in the field of planning or prediction for automated driving", "Strong leadership skills with excellent English communication & teamwork skills.", "Background in methods for planning under uncertainty and risk-aware intelligent decision making in uncertain environments.", "Background in probabilistic robotics.", "Experience in writing algorithms in C++ efficiently and correctly in a production environment (code reviews, unit tests, etc.)", "Knowledge of Linux, and development on Linux systems.", "Experience working with big data and associated distributed processing tools (e.g., Spark) as well as cloud services (e.g., AWS, Azure)", "FIRST Robotics (For Inspiration and Recognition of Science and Technology)", "AWIM (A World In Motion)"]}, {"title": "Intern- Information Technology\n- job post", "reqs": []}, {"title": "Machine Learning Intern(SAMI Audio Creation) - 2023 Summer (MS/PhD)\n- job post", "reqs": ["Contribute cutting-edge research to our product evolution (e.g., TikTok, Douyin, CapCut) to impact billions of users worldwide", "Lead research to advance science and technology in audio processing and generation (e.g., Speech Synthesis, Voice Conversion, etc.)", "Research, model, design, develop and evaluate novel machine learning models and algorithms", "Collaborate with globally based researchers and engineering team in developing machine learning models and algorithms", "Currently has or is in the process of obtaining an M.S or Ph.D. degree in computer science, statistics, machine learning, or similar fields.", "At least three years of relevant industry or research experience", "Good knowledge of theoretical and empirical research and for addressing research problems", "Solid knowledge and experience with at least one popular deep learning framework (e.g., PyTorch, TensorFlow) and familiarity with deep neural network architectures", "Good presentation and communication skills", "Experience in both neural and non-neural, classical machine learning models and algorithms", "Expertise in one or more of the following fields: natural language processing, computer vision, speech synthesis or recognition, optimization, generative models", "Strong first-author publications record in top AI conferences or journals(e.g., ACL, EMNLP, NAACL NeurIPS, ICML, ICLR)", "Proficient in C / C + +, Python, and shell programming languages, and have a deep understanding of data structure and algorithm design.", "Work or internship experience in an AI research organization"]}, {"title": "Business Intelligence Consulting Intern - Summer 2024\n- job post", "reqs": ["Executing solution delivery engagements", "Discerning, defining, refining, and documenting client requirements", "Building reports, dashboards and scorecards using a variety of tools", "Providing ongoing support to existing clients", "Building out demonstration scenarios and prototypes", "Collaborating and working effectively with consultants in other regions and practices", "Working towards B.A. or B.S. degree or equivalent from an accredited university", "Currently pursuing or recently completed a Bachelor’s or Master’s degree in Business Administration, Accounting, Computer Science, Data Science/Analytics, Management Information Systems", "Developing proficiency with Microsoft SQL Server Database Engine (database administration/maintenance), SQL Server Reporting Services, SQL Server Integration Services", "Ability to work with Data Visualization tools and dashboards for reporting and storytelling purposes", "Strong Excel fundamentals", "Experience using T-SQL scripts (stored procedures, views, functions etc.) to manipulate data and simplify access to data", "Experience with data modeling/manipulation (normalized and de-normalized data models), understanding of the appropriate purpose for each", "Experience developing basic web/desktop applications using ASP.NET framework", "Ability to communicate effectively, both in writing and verbally", "Ability to interact effectively with internal and external resources at all organizational levels", "Excellent project management, organization, and follow-up skills", "Strong critical thinking and problem-solving skills", "Must be a team player; able to work in virtual teams and independently", "Travel to assigned client locations is required. Must have access to and ability to arrange for use of reliable modes of transportation to those locations.", "Ability to travel up to 25%", "A minimum 3.0 GPA is preferred"]}, {"title": "Group 52: - AI Technology and Systems - CO-OP Student\n- job post", "reqs": ["Enrolled in a degree program in Computer Science, Computer Engineering, Cyber Security, Applied Mathematics or a related field", "Ability to work with senior data scientists to explore new techniques and technologies and design, develop, test, and validate cyber-AI capabilities", "Selected candidate will be subject to a pre-employment background investigation and must be able to obtain and maintain a Secret-level DoD security clearance", "Knowledge of at least one programming language (e.g. C/C++, Python, Java, Javascript, React, D3 and/or R)", "Experience and interest in AI, Machine Learning, and/or Data Science", "Experience with applied Mathematics or Statistics"]}, {"title": "Spring '23 Machine Learning/HPC Architect Co-Op/ Intern\n- job post", "reqs": ["Communicate and collaborate with a network of experienced architects and designers around the world.", "Identify complex technical problems, break them down, summarize possible solutions", "Work with architects to propose innovative solutions that can be implemented in HW, validated by developing various models/simulators", "Collect/summarize data or simulation results for consumption by architects and design teams", "Knowledge of CPU architectures, basic knowledge of GPGPU architectures", "Excellent C/C++/Scripting (Python, etc.) experience", "HW/RTL/SystemC experience", "Knowledge of Graphics/Compute APIs (CUDA/OpenCL/Vulkan etc.) is desirable", "Knowledge of ML networks, Tensorflow/Pytorch desirable", "Knowledge of OS/device drivers is a plus", "Bachelor of Science degree with emphasis in Electrical Engineering, Computer architecture, or Computer Science with relevant experience preferred, or", "Master or PhD degree with emphasis in Electrical Engineering, Computer architecture, or Computer Science"]}, {"title": "Software Engineering Intern (Machine Learning Sys-US) - 2023 Fall (BS/MS)\n- job post", "reqs": ["Develop key components of machine learning systems, including compiler, distributed frameworks, cluster scheduling, storage systems, etc.", "Optimize the implementation and deploy them in production systems.", "Currently pursuing a Undergraduate/Graduate/Master/PhD in Software Development, Computer Science, Computer Engineering, or a related technical discipline.", "Able to commit to working for 12 weeks during Fall 2023", "Must obtain work authorization in country of employment at the time of hire, and maintain ongoing work authorization during employment.", "Familiar with the C/C++ and Python development in Linux environments;", "Familiar with at least one deep learning framework (TensorFlow, PyTorch, MXNet, or other);", "Self-motivated and can solve challenging technical problems with good teamwork", "Good communication and teamwork skills to clearly communicate technical concepts with other teammates.", "Graduating December 2023 onwards with intent to return to degree-program after the completion of the internship.", "Demonstrated software engineering experience from previous internship, work experience, coding competitions, or publications", "High levels of creativity and quick problem-solving capabilities"]}, {"title": "3D Perception and Deep Learning - Intern\n- job post", "reqs": ["Conduct advanced research and engineering in 3D perception and machine learning to address challenges in mixed reality and autonomous systems.", "Apply research results to real-world applications with high quality implementation", "Integrate the resulting system/software into existing Bosch platform", "Summarize research findings in high-quality paper and/or patent submissions", "Ph.D. student in Computer Science or related fields (Must be a current student or recent graduate – less than 1 year)", "Hands-on experience on developing computer vision and machine learning algorithms with focus on at least two of the following areas: object detection/segmentation, 3D scene understanding, autonomous driving, mixed reality, localization, SfM, and sensor fusion.", "Solid python and/or C++ programming skills and proficient with libraries such as OpenCV, Tensorflow, and PyTorch.", "Publication record in top venues including CVPR, ICCV, ICRA, ISMAR, ECCV, NeurIPS, ICLR, TVCG, SIGGRAPH.", "Experience in working with hardware systems including sensors such as cameras, depth sensors, IMU, LIDAR, etc.", "Familiar with SOTA vision and learning methods of self-supervised learning, ViT, GAN, NeRF, Diffusion, vision-language modeling, and so on.", "Familiar with vector/point-based input representations for learning", "Able to work independently, has strong research and problem-solving skills", "Strong background in math and statistics", "Good communication and teamwork skills", "Major(s): Computer Science or related fields", "Degree level: Ph.D. Candidates", "Start Date: May 2023", "FIRST Robotics (For Inspiration and Recognition of Science and Technology)", "AWIM (A World In Motion)"]}, {"title": "Biostatistics and Statistical Programming Intern\n- job post", "reqs": []}, {"title": "Graduate Intern – Academic Advising\n- job post", "reqs": ["Current student in a M.A., M.S., M.Ed. or Ed.D. program in educational policy leadership, student affairs, higher education or a similar field", "Desire to support a diverse array of master’s students (both domestic and international) in Computer Science and Data Science", "Experience with Microsoft Suite and Google Suite", "Strong interpersonal and communication skills"]}, {"title": "3D Perception and Deep Learning - Intern\n- job post", "reqs": ["Conduct advanced research and engineering in 3D perception and machine learning to address challenges in mixed reality and autonomous systems.", "Apply research results to real-world applications with high quality implementation", "Integrate the resulting system/software into existing Bosch platform", "Summarize research findings in high-quality paper and/or patent submissions", "Ph.D. student in Computer Science or related fields (Must be a current student or recent graduate – less than 1 year)", "Hands-on experience on developing computer vision and machine learning algorithms with focus on at least two of the following areas: object detection/segmentation, 3D scene understanding, autonomous driving, mixed reality, localization, SfM, and sensor fusion.", "Solid python and/or C++ programming skills and proficient with libraries such as OpenCV, Tensorflow, and PyTorch.", "Publication record in top venues including CVPR, ICCV, ICRA, ISMAR, ECCV, NeurIPS, ICLR, TVCG, SIGGRAPH.", "Experience in working with hardware systems including sensors such as cameras, depth sensors, IMU, LIDAR, etc.", "Familiar with SOTA vision and learning methods of self-supervised learning, ViT, GAN, NeRF, Diffusion, vision-language modeling, and so on.", "Familiar with vector/point-based input representations for learning", "Able to work independently, has strong research and problem-solving skills", "Strong background in math and statistics", "Good communication and teamwork skills", "Major(s): Computer Science or related fields", "Degree level: Ph.D. Candidates", "Start Date: May 2023", "FIRST Robotics (For Inspiration and Recognition of Science and Technology)", "AWIM (A World In Motion)"]}, {"title": "Research Intern – AI-based Planning for Autonomous Systems\n- job post", "reqs": ["Conduct cutting-edge research and engineering projects in AI, deep learning and reinforcement learning algorithms to tackle challenges and uncertainties of predication and planning for autonomous systems.", "Work with an international team of experts to transfer the results of advanced research to Bosch business units. Benchmark, validate and test research ideas on simulated environments, large scale datasets, and self-driving vehicles.", "Summarize research findings in high-quality paper and/or patent submissions.", "Currently pursuing MS or PhD in Computer Science / Robotics / Systems Engineering or a related technical field, with research focus on robotic systems or autonomous driving applications.", "Hands-on experience in deep learning and/or AI system topics with focus on at least two of the following areas: reinforcement learning, imitation learning, vector/point-based input representations for learning, planning for navigation, behavior prediction, multi-agent training, uncertainty estimation, localization, and sensor fusion.", "Programming experience in C++, Python, and hands-on experience with libraries such as Tensorflow, PyTorch, OpenCV, etc.", "Publication record in top venues in robotics/machine learning/computer vision, e.g., ICRA, IROS, RSS, NeurIPS, ICML, ICLR, CVPR, ICCV, and ECCV.", "Project experience in the field of planning or prediction for automated driving", "Strong leadership skills with excellent English communication & teamwork skills.", "Background in methods for planning under uncertainty and risk-aware intelligent decision making in uncertain environments.", "Background in probabilistic robotics.", "Experience in writing algorithms in C++ efficiently and correctly in a production environment (code reviews, unit tests, etc.)", "Knowledge of Linux, and development on Linux systems.", "Experience working with big data and associated distributed processing tools (e.g., Spark) as well as cloud services (e.g., AWS, Azure)", "FIRST Robotics (For Inspiration and Recognition of Science and Technology)", "AWIM (A World In Motion)"]}, {"title": "Fall 2023 GPU Performance and AI Applications Co-op /Intern\n- job post", "reqs": ["Develop methods based on unsupervised learning, anomaly detection, and data visualization to parse important performance insights from GPGPU data returned from a range of different deep learning workloads.", "Develop analysis and algorithmic methods for insight delivery, and", "Incorporation of these capabilities within the framework of an internal performance profiling toolset currently being developed by the DC GPU Performance team.", "Collect profiling data describing GPU performance during ML workload execution", "Develop increasingly standardized and repeatable analysis methods to extract performance insights from this profiling data", "Work in a collaboration with developers to increase the scope of features and metrics accessible within profiling tools", "Incorporate analysis methods to make performance insights more accessible to users", "Strong background in python., scientific computing (statistics, ML, and data visualization), and a working understanding of collaborative software development practices and clean code.", "Communicate results, insights, and progress within the DC GPU Perf team, and (where applicable) relevant orgs within AMD", "Curiosity for performance analysis of computer systems and emergent data center technologies", "Knowledge of Linux operating systems. Comfort with terminal commands.", "Strong communications and time management skills", "Student enrolled in M.S. or Ph.D. degree in Computer Science or Computer Engineering", "Compensation Range from $29.00-$58.00 hourly - commensurate with experience.", "Healthcare coverage, dental and vision", "Paid holidays", "Relocation stipend", "Education assistance for required Co-op/Intern course"]}, {"title": "Machine Learning Computer Vision Co-op/Intern\n- job post", "reqs": ["Pursuing a master's degree in data science, Engineering, Computer Science or Mathematics with an interest in Machine Learning and Computer Vision.", "Python skills:", "Proficiency in Python programming, including OpenCV, Pillow, React, Streamlit, Gradio libraries", "Experience in manipulating video and image data", "Familiarity with accessing RTSP Streams (Real Time Video Streaming Protocol)", "Experience with API’s", "Experience with Linear Regression techniques using scikit-learn.", "MLOps skills:", "PyTorch (Yolov5/8), Keras or other ML frameworks", "Strong analytical abilities, interpreting model evaluation metrics to ensure optimal performance and accuracy", "Proficiency in Git version control system, specifically with Gitlow branching model", "Skilled at containerizing applications using Docker and managing containers. Kubernetes/Docker swarm mode a plus", "Experience with CI/CD pipelines and strong understanding of network concepts and security.", "Data Science skills:", "Data collection and preprocessing, exploratory data analysis, feature engineering, and modeling.", "Experience with modeling regressors using tabular data and other advanced modeling techniques.", "Self-starter with good organizational skills to be able to handle multiple activities. Has a high level of integrity to maintain safeguards on intellectual property.", "Good interpersonal and (verbal and written) communication skills to effectively interact within a diverse, fast-paced workforce environment."]}, {"title": "Intern - Computational Pathology and AI\n- job post", "reqs": ["CV/Resume", "Cover Letter"]}, {"title": "PhD Machine Learning Engineer Intern (Fall 2023)\n- job post", "reqs": ["Research and implement cutting-edge algorithms on revenue forecastings, especially improving early stage forecasting performance.", "Familiar with Time Series model, especially deep learning for Time Series.", "Python, Java", "Tensorflow and PyTorch", "AWS, GCP", "SQL, Tableau & Mode", "Must be currently enrolled in a PhD program in Statistics, Computer Science, Economics, or a related field with a graduation of Winter 2024 or later", "Located and available to work in our San Francisco Bay Area offices", "Available to work full-time for 3 months in Fall 2023", "A strong track record of performing machine learning model development using Python (numpy, tensorflow, pytorch, scikit-learn, etc.).", "Knowledge of modern techniques in machine learning and deep learning, e.g., time-series, neural network architectures, with an orientation to maximizing such algorithms in a large scale production setting", "The ability to clearly communicate complex results to technical and non-technical audiences", "Interns are not required to be physically located in their mentor’s worksite location for the duration of their internship", "Healthcare coverage (Medical, Vision and Dental insurance)", "Health Savings Account and Flexible Spending Account", "Retirement Plans including company match", "Employee Stock Purchase Program", "Wellness programs, including access to mental health, 1:1 financial planners, and a monthly wellness allowance", "Paid parental and caregiving leave", "Paid time off (including 12 paid holidays)", "Paid sick leave (1 hour per 26 hours worked (max 80 hours per calendar year to the extent legally permissible) for non-exempt employees and covered by our Flexible Time Off policy for exempt employees)", "Learning and Development resources", "Paid Life insurance, AD&D, and disability benefits", "Additional Perks such as WFH reimbursements and free access to caregiving, legal, and discounted resources"]}, {"title": "2023 Fall Intern - Machine Learning Research - Vision and Language Learning (6 months)\n- job post", "reqs": ["Interns put theory into practice.", "Interns will get unparalleled opportunities to kickstart their careers, pursue innovative ideas, collaborate, and network to advance their careers.", "Together with fellow doctoral candidates and some of the world’s best researchers, interns will drive exciting, ambiguous projects from end-to-end.", "During the internship, students are expected to collaborate with their mentors, other interns, and researchers to present findings and contribute to the vibrant life of the AI community at Genentech.", "Intensive 6 months, full time (40 hours per week) paid internship.", "Program start dates are in September, 2023.", "Ownership of challenging and impactful business-critical projects.", "Work with some of the most talented people in the biotechnology industry.", "Final presentations of project work to senior leaders.", "Lead or participate in intern committees to design and coordinate program events and initiatives.", "Professional & personal development curriculum throughout the program, including networking opportunities, workshops, and panel discussions.", "Participate in volunteer projects, social events, and team-building activities.", "Education: PhD Student (pursuing PhD, not completed).", "Preferred majors: Statistics, Computer Science, Electrical/Electronics Engineering, or any related STEM field.", "Actively conducting research in at least one of the following areas: vision and language learning, large language model, computer vision in pathology, or related topics.", "Must have at least two years of experience in conducting research, writing peer-reviewed publications, and software development.", "Strong coding skills in Python, Pytorch, or Tensorflow.", "Excellent communication, collaboration, and interpersonal skills.", "Complements our culture and the standards that guide our daily behavior & decisions: Integrity, Courage, and Passion.", "Ability to think unconventionally to derive creative and innovative solutions.", "Ability to collaborate effectively with your mentor and others in Genentech on research projects.", "Excellent interpersonal skills, cross-group, and cross-culture collaboration skills.", "Proven track record of achieving significant results as demonstrated by first-authored publications in high-impact journals or at top ML conferences (ICML, NeurIPS, ICLR, AISTATS, CVPR, ICCV, etc.)."]}, {"title": "Intern - MAGNet Program for Georgia Tech OMSA (Online MS Analytics) (Fall 2023)\n- job post", "reqs": ["Pricing and Underwriting Risk Predictive Modeling", "Claims Automation Predictive Modeling", "Sales/Growth Forecasting, Econometric and Predictive Modeling", "Data mining applications for Claims and Competitive Analysis", "Evaluating new statistical methods and tools for potential use by State Farm data scientists", "Students currently enrolled in Georgia Tech's Online Master of Science in Analytics Program (OMSA)", "Applicants with experience in:", "Statistical modeling and/or data mining", "Data analysis and database tools", "Computer programming (specifically Python, SAS, or R)", "Communicating and presenting technical work", "Logistics:", "During Fall Semester, MAGNet interns work 20 hours per week", "Duration: Fall Semester (8/16/2023 to 12/5/2023)", "HYBRID: Located in Downtown Athens, just a block off UGA's main campus", "Experience:", "Direct experience you can leverage for your future career", "An opportunity to learn and network with industry-leading influencers", "A learning environment: mentoring and development to help you succeed", "A culture that embraces Diversity and Inclusion", "401k retirement plan", "Medical, dental, and vision insurance", "Paid Time-Off, including specific leave for community service", "Statistics", "Mathematics", "Computer Science", "Epidemiology & Biostatistics", "Economics", "Statistics", "Mathematics", "Computer Science", "Epidemiology & Biostatistics", "Economics", "Statistical modeling and/or data mining", "Data analysis and database tools", "Computer programming (especially Python, R, or SAS)", "Communicating and presenting technical work"]}, {"title": "Statistical Programmer/Analyst intern (paid)(on-site)\n- job post", "reqs": ["Develop SAS programs to create ADaM datasets following CDISC standards with supervision", "Develop SAS programs to create SDTM datasets following CDISC standard with supervision.", "Develop, debug, maintain SAS programs and macros to create Tables, Listings and Graphs for Clinical Study Report with supervision.", "Develop SAS programmable edit checks to assist data monitoring, document and report issues to Supervisor.", "Perform other programming tasks as needed per Supervisor requests.", "Bachelor’s/Master’s degree in Statistics, Mathematics, Computer Science/Engineering, or related scientific disciplines required.", "Knowledge and training in high-level computing languages such as SAS, C/C++, Java, R, Python, MATLAB and SQL.", "SAS Base Certification is needed. Database programming experience is a plus.", "Detail oriented and ability to learn and adapt to changes.", "Good communications skills, both written and verbal and Good team player.", "Good working experience in Microsoft Office Suite, e.g., Word, Excel, PowerPoint, etc."]}, {"title": "(Onsite) Business Analyst Intern Part Time - Fall 2023\n- job post", "reqs": ["Develop consumer-segmentation models and appropriate product recommendations", "Analyze consumerism around Financial Centers based on web and mobile use versus in person locations", "Analyze call volumes to determine Net Promotor Scores", "Develop a model to assess acquisition predictions and forecasting", "Currently enrolled full-time at an accredited institution studying: Business Analytics, Data Science (or a closely related degree program)", "Must be classified as a Junior, having a strong GPA", "Must have understanding of Data Mining, Machine Learning, Predictive Analytics, Business Intelligence, and/or Data Management", "Must have strong technology and reporting experience", "Must have strong written and verbal communication skills", "Must have creative, analytical, and critical thinking skills", "The anticipated timeframe for this internship is September 11 - November 17, the selected candidate must be able to work in an office setting for the entire timeframe", "Veterans encouraged to apply"]}, {"title": "Doctorate Intern in Machine Learning and Reasoning\n- job post", "reqs": []}, {"title": "Research Intern (Machine Learning Sys-US) - 2023 Fall (PhD)\n- job post", "reqs": ["Research and develop key components of machine learning systems, including compiler, distributed frameworks, cluster scheduling, storage systems, etc.", "Optimize the implementation and deploy them in production systems.", "Currently pursuing a PhD degree in Software Development, Computer Science, Computer Engineering, or a related technical discipline.", "Familiar with machine learning algorithms and platforms", "Able to commit to working for 12 weeks during fall 2023", "Must obtain work authorization in country of employment at the time of hire, and maintain ongoing work authorization during employment.", "Published papers at top conferences", "Familiar with the C/C++ and Python development in Linux environments;", "Familiar with at least one deep learning framework (TensorFlow, PyTorch, MXNet, or other);", "Ability to work independently and complete projects from beginning to end and in a timely manner.", "Good communication and teamwork skills to clearly communicate technical concepts with other teammates.", "Graduating December 2023 onwards with intent to return to degree-program after the completion of the internship.", "Demonstrated software engineering experience from previous internship, work experience, coding competitions, or publications", "High levels of creativity and quick problem-solving capabilities"]}, {"title": "FALL INTERNSHIPS - Orolia Defense & Security\n- job post", "reqs": ["Electrical Engineering", "Computer Engineering", "Mathematics/Data Science", "Machine Learning", "Computer Science", "Mechanical Engineering", "Navigation Engineering"]}, {"title": "Intern - Air Quality / Google Earth Engine\n- job post", "reqs": ["Manage and upload geospatial data to Google Earth Engine (GEE)", "Develop codes, applications, and run machine learning model on Google Earth Engine", "Collaborate with users, scientists, systems engineers, and others to design and implement data processing scripts.", "Write technical documentation (for software, processes, and data).", "Testing and debugging data processing pipelines on GEE.", "Conduct technical presentations.", "Proficiency and familiarity with Google-Earth engine, GeoTIFF and netCDF4", "Proficiency in Python, Java script, and other programming languages.", "Data analysis, data cataloging and data ingestion.", "Back-end software development.", "Familiarity with Amazon Web Services", "Earth observation data.", "Excellent verbal and written communications skills.", "Willingness to work closely with others in a team environment."]}, {"title": "Data Scientist Intern\n- job post", "reqs": ["8 hour shift"]}, {"title": "Sales Enablement Intern\n- job post", "reqs": ["Work with stakeholders throughout the organization to identify opportunities for leveraging company data to drive business solutions.", "Partner with the US Commercial Operations team and sales teams to access key sales data to understand successful selling behavior around key initiatives.", "Mine and analyze data from company databases to drive optimization and improvement of sales enablement, training, and sales strategies.", "Assess the effectiveness and accuracy of new data sources and data gathering techniques.", "Responsibilities subject to change based on business needs.", "Must have a passion for data, love for a good spreadsheet and the ability to bring the data to life", "Strong communication skills", "Project and program management", "Time management", "Writing", "Listening", "Reporting", "Critical thinker", "Problem solver", "Strong networking and collaboration", "Ability to work autonomously and collaboratively", "Learning agility"]}, {"title": "Research Intern – AI-based Planning for Autonomous Systems\n- job post", "reqs": ["Conduct cutting-edge research and engineering projects in AI, deep learning and reinforcement learning algorithms to tackle challenges and uncertainties of predication and planning for autonomous systems.", "Work with an international team of experts to transfer the results of advanced research to Bosch business units. Benchmark, validate and test research ideas on simulated environments, large scale datasets, and self-driving vehicles.", "Summarize research findings in high-quality paper and/or patent submissions.", "Currently pursuing MS or PhD in Computer Science / Robotics / Systems Engineering or a related technical field, with research focus on robotic systems or autonomous driving applications.", "Hands-on experience in deep learning and/or AI system topics with focus on at least two of the following areas: reinforcement learning, imitation learning, vector/point-based input representations for learning, planning for navigation, behavior prediction, multi-agent training, uncertainty estimation, localization, and sensor fusion.", "Programming experience in C++, Python, and hands-on experience with libraries such as Tensorflow, PyTorch, OpenCV, etc.", "Publication record in top venues in robotics/machine learning/computer vision, e.g., ICRA, IROS, RSS, NeurIPS, ICML, ICLR, CVPR, ICCV, and ECCV.", "Project experience in the field of planning or prediction for automated driving", "Strong leadership skills with excellent English communication & teamwork skills.", "Background in methods for planning under uncertainty and risk-aware intelligent decision making in uncertain environments.", "Background in probabilistic robotics.", "Experience in writing algorithms in C++ efficiently and correctly in a production environment (code reviews, unit tests, etc.)", "Knowledge of Linux, and development on Linux systems.", "Experience working with big data and associated distributed processing tools (e.g., Spark) as well as cloud services (e.g., AWS, Azure)", "FIRST Robotics (For Inspiration and Recognition of Science and Technology)", "AWIM (A World In Motion)"]}, {"title": "Fall 2023 GPU Performance and AI Applications Co-op /Intern\n- job post", "reqs": ["Develop methods based on unsupervised learning, anomaly detection, and data visualization to parse important performance insights from GPGPU data returned from a range of different deep learning workloads.", "Develop analysis and algorithmic methods for insight delivery, and", "Incorporation of these capabilities within the framework of an internal performance profiling toolset currently being developed by the DC GPU Performance team.", "Collect profiling data describing GPU performance during ML workload execution", "Develop increasingly standardized and repeatable analysis methods to extract performance insights from this profiling data", "Work in a collaboration with developers to increase the scope of features and metrics accessible within profiling tools", "Incorporate analysis methods to make performance insights more accessible to users", "Strong background in python., scientific computing (statistics, ML, and data visualization), and a working understanding of collaborative software development practices and clean code.", "Communicate results, insights, and progress within the DC GPU Perf team, and (where applicable) relevant orgs within AMD", "Curiosity for performance analysis of computer systems and emergent data center technologies", "Knowledge of Linux operating systems. Comfort with terminal commands.", "Strong communications and time management skills", "Student enrolled in M.S. or Ph.D. degree in Computer Science or Computer Engineering", "Compensation Range from $29.00-$58.00 hourly - commensurate with experience.", "Healthcare coverage, dental and vision", "Paid holidays", "Relocation stipend", "Education assistance for required Co-op/Intern course"]}, {"title": "Machine Learning Computer Vision Co-op/Intern\n- job post", "reqs": ["Pursuing a master's degree in data science, Engineering, Computer Science or Mathematics with an interest in Machine Learning and Computer Vision.", "Python skills:", "Proficiency in Python programming, including OpenCV, Pillow, React, Streamlit, Gradio libraries", "Experience in manipulating video and image data", "Familiarity with accessing RTSP Streams (Real Time Video Streaming Protocol)", "Experience with API’s", "Experience with Linear Regression techniques using scikit-learn.", "MLOps skills:", "PyTorch (Yolov5/8), Keras or other ML frameworks", "Strong analytical abilities, interpreting model evaluation metrics to ensure optimal performance and accuracy", "Proficiency in Git version control system, specifically with Gitlow branching model", "Skilled at containerizing applications using Docker and managing containers. Kubernetes/Docker swarm mode a plus", "Experience with CI/CD pipelines and strong understanding of network concepts and security.", "Data Science skills:", "Data collection and preprocessing, exploratory data analysis, feature engineering, and modeling.", "Experience with modeling regressors using tabular data and other advanced modeling techniques.", "Self-starter with good organizational skills to be able to handle multiple activities. Has a high level of integrity to maintain safeguards on intellectual property.", "Good interpersonal and (verbal and written) communication skills to effectively interact within a diverse, fast-paced workforce environment."]}, {"title": "Intern - Computational Pathology and AI\n- job post", "reqs": ["CV/Resume", "Cover Letter"]}, {"title": "PhD Machine Learning Engineer Intern (Fall 2023)\n- job post", "reqs": ["Research and implement cutting-edge algorithms on revenue forecastings, especially improving early stage forecasting performance.", "Familiar with Time Series model, especially deep learning for Time Series.", "Python, Java", "Tensorflow and PyTorch", "AWS, GCP", "SQL, Tableau & Mode", "Must be currently enrolled in a PhD program in Statistics, Computer Science, Economics, or a related field with a graduation of Winter 2024 or later", "Located and available to work in our San Francisco Bay Area offices", "Available to work full-time for 3 months in Fall 2023", "A strong track record of performing machine learning model development using Python (numpy, tensorflow, pytorch, scikit-learn, etc.).", "Knowledge of modern techniques in machine learning and deep learning, e.g., time-series, neural network architectures, with an orientation to maximizing such algorithms in a large scale production setting", "The ability to clearly communicate complex results to technical and non-technical audiences", "Interns are not required to be physically located in their mentor’s worksite location for the duration of their internship", "Healthcare coverage (Medical, Vision and Dental insurance)", "Health Savings Account and Flexible Spending Account", "Retirement Plans including company match", "Employee Stock Purchase Program", "Wellness programs, including access to mental health, 1:1 financial planners, and a monthly wellness allowance", "Paid parental and caregiving leave", "Paid time off (including 12 paid holidays)", "Paid sick leave (1 hour per 26 hours worked (max 80 hours per calendar year to the extent legally permissible) for non-exempt employees and covered by our Flexible Time Off policy for exempt employees)", "Learning and Development resources", "Paid Life insurance, AD&D, and disability benefits", "Additional Perks such as WFH reimbursements and free access to caregiving, legal, and discounted resources"]}, {"title": "2023 Fall Intern - Machine Learning Research - Vision and Language Learning (6 months)\n- job post", "reqs": ["Interns put theory into practice.", "Interns will get unparalleled opportunities to kickstart their careers, pursue innovative ideas, collaborate, and network to advance their careers.", "Together with fellow doctoral candidates and some of the world’s best researchers, interns will drive exciting, ambiguous projects from end-to-end.", "During the internship, students are expected to collaborate with their mentors, other interns, and researchers to present findings and contribute to the vibrant life of the AI community at Genentech.", "Intensive 6 months, full time (40 hours per week) paid internship.", "Program start dates are in September, 2023.", "Ownership of challenging and impactful business-critical projects.", "Work with some of the most talented people in the biotechnology industry.", "Final presentations of project work to senior leaders.", "Lead or participate in intern committees to design and coordinate program events and initiatives.", "Professional & personal development curriculum throughout the program, including networking opportunities, workshops, and panel discussions.", "Participate in volunteer projects, social events, and team-building activities.", "Education: PhD Student (pursuing PhD, not completed).", "Preferred majors: Statistics, Computer Science, Electrical/Electronics Engineering, or any related STEM field.", "Actively conducting research in at least one of the following areas: vision and language learning, large language model, computer vision in pathology, or related topics.", "Must have at least two years of experience in conducting research, writing peer-reviewed publications, and software development.", "Strong coding skills in Python, Pytorch, or Tensorflow.", "Excellent communication, collaboration, and interpersonal skills.", "Complements our culture and the standards that guide our daily behavior & decisions: Integrity, Courage, and Passion.", "Ability to think unconventionally to derive creative and innovative solutions.", "Ability to collaborate effectively with your mentor and others in Genentech on research projects.", "Excellent interpersonal skills, cross-group, and cross-culture collaboration skills.", "Proven track record of achieving significant results as demonstrated by first-authored publications in high-impact journals or at top ML conferences (ICML, NeurIPS, ICLR, AISTATS, CVPR, ICCV, etc.)."]}, {"title": "Intern - MAGNet Program for Georgia Tech OMSA (Online MS Analytics) (Fall 2023)\n- job post", "reqs": ["Pricing and Underwriting Risk Predictive Modeling", "Claims Automation Predictive Modeling", "Sales/Growth Forecasting, Econometric and Predictive Modeling", "Data mining applications for Claims and Competitive Analysis", "Evaluating new statistical methods and tools for potential use by State Farm data scientists", "Students currently enrolled in Georgia Tech's Online Master of Science in Analytics Program (OMSA)", "Applicants with experience in:", "Statistical modeling and/or data mining", "Data analysis and database tools", "Computer programming (specifically Python, SAS, or R)", "Communicating and presenting technical work", "Logistics:", "During Fall Semester, MAGNet interns work 20 hours per week", "Duration: Fall Semester (8/16/2023 to 12/5/2023)", "HYBRID: Located in Downtown Athens, just a block off UGA's main campus", "Experience:", "Direct experience you can leverage for your future career", "An opportunity to learn and network with industry-leading influencers", "A learning environment: mentoring and development to help you succeed", "A culture that embraces Diversity and Inclusion", "401k retirement plan", "Medical, dental, and vision insurance", "Paid Time-Off, including specific leave for community service", "Statistics", "Mathematics", "Computer Science", "Epidemiology & Biostatistics", "Economics", "Statistics", "Mathematics", "Computer Science", "Epidemiology & Biostatistics", "Economics", "Statistical modeling and/or data mining", "Data analysis and database tools", "Computer programming (especially Python, R, or SAS)", "Communicating and presenting technical work"]}, {"title": "Statistical Programmer/Analyst intern (paid)(on-site)\n- job post", "reqs": ["Develop SAS programs to create ADaM datasets following CDISC standards with supervision", "Develop SAS programs to create SDTM datasets following CDISC standard with supervision.", "Develop, debug, maintain SAS programs and macros to create Tables, Listings and Graphs for Clinical Study Report with supervision.", "Develop SAS programmable edit checks to assist data monitoring, document and report issues to Supervisor.", "Perform other programming tasks as needed per Supervisor requests.", "Bachelor’s/Master’s degree in Statistics, Mathematics, Computer Science/Engineering, or related scientific disciplines required.", "Knowledge and training in high-level computing languages such as SAS, C/C++, Java, R, Python, MATLAB and SQL.", "SAS Base Certification is needed. Database programming experience is a plus.", "Detail oriented and ability to learn and adapt to changes.", "Good communications skills, both written and verbal and Good team player.", "Good working experience in Microsoft Office Suite, e.g., Word, Excel, PowerPoint, etc."]}, {"title": "(Onsite) Business Analyst Intern Part Time - Fall 2023\n- job post", "reqs": ["Develop consumer-segmentation models and appropriate product recommendations", "Analyze consumerism around Financial Centers based on web and mobile use versus in person locations", "Analyze call volumes to determine Net Promotor Scores", "Develop a model to assess acquisition predictions and forecasting", "Currently enrolled full-time at an accredited institution studying: Business Analytics, Data Science (or a closely related degree program)", "Must be classified as a Junior, having a strong GPA", "Must have understanding of Data Mining, Machine Learning, Predictive Analytics, Business Intelligence, and/or Data Management", "Must have strong technology and reporting experience", "Must have strong written and verbal communication skills", "Must have creative, analytical, and critical thinking skills", "The anticipated timeframe for this internship is September 11 - November 17, the selected candidate must be able to work in an office setting for the entire timeframe", "Veterans encouraged to apply"]}, {"title": "Doctorate Intern in Machine Learning and Reasoning\n- job post", "reqs": []}, {"title": "Energy Analyst Intern\n- job post", "reqs": ["We work on a wide range of projects within sustainability across the globe.", "We have a diverse team (we come from 8 different nationalities, and we speak 15 languages)", "We care about sustainability and want to create a positive impact.", "Construct models to predict the hourly energy consumption of buildings", "Develop different optimization levels to provide real-time management capabilities", "Improve our optimization algorithm to consider resiliency, electric vehicles, and available ancillary services of the grid", "Deploy our algorithm on the cloud to provide an \"As a Service\" solution", "A Bachelor's degree in Data Science, Electrical Engineering, Physics, Operation Research, Industrial Engineering, or equivalent.", "A Master's degree or current enrollment in a higher education program is a plus. Outstanding Bachelor's students in their final year will also be considered.", "Proficiency in Python.", "Familiar with continuous optimization methods (linear programming) and constraint optimization.", "Experience in renewable energy technologies (photovoltaics, wind, distributed generation), the energy industry, and/or microgrid development is a plus.", "Experience with statistical methods and machine learning algorithms. Familiarity with time series analysis is a plus."]}, {"title": "Data Science Intern\n- job post", "reqs": []}, {"title": "PhD Intern, AI Software Engineer\n- job post", "reqs": []}, {"title": "COOPERATIVE EDUCATION STUDENT – PROCUREMENT / SUPPLY MANAGEMENT\n- job post", "reqs": ["General knowledge of office procedures", "Proficiency with Microsoft Office applications", "Effective verbal/nonverbal, listening and written communications", "Interpersonal", "Detail Oriented", "Planning", "Organization", "Time Management", "Reviews/analyzes freight bills and provides payment recommendation to Materials Analyst(s).", "Resolve discrepancies on inventory Purchase Orders with vendors.", "Creates change requests as required.", "Develops and maintains Materials Management nomenclature standard in Word for all spare part descriptions and the revisions to associated descriptions.", "Assists in reconciling issues with vendors on blanket purchase orders such as pricing errors, quantity changes obsoleted parts and replacement MPN’s (Manufacturer Part Numbers).", "Assists the Materials Management section in the inventory control program including forecasting inventory levels, detailed item analysis to review usage and analyze & recommend minimum/maximum inventory levels and reorder point levels.", "Performs return to stock analysis to determine need to cancel requisitions and/or purchases. Maintains cost avoidance figures for cancellations.", "Assists in the Investment Recovery program as required. Performs sales/marketing of surplus corporate assets.", "Runs queries or report programs as required to analyze the work and asset management database", "Assists with filing, copying, creation of spreadsheets and special projects as needed.", "Performs various data entry into automated work and asset management software as instructed.", "Assists in testing upgrades and enhancements to the work and asset management software.", "Performs various other analyses, studies, or projects as directed.", "Performs other duties as applicable to the position or as assigned."]}, {"title": "Statistical Intern\n- job post", "reqs": []}, {"title": "Student Internship in \"Emergent Materials Enabled by Nanoscience, Synthetic Biology, and Machine Learning\" at DEVCOM-SC\n- job post", "reqs": ["Health Insurance Supplement (Participants are eligible to purchase health insurance through ORISE)", "Relocation Allowance", "Training and Travel Allowance", "Zintellect Profile", "Educational and Employment History", "Essay Questions (goals, experiences, and skills relevant to the opportunity)", "Resume (PDF)", "Transcripts/Academic Records - Please upload a copy of a transcript for your current or most recent degree program that meets the disciplinary qualifications of the opportunity.", "One Recommendation. Your application will be considered incomplete and will not be reviewed until one recommendation is submitted. We encourage you to contact your recommender as soon as you start your application to ensure they are able to complete the recommendation form and to let them know to expect a message from Zintellect. Recommenders will be asked to rate your scientific capabilities, personal characteristics, and describe how they know you. You can always log back in to your Zintellect account and check the status of your application.", "Citizenship: U.S. Citizen Only", "Degree: Associate's Degree, Bachelor's Degree, or Master's Degree received within the last 12 months or currently pursuing.", "Discipline(s):\nCommunications and Graphics Design\nComputer, Information, and Data Sciences\nEarth and Geosciences\nEngineering\nEnvironmental and Marine Sciences\nLife Health and Medical Sciences\nMathematics and Statistics\nOther Physical Sciences\nOther S&E-Related\nPhysics\nSocial and Behavioral Sciences", "Communications and Graphics Design", "Computer, Information, and Data Sciences", "Earth and Geosciences", "Engineering", "Environmental and Marine Sciences", "Life Health and Medical Sciences", "Mathematics and Statistics", "Other Physical Sciences", "Other S&E-Related", "Physics", "Social and Behavioral Sciences", "Communications and Graphics Design", "Computer, Information, and Data Sciences", "Earth and Geosciences", "Engineering", "Environmental and Marine Sciences", "Life Health and Medical Sciences", "Mathematics and Statistics", "Other Physical Sciences", "Other S&E-Related", "Physics", "Social and Behavioral Sciences"]}, {"title": "Data Science Intern\n- job post", "reqs": ["Bachelor's degree from an accredited college or university.", "Experience in Design, development, testing, implementing and maintaining packages, procedures and functions", "Experience in writing complex SQL queries", "Working knowledge of Toad", "Good debugging and troubleshooting skills", "Ability to perform in-depth data analysis of production issues", "Respond to support requests in a timely and accurate manner", "Responsible for preparing design documentation & unit testing documentation", "Should have very good communication skills/interpersonal skills", "Understanding of business processes and constraints", "Ability to work in a team environment", "Major in information systems or computer science preferred.", "Education in interpreting user requirements, business applications design and development of business applications strongly preferred.", "Memphis, TN: Reliably commute or planning to relocate before starting work (Required)", "Python: 1 year (Required)", "SQL: 1 year (Required)"]}, {"title": "Machine Learning Intern\n- job post", "reqs": ["Bachelor's degree from an accredited college or university.", "Experience in Design, development, testing, implementing and maintaining packages, procedures and functions", "Experience in writing complex SQL queries", "Working knowledge of Toad", "Good debugging and troubleshooting skills", "Ability to perform in-depth data analysis of production issues", "Respond to support requests in a timely and accurate manner", "Responsible for preparing design documentation & unit testing documentation", "Should have very good communication skills/interpersonal skills", "Understanding of business processes and constraints", "Ability to work in a team environment", "Major in information systems or computer science preferred.", "Education in interpreting user requirements, business applications design and development of business applications strongly preferred.", "Memphis, TN: Reliably commute or planning to relocate before starting work (Required)", "Python: 1 year (Required)", "SQL: 1 year (Required)"]}, {"title": "Data Scientist Intern\n- job post", "reqs": ["8 hour shift"]}, {"title": "Energy Analyst Intern\n- job post", "reqs": ["We work on a wide range of projects within sustainability across the globe.", "We have a diverse team (we come from 8 different nationalities, and we speak 15 languages)", "We care about sustainability and want to create a positive impact.", "Construct models to predict the hourly energy consumption of buildings", "Develop different optimization levels to provide real-time management capabilities", "Improve our optimization algorithm to consider resiliency, electric vehicles, and available ancillary services of the grid", "Deploy our algorithm on the cloud to provide an \"As a Service\" solution", "A Bachelor's degree in Data Science, Electrical Engineering, Physics, Operation Research, Industrial Engineering, or equivalent.", "A Master's degree or current enrollment in a higher education program is a plus. Outstanding Bachelor's students in their final year will also be considered.", "Proficiency in Python.", "Familiar with continuous optimization methods (linear programming) and constraint optimization.", "Experience in renewable energy technologies (photovoltaics, wind, distributed generation), the energy industry, and/or microgrid development is a plus.", "Experience with statistical methods and machine learning algorithms. Familiarity with time series analysis is a plus."]}, {"title": "Data Science Intern\n- job post", "reqs": []}, {"title": "PhD Intern, AI Software Engineer\n- job post", "reqs": []}, {"title": "COOPERATIVE EDUCATION STUDENT – PROCUREMENT / SUPPLY MANAGEMENT\n- job post", "reqs": ["General knowledge of office procedures", "Proficiency with Microsoft Office applications", "Effective verbal/nonverbal, listening and written communications", "Interpersonal", "Detail Oriented", "Planning", "Organization", "Time Management", "Reviews/analyzes freight bills and provides payment recommendation to Materials Analyst(s).", "Resolve discrepancies on inventory Purchase Orders with vendors.", "Creates change requests as required.", "Develops and maintains Materials Management nomenclature standard in Word for all spare part descriptions and the revisions to associated descriptions.", "Assists in reconciling issues with vendors on blanket purchase orders such as pricing errors, quantity changes obsoleted parts and replacement MPN’s (Manufacturer Part Numbers).", "Assists the Materials Management section in the inventory control program including forecasting inventory levels, detailed item analysis to review usage and analyze & recommend minimum/maximum inventory levels and reorder point levels.", "Performs return to stock analysis to determine need to cancel requisitions and/or purchases. Maintains cost avoidance figures for cancellations.", "Assists in the Investment Recovery program as required. Performs sales/marketing of surplus corporate assets.", "Runs queries or report programs as required to analyze the work and asset management database", "Assists with filing, copying, creation of spreadsheets and special projects as needed.", "Performs various data entry into automated work and asset management software as instructed.", "Assists in testing upgrades and enhancements to the work and asset management software.", "Performs various other analyses, studies, or projects as directed.", "Performs other duties as applicable to the position or as assigned."]}, {"title": "Statistical Intern\n- job post", "reqs": []}, {"title": "Student Internship in \"Emergent Materials Enabled by Nanoscience, Synthetic Biology, and Machine Learning\" at DEVCOM-SC\n- job post", "reqs": ["Health Insurance Supplement (Participants are eligible to purchase health insurance through ORISE)", "Relocation Allowance", "Training and Travel Allowance", "Zintellect Profile", "Educational and Employment History", "Essay Questions (goals, experiences, and skills relevant to the opportunity)", "Resume (PDF)", "Transcripts/Academic Records - Please upload a copy of a transcript for your current or most recent degree program that meets the disciplinary qualifications of the opportunity.", "One Recommendation. Your application will be considered incomplete and will not be reviewed until one recommendation is submitted. We encourage you to contact your recommender as soon as you start your application to ensure they are able to complete the recommendation form and to let them know to expect a message from Zintellect. Recommenders will be asked to rate your scientific capabilities, personal characteristics, and describe how they know you. You can always log back in to your Zintellect account and check the status of your application.", "Citizenship: U.S. Citizen Only", "Degree: Associate's Degree, Bachelor's Degree, or Master's Degree received within the last 12 months or currently pursuing.", "Discipline(s):\nCommunications and Graphics Design\nComputer, Information, and Data Sciences\nEarth and Geosciences\nEngineering\nEnvironmental and Marine Sciences\nLife Health and Medical Sciences\nMathematics and Statistics\nOther Physical Sciences\nOther S&E-Related\nPhysics\nSocial and Behavioral Sciences", "Communications and Graphics Design", "Computer, Information, and Data Sciences", "Earth and Geosciences", "Engineering", "Environmental and Marine Sciences", "Life Health and Medical Sciences", "Mathematics and Statistics", "Other Physical Sciences", "Other S&E-Related", "Physics", "Social and Behavioral Sciences", "Communications and Graphics Design", "Computer, Information, and Data Sciences", "Earth and Geosciences", "Engineering", "Environmental and Marine Sciences", "Life Health and Medical Sciences", "Mathematics and Statistics", "Other Physical Sciences", "Other S&E-Related", "Physics", "Social and Behavioral Sciences"]}, {"title": "Data Science Intern\n- job post", "reqs": ["Bachelor's degree from an accredited college or university.", "Experience in Design, development, testing, implementing and maintaining packages, procedures and functions", "Experience in writing complex SQL queries", "Working knowledge of Toad", "Good debugging and troubleshooting skills", "Ability to perform in-depth data analysis of production issues", "Respond to support requests in a timely and accurate manner", "Responsible for preparing design documentation & unit testing documentation", "Should have very good communication skills/interpersonal skills", "Understanding of business processes and constraints", "Ability to work in a team environment", "Major in information systems or computer science preferred.", "Education in interpreting user requirements, business applications design and development of business applications strongly preferred.", "Memphis, TN: Reliably commute or planning to relocate before starting work (Required)", "Python: 1 year (Required)", "SQL: 1 year (Required)"]}, {"title": "Machine Learning Intern\n- job post", "reqs": ["Bachelor's degree from an accredited college or university.", "Experience in Design, development, testing, implementing and maintaining packages, procedures and functions", "Experience in writing complex SQL queries", "Working knowledge of Toad", "Good debugging and troubleshooting skills", "Ability to perform in-depth data analysis of production issues", "Respond to support requests in a timely and accurate manner", "Responsible for preparing design documentation & unit testing documentation", "Should have very good communication skills/interpersonal skills", "Understanding of business processes and constraints", "Ability to work in a team environment", "Major in information systems or computer science preferred.", "Education in interpreting user requirements, business applications design and development of business applications strongly preferred.", "Memphis, TN: Reliably commute or planning to relocate before starting work (Required)", "Python: 1 year (Required)", "SQL: 1 year (Required)"]}, {"title": "Data Scientist Intern\n- job post", "reqs": ["8 hour shift"]}, {"title": "Energy Analyst Intern\n- job post", "reqs": ["We work on a wide range of projects within sustainability across the globe.", "We have a diverse team (we come from 8 different nationalities, and we speak 15 languages)", "We care about sustainability and want to create a positive impact.", "Construct models to predict the hourly energy consumption of buildings", "Develop different optimization levels to provide real-time management capabilities", "Improve our optimization algorithm to consider resiliency, electric vehicles, and available ancillary services of the grid", "Deploy our algorithm on the cloud to provide an \"As a Service\" solution", "A Bachelor's degree in Data Science, Electrical Engineering, Physics, Operation Research, Industrial Engineering, or equivalent.", "A Master's degree or current enrollment in a higher education program is a plus. Outstanding Bachelor's students in their final year will also be considered.", "Proficiency in Python.", "Familiar with continuous optimization methods (linear programming) and constraint optimization.", "Experience in renewable energy technologies (photovoltaics, wind, distributed generation), the energy industry, and/or microgrid development is a plus.", "Experience with statistical methods and machine learning algorithms. Familiarity with time series analysis is a plus."]}, {"title": "Data Science Intern\n- job post", "reqs": []}, {"title": "PhD Intern, AI Software Engineer\n- job post", "reqs": []}, {"title": "COOPERATIVE EDUCATION STUDENT – PROCUREMENT / SUPPLY MANAGEMENT\n- job post", "reqs": ["General knowledge of office procedures", "Proficiency with Microsoft Office applications", "Effective verbal/nonverbal, listening and written communications", "Interpersonal", "Detail Oriented", "Planning", "Organization", "Time Management", "Reviews/analyzes freight bills and provides payment recommendation to Materials Analyst(s).", "Resolve discrepancies on inventory Purchase Orders with vendors.", "Creates change requests as required.", "Develops and maintains Materials Management nomenclature standard in Word for all spare part descriptions and the revisions to associated descriptions.", "Assists in reconciling issues with vendors on blanket purchase orders such as pricing errors, quantity changes obsoleted parts and replacement MPN’s (Manufacturer Part Numbers).", "Assists the Materials Management section in the inventory control program including forecasting inventory levels, detailed item analysis to review usage and analyze & recommend minimum/maximum inventory levels and reorder point levels.", "Performs return to stock analysis to determine need to cancel requisitions and/or purchases. Maintains cost avoidance figures for cancellations.", "Assists in the Investment Recovery program as required. Performs sales/marketing of surplus corporate assets.", "Runs queries or report programs as required to analyze the work and asset management database", "Assists with filing, copying, creation of spreadsheets and special projects as needed.", "Performs various data entry into automated work and asset management software as instructed.", "Assists in testing upgrades and enhancements to the work and asset management software.", "Performs various other analyses, studies, or projects as directed.", "Performs other duties as applicable to the position or as assigned."]}]