[{"title": "2024 Intern - Data Science, Machine Learning Growth\n- job post", "reqs": ["Applies AI and machine learning to address exciting business problems. Participating in all aspects of data science activities, including ETL and data engineering, exploratory data analyses, data validation, data modeling, visualization, machine learning, model deployment and documentation.", "Extract and analyze data to understand the customer product life cycle and value realization from the product.", "Develop reliable, robust, and maintainable data models.", "Work both independently and collaboratively within a fast-paced development team with clear, positive, and constructive communication.", "Collaborate with team members and participate in daily or weekly stand-ups and meetings.", "Currently enrolled full-time and pursuing a Master’s or Bachelor's in Statistics, Mathematics, Data Science or Engineering is desired; or equivalent experience required.", "Solid understanding of SQL and R/Python", "Understanding of statistical modeling/machine learning/ data mining concepts, and a track record solving problems with these methods.", "Ability to apply statistical/machine learning techniques such as hypothesis testing, time series forecasting, linear and logistic regression, random forests, etc.", "Ability to participate in a full-time internship between May-September"], "link": "https://www.indeed.com/jobs?q=data+science+internship&start=110&pp=gQClAAABiS3ZE3IAAAACCW0yDAAZAQATGktWR-z-gBIl3tZnH8Uv--FtKRLxTAAA&vjk=7c4917bad749a2cd"}, {"title": "2024 Intern - Data Science, Machine Learning Growth\n- job post", "reqs": ["Applies AI and machine learning to address exciting business problems. Participating in all aspects of data science activities, including ETL and data engineering, exploratory data analyses, data validation, data modeling, visualization, machine learning, model deployment and documentation.", "Extract and analyze data to understand the customer product life cycle and value realization from the product.", "Develop reliable, robust, and maintainable data models.", "Work both independently and collaboratively within a fast-paced development team with clear, positive, and constructive communication.", "Collaborate with team members and participate in daily or weekly stand-ups and meetings.", "Currently enrolled full-time and pursuing a Master’s or Bachelor's in Statistics, Mathematics, Data Science or Engineering is desired; or equivalent experience required.", "Solid understanding of SQL and R/Python", "Understanding of statistical modeling/machine learning/ data mining concepts, and a track record solving problems with these methods.", "Ability to apply statistical/machine learning techniques such as hypothesis testing, time series forecasting, linear and logistic regression, random forests, etc.", "Ability to participate in a full-time internship between May-September"], "link": "https://www.indeed.com/jobs?q=data+science+internship&start=110&pp=gQClAAABiS3ZE3IAAAACCW0yDAAZAQATGktWR-z-gBIl3tZnH8Uv--FtKRLxTAAA&vjk=7c4917bad749a2cd"}, {"title": "Data Science Summer Institute Graduate Student Internship\n- job post", "reqs": [], "link": "https://www.indeed.com/jobs?q=data+science+internship&start=110&pp=gQClAAABiS3ZE3IAAAACCW0yDAAZAQATGktWR-z-gBIl3tZnH8Uv--FtKRLxTAAA&vjk=ec46fc9bc4178793"}, {"title": "2024 Machine Learning Engineer Summer Intern\n- job post", "reqs": ["Guidewire is offering a 3-month internship in the Guidewire Analytics team. The internship is designed to give an opportunity to work in a real-world business environment, and to take responsibility for a specific data project that has the potential to provide real value to our customers.", "Our teams tackle a wide variety of interesting problems in the Property & Casualty insurance industry. On this team you will be exposed to a wide variety of problems and projects including the following:", "Explore ways to enhance our data science on modeling processes by exploring novel techniques the creation of models that help with our classification and computational problems", "Expand our internet-scale data listening capabilities by implementing new data sources or extending core API functionality", "Contribute to our efforts to build out our MLOps capabilities and enhance our ability to accelerate ML development and deliver reproducible, testable, and rapidly evolving capabilities to customers", "You will be mentored by experienced data scientists and modelers and exposed to advanced ML techniques and approaches. You will have the opportunity to learn more about the exciting world of Cybersecurity and Cyber Risk quantification. You will be writing Python code, wrangling data from a range of sources and building models.", "Currently pursuing (or just finished) bachelor's or master's (graduating in 2024-2025) studies in a Computer Science, Engineering, Mathematics, or related field.", "Python coding, in particular, data manipulation", "Ability to work independently on a project and as part of a team.", "Define, model, and solve real-world, ambitious, insurance problems using various data-driven approaches", "Design and implement tools and frameworks to be used across various machine learning and data science teams", "A strong desire to help build components of our Machine Learning platform that will be used by internal and external Guidewire customers.", "Operational knowledge of Git, Docker, Linux.Strong understanding of various Transformer model architectures (decoder only, Encoder-Decoder, Encoder Only).", "Ability to discuss trade-offs and perform independent research", "Knowledge of Amazon AWS services such as EC2, EMR, S3, SageMaker, EKS.", "Curiosity based on genuine love of technology and analytics", "Accountability based on an earnest desire to do what is expected without prompting", "Kindness and respect for your fellow teammates"], "link": "https://www.indeed.com/jobs?q=data+science+internship&start=110&pp=gQClAAABiS3ZE3IAAAACCW0yDAAZAQATGktWR-z-gBIl3tZnH8Uv--FtKRLxTAAA&vjk=3a25d175aa925a9a"}, {"title": "2024 Data Science Graduate Intern\n- job post", "reqs": ["Take ownership and provide leadership of a small technical project with manager oversight", "Analysis of Large Language Models (LLMs) (for example, ChatGPT) and identifying best approaches for Government teams to effectively implement them as a tool to analyze data", "Synthesize industry/academic research and roadmaps related to AI technology development and provide recommendations", "Analysis of modern data management and storage solutions for AI/ML and Geospatial Intelligence (GEOINT) data", "Analysis on automating manual workflows", "Proactively identify new technologies and commercially available capabilities that can be rapidly deployed in mission environments", "Collaborate with a team of technical professionals", "Collaborate with other interns and Aerospace team members", "Strong written and oral communication skills", "Must work well in a team environment", "Possess organizational, time management and project management skills", "Demonstrate flexibility and ability to adapt to changing organizational need", "Interpersonal skills to coordinate efforts and work with other internal and external organizations", "Currently enrolled fulltime in an accredited college/university program pursuing a Master's/PhD degree in Computer Science, Computer Information Systems, Electrical or Computer Engineering, Physics, Mathematics or related discipline.", "Availability to work full-time for a minimum of 10 weeks outside of university term and ability to return to a degree program full-time after completion of the internship.", "Minimum GPA of 3.0", "Experience in one of more of the following domains: Machine Learning, Artificial Intelligence, data management, geospatial intelligence (GEOINT) architectures, systems engineering, or software development", "Experience creating and briefing a presentation to provide status and analysis of results", "Strong written and oral communication skills", "This position requires the ability to obtain and maintain a U.S. Government security clearance. U.S. citizenship is required to obtain a security clearance. (US Citizenship required)", "Transcripts required", "GPA of 3.5 or higher", "Active security clearance", "Advanced degree in imaging science, computer science/engineering, systems engineering, electrical engineering, or a related engineering or scientific field", "Demonstrated ability to lead a small project", "Comprehensive health care and wellness plans", "Paid holidays, sick time, and vacation", "Standard and alternate work schedules, including telework options", "401(k) Plan — Employees receive a total company-paid benefit of 8%, 10%, or 12% of eligible compensation based on years of service and matching contributions; employees are immediately eligible and vested in the plan upon hire", "Flexible spending accounts", "Variable pay program for exceptional contributions", "Relocation assistance", "Professional growth and development programs to help advance your career", "Education assistance programs", "An inclusive work environment built on teamwork, flexibility, and respect"], "link": "https://www.indeed.com/jobs?q=data+science+internship&start=110&pp=gQClAAABiS3ZE3IAAAACCW0yDAAZAQATGktWR-z-gBIl3tZnH8Uv--FtKRLxTAAA&vjk=600a77eb1e855215"}, {"title": "PowerBI Intern\n- job post", "reqs": ["Collaborate with the data team to develop Power BI reports and dashboards", "Collect, analyze, and interpret large and complex data sets", "Create visually appealing and insightful data-driven visualizations", "Collaborate with internal stakeholders to identify data needs and provide insights", "Develop and maintain documentation on analytical methodologies and data sources", "Participate in meetings and communications with internal stakeholders", "Continuously learn and explore new techniques and technologies in the business intelligence industry", "Currently pursuing a degree in Computer Science, Computer Engineering, Data Science, Analytics, or a related field", "Familiarity with data analytics, database management, and data visualization techniques", "Working knowledge of Power BI or other business intelligence tools", "Strong analytical and problem-solving skills", "Ability to effectively communicate complex ideas to both technical and non-technical audiences", "Strong attention to detail and ability to work independently"], "link": "https://www.indeed.com/jobs?q=data+science+internship&start=110&pp=gQClAAABiS3ZE3IAAAACCW0yDAAZAQATGktWR-z-gBIl3tZnH8Uv--FtKRLxTAAA&vjk=6c2ba66f5603ccdc"}, {"title": "Intern\n- job post", "reqs": ["Enrolled in graduate degree program in Electrical or Mechanical Engineering, Computer Engineering, Computer Science & Engineering, Data Science, Statistics OR Mathematics - Preferred", "If in undergraduate degree program - must be a Junior or Senior level.", "Strong knowledge in MATLAB OR Python OR C++ programming.", "Some hands on exposure to machine learning, and signals at least at the classroom or project level.", "Signal processing experience is a plus", "Experience in large data sets and video a plus.", "Candidate must be available at least 20 hours / week during semester internships and full time (~40hrs/wk) during summer or winter work terms.", "100% Onsite work required for this position."], "link": "https://www.indeed.com/jobs?q=data+science+internship&start=110&pp=gQClAAABiS3ZE3IAAAACCW0yDAAZAQATGktWR-z-gBIl3tZnH8Uv--FtKRLxTAAA&vjk=43474bd8dfa4ba96"}, {"title": "Research Scientist Intern (Data-Data Platform-Data Architecture-US) - 2024 Summer (PhD)\n- job post", "reqs": ["Design and develop kernel modules or core features for cloud-native distributed analytical database systems.", "Conduct research for cutting-edge technology evolvement in database and data management area and identify the potential future directions.", "Solve unique and complex problems on large-scale, high-performance cloud infrastructure.", "Partner with different teams on building backend support for cloud native database service.", "Currently pursuing a PhD in Computer Science, related STEM or quantitative field.", "Able to commit to working for 12 weeks during Summer or Fall 2024", "Experience with at least one system programming language: C++, Java, Rust etc.", "Must obtain work authorization in country of employment at the time of hire, and maintain ongoing work authorization during employment.", "Graduating December 2024 onwards with intent to return to degree-program after the completion of the internship.", "Demonstrated software engineering or data processing experience from previous internship, work experience, coding competitions, or publications.", "Research or deep working experience in databases and data management systems is preferred, including but not limited to database kernel, query processing, query optimization, storage system, hardware acceleration, cloud native infrastructure, etc.", "Experience with open-source and industry databases and data management systems is a plus.", "High levels of creativity and quick problem-solving capabilities."], "link": "https://www.indeed.com/jobs?q=data+science+internship&start=110&pp=gQClAAABiS3ZE3IAAAACCW0yDAAZAQATGktWR-z-gBIl3tZnH8Uv--FtKRLxTAAA&vjk=99bfc9ec605f3d03"}, {"title": "Data Scientist (Master's Degree) Internship\n- job post", "reqs": ["We are looking for leaders who are pursuing a Master's in Statistics, Applied Mathematics, Economics, Computer Science,", "Data Science, Business Analytics, Operation Research, Software Development, or a similar quantitative field.", "You must be available during the Summer of 2024 between Mid/ Late May through early August", "Demonstrated leadership in applying and scaling Analytic techniques to deliver measurable insights from data", "Strong written and verbal communication skills to influence others to take action", "Demonstrable ability to handle multiple priorities", "Comfort working with diverse business scenarios and possessing strong thinking/problem-solving skills to business processes with a \"can-do\" attitude", "Strong passion and curiosity about the intersection of business and technology", "Preferred Experience with Analytical Tools/Applications:", "Unix/Linux", "Big Data Ecosystem: Hadoop, Spark, MapReduce, SQL, Hiv", "Scientific Computing: R, Python, C++, Java, Scala,", "High-Performance Parallel and Distributing Computing", "Deep Learning frameworks: Keras, Tensorflow", "Data Visualization", "Data Management Systems", "Business Intelligence tools: such as KNIME, Tableau"], "link": "https://www.indeed.com/jobs?q=data+science+internship&start=110&pp=gQClAAABiS3ZE3IAAAACCW0yDAAZAQATGktWR-z-gBIl3tZnH8Uv--FtKRLxTAAA&vjk=7aad64b60da8dcc0"}, {"title": "Presidential Management Associate Summer 2024 Internship Program (All Tracks)\n- job post", "reqs": ["Marketing", "Online", "Human Resources", "Global Supply Chain", "Data Analytics", "North America Consumer Engagement, Clinique", "Global Product Marketing, La Mer", "Global Consumer Insights, MAC Cosmetics", "North America E-commerce, Bobbi Brown", "Omnichannel", "Online Customer Acquisition and Retention", "Human Resources Business Partner, Clinique", "Global Talent Acquisition", "Enterprise Learning", "Sustainable Sourcing", "Indirect Procurement", "Global Brand Supply Chain, Clinique", "Global Business Analytics & Intelligence", "Data Science", "User Experience", "Challenging and engaging experiences within critical business functions, working under the guidance and sponsorship of a key executive, while contributing as a functioning member of a team", "A suite of activities ranging from senior management presentations to professional development programs", "Corporate business overview with William P. Lauder, Executive Chairman, or Fabrizio Freda, President and Chief Executive Officer", "Program leaders committed to the development of each summer intern—as a member of this program, you will develop the skills and experience needed to accelerate your career", "First year MBA student", "Minimum of 5-8 years of full-time work experience between undergraduate and graduate studies with a demonstrated record of achievement", "Strong interpersonal skills and the ability to lead, motivate and influence others", "Robust project management skills, flexibility, business acumen and executive presence", "Please note the Presidential Management Program does not offer sponsorship", "We require US work authorization, without restriction, for all PMA candidates"], "link": "https://www.indeed.com/jobs?q=data+science+internship&start=110&pp=gQClAAABiS3ZE3IAAAACCW0yDAAZAQATGktWR-z-gBIl3tZnH8Uv--FtKRLxTAAA&vjk=8a679dc95397d9cd"}, {"title": "Data Science Intern\n- job post", "reqs": ["80% Solution Development - Design and develop algorithms and models to use against large datasets to create business insights; Use predictive modeling to increase and optimize customer experiences and revenue.", "20% Communicating Results - Effectively communicate insights and recommendations to both technical and non-technical leaders and business customers/partners; Present recommendations in a confident manner in order to influence execution of recommendation.", "Masters in a quantitative field (Computer Science, Math, Statistics, etc.) is strongly preferred.", "2+ years of experience in computer science or data science modeling", "Knowledgeable in Prescriptive Modeling like Machine Learning, Deep Learning, Recommendation, Search, or NLP", "Proficiency in Python or R", "Strong knowledge in SQL", "Proficient utilizing statistical techniques to identify key insights that help solve business problems"], "link": "https://www.indeed.com/jobs?q=data+science+internship&start=110&pp=gQClAAABiS3ZE3IAAAACCW0yDAAZAQATGktWR-z-gBIl3tZnH8Uv--FtKRLxTAAA&vjk=5953c9cb1f797338"}, {"title": "Data Science – Machine Learning Summer Intern\n- job post", "reqs": ["Assists Business Analysts in documenting current business procedures and processes", "Assists in the creation of documentation and definitions for technical systems, processes, business rules and data", "Researching new technologies and components", "Ensures Application information is correct and updated as required", "Deduces how to gain efficiencies in the project management function through the use of AI tools and techniques", "Evaluates the appropriateness of a projects management data for applying machine learning capabilities to automate the EPMO governance activities.", "Assesses the impact of AI capabilities available in the project management tool on the future of EPMO governance and project managements activities.", "Develops a road map for the EPMO organization to optimize manual processes through the use of artificial intelligence.", "Develop reporting related to the various activities of the project management framework", "Support the various activities of the project management methodology (e.g gates and artifacts reviews)", "Create an environment of diversity, equity, and inclusion where all perspectives are valued, and all people are welcomed.", "Currently enrolled in a Masters program at a University or College", "Preferably majoring in Information Systems, MIS, Engineering, Math, Business, or related field", "Preferably familiar with Microsoft tools (PowerBi, Power App and IAbuilder)", "Expected graduation date between December 2024 – May 2025", "Minimum cumulative GPA of 3.00", "Fluency in English, both written and verbal", "Strong analytics and critical thinking skills", "Ability to work independently and within teams", "Eager to learn and take on new responsibilities", "Availability for entire internship program", "Ability to maintain confidentiality", "Be ready to work and have a positive attitude. Our group is filled with hard working team-players who hit their goals, so you should be too", "Ability to work in an environment that supports employees from all backgrounds and fosters an environment of inclusion", "Extended working hours may be required as dictated by management and business needs", "Travel to multiple facilities may be required", "May be required to lift, push, or pull materials weighing up to twenty (20) pounds", "May be required to sit and review information on a computer screen for long periods of time", "May require repetitive motions of the hands and wrist related to writing and typing at an electronic keyboard"], "link": "https://www.indeed.com/jobs?q=data+science+internship&start=110&pp=gQClAAABiS3ZE3IAAAACCW0yDAAZAQATGktWR-z-gBIl3tZnH8Uv--FtKRLxTAAA&vjk=a371b9067ccb9633"}, {"title": "Machine Learning Intern (E-Commerce Recommendation/Search Alliance) - 2024 Summer (PHD)\n- job post", "reqs": ["Develop advanced machine learning techniques to boost our recommendation systems.", "Leverage ML, NLP, and computer vision to understand e-commerce behaviors.", "Implement and uphold real-time recommendation models.", "Dive into datasets to extract insights for strategic direction.", "Keep abreast of the latest in machine learning to bring innovation.", "Pursuing a PHD in Computer Science, Engineering, Operations Research, or related.", "Strong grasp of data structures, algorithms, and top-notch problem-solving skills.", "Profound knowledge in machine learning, statistics, and big data engineering.", "Must obtain work authorization in country of employment at the time of hire, and maintain ongoing work authorization during employment.", "Prior software engineering exposure: internships, work, coding contests, or publications.", "Experience or research in e-commerce, recommendation, or search engines.", "Contributions to conferences like KDD, NeurIPS, WWW, and more.", "An entrepreneurial spirit and excitement for emerging tech.", "Exceptional creativity and swift problem-solving ability."], "link": "https://www.indeed.com/jobs?q=data+science+internship&start=110&pp=gQClAAABiS3ZE3IAAAACCW0yDAAZAQATGktWR-z-gBIl3tZnH8Uv--FtKRLxTAAA&vjk=d301508f601478e5"}, {"title": "2024 Summer College Intern Data Analytics (Hybrid - Troy, MI) - Health Alliance Plan\n- job post", "reqs": ["Travel expense reimbursement not provided for required in person training and events.", "Learn about the business of health insurance and HAP.", "Gain real world experience.", "Work together towards a common goal (Capstone Project).", "Help the department assigned to meet its goals.", "Meet with HAP leaders.", "Work with PowerBI, Python, R, SAS, Matlab and other data science, visualization, and analytics tools.", "Work with leaders across the organization to understand their business and data and analytic needs.", "Own a solution from formation to completion.", "Work with students from other departments to achieve the best collaborative outcomes.", "Currently pursuing a bachelor’s or master’s degree in computer science, software engineering, data & analytics, business intelligence, or a closely related field of study.", "Proficient in Microsoft Office (PowerPoint, Excel, Word)", "Experience with PowerBI, Python, Jupyter Notebooks, Statistics applications, Data Modeling, and insurance/healthcare industry knowledge preferred."], "link": "https://www.indeed.com/jobs?q=data+science+internship&start=110&pp=gQClAAABiS3ZE3IAAAACCW0yDAAZAQATGktWR-z-gBIl3tZnH8Uv--FtKRLxTAAA&vjk=09e34d6e9151988c"}, {"title": "Data Analytics Internship - Summer 2024\n- job post", "reqs": ["Collaborate with cross-functional teams to gather and clean data from various sources.", "Conduct exploratory data analysis to identify trends, patterns, and insights.", "Support the creation of data visualizations and dashboards to communicate findings effectively.", "Assist in statistical analysis and predictive demand forecasting", "Help in generating actionable insights to drive business decisions.", "Document and present analysis results to team members.", "Get familiar with reporting & analytics tools: ThoughtSpot/Power BI", "Research on industry trends and best practices in data science and analytics.", "Currently pursuing a degree in Data Science, Business Analytics, Statistics, or a related field.", "3.0 GPA or higher", "Strong analytical and problem-solving skills.", "Excellent communication skills to convey complex findings in a clear manner.", "Ability to work independently and as part of a team.", "Eagerness to learn and adapt to new technologies and methodologies.", "Familiarity in data manipulation tools, like Python, R;", "Familiarity with data visualization tools like Tableau, Power BI, or similar."], "link": "https://www.indeed.com/jobs?q=data+science+internship&start=110&pp=gQClAAABiS3ZE3IAAAACCW0yDAAZAQATGktWR-z-gBIl3tZnH8Uv--FtKRLxTAAA&vjk=f65e7b7656567104"}, {"title": "IT Intern\n- job post", "reqs": ["Real-world experience: Work on projects that impact the transportation industry.", "Mentorship: Gain insights from experts in the field.", "Networking: Connect with professionals and fellow interns.", "Professional growth: Develop skills that will set you apart in your career.", "Fun and inclusive culture: Engage in team-building and social events.", "Document your journey and share your knowledge.", "Assist with IT support and troubleshooting.", "Dive into system administration and network tasks.", "Contribute to software development projects.", "Analyze data to fuel decision-making.", "Explore the world of cybersecurity.", "Innovate and Design", "Pursuing a Bachelor’s or Master’s degree", "Qualified candidates, excluding current Navistar employees, must be legally authorized on an unrestricted basis (US Citizen, Legal Permanent Resident, Refugee or Asylee) to be employed in the United States. Navistar does not anticipate providing employment related work sponsorship for this position (e.g., H-1B or F-1 status)", "Pursuing a degree in Computer Science, Data Science or Management Information Systems", "At least Sophomore standing for undergrad at the time of application", "Able to work at least 12 weeks (starting the end of May or early June through August)", "Passion for technology and a hunger to learn.", "Excellent problem-solving skills.", "Team player with strong communication.", "Bonus: Familiarity with programming, networking, or cybersecurity."], "link": "https://www.indeed.com/jobs?q=data+science+internship&start=110&pp=gQClAAABiS3ZE3IAAAACCW0yDAAZAQATGktWR-z-gBIl3tZnH8Uv--FtKRLxTAAA&vjk=3b140284dd2222a8"}, {"title": "Summer 2024 - Data Science Intern\n- job post", "reqs": ["You’ve got positive energy. You’re optimistic about the future and determined to get there.", "You’re never tired of learning. You want to be a pro in bleeding edge tech like DeFi, NFTs, DAOs, and Web 3.0.", "You appreciate direct communication. You’re both an active communicator and an eager listener - because let’s face it, you can’t have one without the other. You’re cool with candid feedback and see every setback as an opportunity to grow.", "You can pivot on the fly. Crypto is constantly evolving, so our priorities do, too. What you worked on last month may not be what you work on today, and that excites you. You’re not looking for a boring job.", "You have a “can do” attitude. Our teams create high-quality work on quick timelines. Owning a problem doesn’t scare you, but rather empowers you to take 100% responsibility for achieving our mission.", "You want to be part of a winning team. We’re stronger together, and you’re a person who embraces being pushed out of your comfort zone.", "Collaborate with functional teams to support analyses and modeling that prioritizes opportunities and provides insights.", "Assist in designing and conducting experiments/analysis to measure impact and suggest potential product improvements.", "Support the team in measuring business performance and help refine core metrics.", "Contribute to data-driven storytelling, distilling complex analyses into clear, actionable insights.", "Participate in analytical deep dives alongside senior team members to understand and address complex business problems.", "Assist in the development and maintenance of data pipelines, ensuring data integrity and accuracy.", "Some experience or coursework related to data analysis, statistical modeling, or other related fields.", "Basic understanding of statistical concepts and a keen interest in furthering this knowledge (in A|B testing, causal inference, ML, etc.).", "Familiarity with data analysis using SQL is a plus.", "Some experience or coursework in programming/modeling, preferably in Python.", "An embodiment of our core cultural values: clear communication, positive energy, continuous learning, and efficient execution.", "Degree or currently pursuing BA/BS degree in a quantitative field (ex. Math, Stats, Physics, or Computer Science).", "Exposure or interest in data engineering.", "Eagerness to delve into varying levels of data work to understand and improve foundational data structures.", "Medical Plan, Dental and Vision Plan with generous employee contributions", "Health Savings Account with company contributions each pay period", "Disability and Life Insurance", "401(k) plan with company match", "Wellness Stipend", "Mobile/Internet Reimbursement", "Remote-First Stipend", "Connections Stipend", "Volunteer Time Off", "Fertility Counseling and Benefits", "18 weeks paid Parental Leave", "The option of getting paid in digital currency"], "link": "https://www.indeed.com/jobs?q=data+science+internship&start=120&pp=gQC0AAAAAAAAAAAAAAACFjYwFgBWAQEBDwHnzmAMOKC3ykR60bjn6Y5jzZxApn9Cyb6OStQAKMukYaFkRxYZSt8TN8r7h3kNCf0NLfRsHYoT1XQvZT-LDfRzIkjbhLXDPBx8qFVw1el0Ox0AAA&vjk=aeef8db846212f9b"}, {"title": "Winter 2024 Intern, Data Science\n- job post", "reqs": ["Define and validate metrics to accurately measure autonomy performance and evaluation system trustworthiness.", "Facilitate development of our data platform and ensure cleanliness. Create a data view that is clean and metrics are thus reliable on this dataset.", "Correlate performance of the Kodiak Driver on-road with simulation results.", "Work closely with other teams and ensure the team is supported with data necessary to make timely, informed decisions", "Define and validate metrics to accurately measure autonomy performance and evaluation system trustworthiness.", "Facilitate development of our data platform and ensure cleanliness. Create a data view that is clean and metrics are thus reliable on this dataset.", "Correlate performance of the Kodiak Driver on-road with simulation results.", "Work closely with other teams and ensure the team is supported with data necessary to make timely, informed decisions", "BS, MS or PhD in Computer Science, Statistics, Operations Research or related quantitative technical fields.", "Strong understanding of data aggregation and interrogation statistics metrics implementation & underlying mathematical/statistical principles", "Ability to communicate complex data in a simple, actionable way", "Practical knowledge of common data analysis, inference, and statistical modeling tools, using Python and SQL", "Take ownership and enjoy working with the team to deliver actionable results.", "BS, MS or PhD in Computer Science, Statistics, Operations Research or related quantitative technical fields.", "Strong understanding of data aggregation and interrogation statistics metrics implementation & underlying mathematical/statistical principles", "Ability to communicate complex data in a simple, actionable way", "Practical knowledge of common data analysis, inference, and statistical modeling tools, using Python and SQL", "Take ownership and enjoy working with the team to deliver actionable results.", "Start Date: January 2024.", "Our internship program is 12-16 weeks; the end date is flexible based on individual needs.", "Location: Mountain View, CA.", "Housing: interns are responsible for housing.", "Start Date: January 2024.", "Our internship program is 12-16 weeks; the end date is flexible based on individual needs.", "Location: Mountain View, CA.", "Housing: interns are responsible for housing.", "A fast paced environment where we work with talented, committed and supportive teammates.", "Competitive pay.", "Excellent medical, dental and vision benefits.", "A beautiful facility in Mountain View.", "We love our dogs, so we are a dog friendly office!", "Free catered lunch.", "A fast paced environment where we work with talented, committed and supportive teammates.", "Competitive pay.", "Excellent medical, dental and vision benefits.", "A beautiful facility in Mountain View.", "We love our dogs, so we are a dog friendly office!", "Free catered lunch."], "link": "https://www.indeed.com/jobs?q=data+science+internship&start=120&pp=gQC0AAAAAAAAAAAAAAACFjYwFgBWAQEBDwHnzmAMOKC3ykR60bjn6Y5jzZxApn9Cyb6OStQAKMukYaFkRxYZSt8TN8r7h3kNCf0NLfRsHYoT1XQvZT-LDfRzIkjbhLXDPBx8qFVw1el0Ox0AAA&vjk=6cb6793d38e2cf21"}, {"title": "Data Scientist: Internship Opportunities\n- job post", "reqs": ["Formulate approaches to solve problems using well defined algorithms and data sources", "Incorporate an understanding of product functionality and customer perspective to provide context for those problems", "Use data exploration techniques to discover new questions or opportunities within your problem area and propose applicability and limitations of the data", "Interpret the results of their analysis, validate their approach, and learn to monitor, analyze, and iterate to continuously improve", "Engage with peer stakeholders to produce clear, compelling, actionable insights that influence product and service improvements that will impact millions of customers.", "Participate in the peer review process and act on feedback while learning innovative methods, algorithms, and tools to increase the impact and applicability of your results", "Currently pursuing a Bachelor's or Master's in Computer Science, Mathematics, Economics, Statistics, Applied Sciences like Biostatistics, Physics, Chemistry, Computational Neurology and or other quant-focused field\nMust have at least one additional quarter/semester of school remaining following the completion of the internship", "Must have at least one additional quarter/semester of school remaining following the completion of the internship", "Must have at least one additional quarter/semester of school remaining following the completion of the internship", "Some Engineering experience and or project course work using large data systems on SQL, Hadoop, etc.", "Proficiency using one or more programming or scripting language to work with data such as: Python, Perl, or C#.", "Some experience and or project course work performing data analysis and applying statistics working with tools such as: Excel, R, MATLAB, AMPL, or SAS.", "Some experience and or project course work with product and service telemetry systems.", "Some A/B Testing or experimentation (this can be from conducting real life science experiments, hypothesis testing in stats etc.) Not required but ideal.", "Some experience or course work applying basic ML to a type of data and or used algorithms to conduct experiments on data."], "link": "https://www.indeed.com/jobs?q=data+science+internship&start=120&pp=gQC0AAAAAAAAAAAAAAACFjYwFgBWAQEBDwHnzmAMOKC3ykR60bjn6Y5jzZxApn9Cyb6OStQAKMukYaFkRxYZSt8TN8r7h3kNCf0NLfRsHYoT1XQvZT-LDfRzIkjbhLXDPBx8qFVw1el0Ox0AAA&vjk=bfb422c496ecfeda"}, {"title": "2024 Intern - DEX Data & Insights\n- job post", "reqs": [], "link": "https://www.indeed.com/jobs?q=data+science+internship&start=120&pp=gQC0AAAAAAAAAAAAAAACFjYwFgBWAQEBDwHnzmAMOKC3ykR60bjn6Y5jzZxApn9Cyb6OStQAKMukYaFkRxYZSt8TN8r7h3kNCf0NLfRsHYoT1XQvZT-LDfRzIkjbhLXDPBx8qFVw1el0Ox0AAA&vjk=cd5588105acffac7"}, {"title": "Data Science Internship\n- job post", "reqs": ["Create and maintain customer experience dashboards via Spotfire, Tableau, Power BI.", "Collaborate with internal cross functional teams to create intuitive dashboards and data processing recommendations in supporting customer needs.", "Develop and deliver effective data stories through high impact data visualizations and communication skills.", "Gain meaningful and transferable experience from the real work you will be provided, relationship management, and professional development.", "Rising student in school with requisite educational experience in Business Analytics, Data Science", "A GPA of 3.0 or higher", "Prior experience using dashboard tools such as Tableau, Spotfire or Power BI is a plus", "A well-rounded skill set including strong critical thinking, communication, collaboration, and project management skills as well as an interest in data visualization, advanced analytics, and finding innovative solutions to complex business questions."], "link": "https://www.indeed.com/jobs?q=data+science+internship&start=120&pp=gQC0AAAAAAAAAAAAAAACFjYwFgBWAQEBDwHnzmAMOKC3ykR60bjn6Y5jzZxApn9Cyb6OStQAKMukYaFkRxYZSt8TN8r7h3kNCf0NLfRsHYoT1XQvZT-LDfRzIkjbhLXDPBx8qFVw1el0Ox0AAA&vjk=c09ba85c60ce7702"}, {"title": "2024 Intern - Data Analyst\n- job post", "reqs": ["Extract and analyze data to understand the customer product life cycle and value realization from the product", "Identify and report product features of high and low usage", "Develop dashboards/reports that provide useful insights to business leaders", "Develop scripts to automate data extraction from product databases", "Develop in-house analytical tools that improve the productivity and efficiency of analytical tasks", "Monitor website’s performance using a combination of streaming click data, business databases sources, and company-wide warehouses", "Co-design A/B experiments, conduct statistical analysis on test results and present findings.", "Support ad-hoc querying and analyses to understand customer behavior and diagnose data discrepancies", "Currently enrolled full time and pursuing either a Bachelor's or Master’s in Data Science, Data Analytics, Data Engineering, Statistics, Mathematics, or Engineering is desired; or equivalent experience required", "Solid understanding of SQL and R/Python", "Good attention to detail with the ability to stitch, calibrate and quality control multiple data sources.", "Self-starter with ability to multi-task, adapt quickly, problem solve, and learn quickly", "Ability to participate in a full-time internship between May-September"], "link": "https://www.indeed.com/jobs?q=data+science+internship&start=120&pp=gQC0AAAAAAAAAAAAAAACFjYwFgBWAQEBDwHnzmAMOKC3ykR60bjn6Y5jzZxApn9Cyb6OStQAKMukYaFkRxYZSt8TN8r7h3kNCf0NLfRsHYoT1XQvZT-LDfRzIkjbhLXDPBx8qFVw1el0Ox0AAA&vjk=524394e78f1b42b4"}, {"title": "Data Science Internship\n- job post", "reqs": ["Undergraduate or Graduate major focusing on Computer Science, Engineering, or similar computational discipline", "Python programming experience", "Strong machine learning knowledge and/or mathematical foundations with experience solving tough, real-world problems", "Excellent collaboration skills"], "link": "https://www.indeed.com/jobs?q=data+science+internship&start=120&pp=gQC0AAAAAAAAAAAAAAACFjYwFgBWAQEBDwHnzmAMOKC3ykR60bjn6Y5jzZxApn9Cyb6OStQAKMukYaFkRxYZSt8TN8r7h3kNCf0NLfRsHYoT1XQvZT-LDfRzIkjbhLXDPBx8qFVw1el0Ox0AAA&vjk=f1615bd64a8b6035"}]